<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on Oktober, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 6. Ausdr&uuml;cke</title>

<meta name="description" content="Maxima Manual: 6. Ausdr&uuml;cke">
<meta name="keywords" content="Maxima Manual: 6. Ausdr&uuml;cke">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Ausdr_00fccke"></a>
<a name="SEC39"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_5.html#SEC38" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC40" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_5.html#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 6. Ausdr&uuml;cke </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC40">6.1 Einf&uuml;hrung in Ausdr&uuml;cke</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC41">6.2 Substantive und Verben</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC42">6.3 Bezeichner</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC43">6.4 Funktionen und Variablen f&uuml;r Ausdr&uuml;cke</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Ausdr_00fccke"></a>
<a name="SEC40"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC39" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC41" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC39" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.1 Einf&uuml;hrung in Ausdr&uuml;cke </h2>

<p>Alles in Maxima, bis auf wenige Ausnahmen, sind Ausdr&uuml;cke.  Dazu geh&ouml;ren 
mathematische Ausdr&uuml;cke wie <code>sqrt(2*a+b)</code> oder Kommandos wie
<code>subst(a^2,b,sin(b+1)</code>.  Auch Maxima-Programme sind Ausdr&uuml;cke.
Ausdr&uuml;cke bestehen aus einem Atom oder einem Operator mit seinen Argumenten.
</p>
<p>Ein Atom kann ein Symbol, eine Zeichenkette, eine ganze Zahl oder 
eine Gleitkommazahl sein.  Jeder Ausdruck, der nicht ein Atom ist, hat die 
Darstellung <code>op(a_1, a_2, ..., a_n)</code>.  <code>op</code> ist der Operator und 
<code>a_1</code>, &hellip;, <code>a_n</code> sind die Argumente des Operators.  Die Argumente
des Operators k&ouml;nnen Atome oder wiederum Operatoren mit Argumenten sein.
</p>
<p>Da Maxima in Lisp programmiert ist, wird ein Ausdruck intern als eine Liste 
dargestellt, die die Gestalt <code>((op) a_1 a_2 ... a_n)</code> hat.  Die 
arithmetischen Operatoren &quot;+&quot; und &quot;*&quot; haben zum Beispiel die interne 
Darstellung:
</p>
<pre class="example">x+y+10  -&gt; ((mplus) 10 $x $y)
2*x*x   -&gt; ((mtimes) 2 $x $y)
2*(x+y) -&gt; ((mtimes) 2 ((mplus) $x $y)
</pre>
<p>Mathematische Funktionen wie die trigonometrischen Funktionen oder die 
Logarithmusfunktion werden von Maxima intern analog dargestellt:
</p>
<pre class="example">sin(x)          -&gt; ((%sin) $x)
log(y)          -&gt; ((%log) $y)
2*sin(x)+log(y) -&gt; ((mplus) ((mtimes) 2 ((%sin) $x)) ((%log) $y)) 
</pre>
<p>Mehrere Ausdr&uuml;cke k&ouml;nnen zusammengefa&szlig;t werden, indem die Ausdr&uuml;cke 
durch Kommata getrennt und mit runden Klammern umgeben werden.
</p>
<pre class="example">(%i1) x: 3$
(%i2) (x: x+1, x: x^2);
(%o2)                          16
(%i3) (if (x &gt; 17) then 2 else 4);
(%o3)                           4
(%i4) (if (x &gt; 17) then x: 2 else y: 4, y+x);
(%o4)                          20
</pre>
<p>Auch Programmschleifen sind in Maxima Ausdr&uuml;cke.  Der R&uuml;ckgabewert einer 
Programmschleife ist <code>done</code>.
</p>
<pre class="example">(%i1) y: (x: 1, for i from 1 thru 10 do (x: x*i))$
(%i2) y;
(%o2)                         done
</pre>
<p>Um einen anderen R&uuml;ckgabewert als <code>done</code> zu erhalten, kann zum Beispiel 
der Wert der Variablen <var>x</var> nach dem Ende der Programmschleife ausgegeben 
werden.
</p>
<pre class="example">(%i3) y: (x: 1, for i from 1 thru 10 do (x: x*i), x)$
(%i4) y;
(%o4)                        3628800
</pre>
<p>Es gibt eine Anzahl an reservierten Namen, die nicht als Variablennamen 
verwendet werden sollten.  Ihre Verwendung kann m&ouml;glicherweise kryptische
Fehlermeldungen erzeugen.  Dazu geh&ouml;ren zum Beispiel die folgenden Namen:
</p>
<pre class="verbatim">   integrate            next           from                 diff            
   in                   at             limit                sum             
   for                  and            elseif               then            
   else                 do             or                   if              
   unless               product        while                thru            
   step                                                                     
</pre>

<p>Funktionen und Variablen um einen Teilausdruck zu isolieren:
</p>
<pre class="verbatim">   isolate     disolate  isolate_wrt_times   expisolate
   part        inpart    substpart           substinpart
   inflag      piece     partswitch
   pickapart
</pre>

<p>Funktionen und Variablen f&uuml;r Substantive und Verben:
</p>
<pre class="verbatim">   nounify   verbify     alias     aliases
</pre>

<p>Funktionen und Variablen, um zu pr&uuml;fen, ob ein Teilausdruck enthalten ist und 
um eine Liste der Variablen eines Ausdrucks zu erstellen:
</p>
<pre class="verbatim">   freeof       lfreeof
   listofvars   listconstvars    listdummyvars
</pre>

<p>Funktionen und Variablen f&uuml;r Operatoren und Argumente:
</p>
<pre class="verbatim">   args    op    operatorp
</pre>

<p>Funktionen und Variablen f&uuml;r Substitutionen in Ausdr&uuml;cke:
</p>
<pre class="verbatim">   subst psubst sublis exptsubst opsubst
</pre>

<p>Funktionen und Variablen f&uuml;r die kanonische Ordnung der Argumente eines 
Ausdrucks:
</p>
<pre class="verbatim">   ordergreat    orderless    unorder
   ordergreatp   orderlessp   ordermagnitudep
</pre>

<p>Weitere Funktionen und Variablen:
</p>
<pre class="verbatim">   nterms   optimize   optimprefix   partition
</pre>
<p><a name="verb"></a>
</p><hr size="6">
<a name="Substantive-und-Verben"></a>
<a name="SEC41"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC40" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC42" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC39" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.2 Substantive und Verben </h2>

<p>Operatoren und Funktionen k&ouml;nnen als Substantiv oder Verb vorliegen.  Verben 
werden von Maxima ausgewertet.  Substantive, die in einem Ausdruck auftreten, 
werden dagegen nicht ausgewertet, sondern vereinfacht.  Die meisten 
mathematischen Funktionen sind Substantive.  Funktionen wie
<code><a href="maxima_16.html#limit">limit</a></code>, <code><a href="maxima_16.html#diff">diff</a></code> oder <code><a href="maxima_16.html#integrate">integrate</a></code> sind standardm&auml;&szlig;ig
Verben, die jedoch in ein Substantiv umgewandelt werden k&ouml;nnen.  Ein Verb kann
durch den <a href="maxima_8.html#g_t_0027">Quote-Operator</a> <code>'</code> oder mit der Funktion
<code><a href="#nounify">nounify</a></code> in ein Substantiv umgewandelt werden.  Der Auswertungsschalter 
<code><a href="maxima_8.html#nouns">nouns</a></code> bewirkt, dass Substantive von der Funktion <code><a href="maxima_8.html#ev">ev</a></code> ausgewertet 
werden.
</p>
<p>In der internen Darstellung von Maxima erhalten Lisp-Symbole, die ein Verb 
darstellen, ein f&uuml;hrendes Dollarzeichen <code>$</code>.  Lisp-Symbole, die ein 
Substantiv darstellen, erhalten ein f&uuml;hrendes Prozentzeichen <code>%</code>.  Einige
Substantive wie <code>'integrate</code> oder <code>'derivative</code> haben eine spezielle 
Darstellung f&uuml;r die Ausgabe.  Standardm&auml;&szlig;ig werden jedoch Substantive
und Verben identisch dargestellt.  Hat die Optionsvariable <code><a href="#noundisp">noundisp</a></code> den
Wert <code>true</code>, werden Substantive mit einem f&uuml;hrenden Hochkommata
angezeigt.
</p>
<p>Siehe auch <code><a href="#noun">noun</a></code>, <code><a href="maxima_8.html#nouns">nouns</a></code>, <code><a href="#nounify">nounify</a></code> und 
<code><a href="#verbify">verbify</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) foo (x) := x^2;
                                     2
(%o1)                     foo(x) := x
(%i2) foo (42);
(%o2)                         1764
(%i3) 'foo (42);
(%o3)                        foo(42)
(%i4) 'foo (42), nouns;
(%o4)                         1764
(%i5) declare (bar, noun);
(%o5)                         done
(%i6) bar (x) := x/17;
                                     x
(%o6)                    ''bar(x) := --
                                     17
(%i7) bar (52);
(%o7)                        bar(52)
(%i8) bar (52), nouns;
                               52
(%o8)                          --
                               17
(%i9) integrate (1/x, x, 1, 42);
(%o9)                        log(42)
(%i10) 'integrate (1/x, x, 1, 42);
                             42
                            /
                            [   1
(%o10)                      I   - dx
                            ]   x
                            /
                             1
(%i11) ev (%, nouns);
(%o11)                       log(42)
</pre>
<hr size="6">
<a name="Bezeichner"></a>
<a name="SEC42"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC41" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC43" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC39" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.3 Bezeichner </h2>

<p>Maxima Bezeichner bestehen aus den Buchstaben des Alphabets und den 
Zahlzeichen 0 bis 9.  Sonderzeichen k&ouml;nnen in einem Bezeichner mit einem
vorangestellten Backslash <code>\</code> verwendet werden, zum Beispiel <code>a\&amp;b</code>.
</p>
<p>Ein Zahlzeichen kann der erste Buchstabe eines Bezeichners sein, wenn ihm ein 
Backslash vorangestellt ist, zum Beispiel <code>\2and3</code>.  Zahlzeichen, die an 
anderen Stellen auftreten, muss kein Backslash vorangestellt werden, zum 
Beispiel <code>is5</code>.
</p>
<p>Sonderzeichen k&ouml;nnen mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code> als alphabetisch 
erkl&auml;rt werden.  In diesem Fall muss dem Sonderzeichen kein Backslash 
vorangestellt werden, wenn es in einem Bezeichner genutzt wird.  Die Zeichen 
<code>A</code> bis <code>Z</code>, <code>a</code> bis <code>z</code> und <code>0</code> bis <code>9</code> sowie
die Zeichen <code>%</code> und <code>_</code> haben bereits die Eigenschaft alphabetisch.
</p>
<p>Maxima unterscheidet Gro&szlig;- und Kleinschreibung.  So werden von Maxima 
<code>foo</code>, <code>FOO</code> oder <code>Foo</code> unterschieden.  Ein Maxima-Bezeichner 
ist ein Lisp-Symbol, dem ein Dollarzeichen <code>$</code> vorangestellt ist.
Lisp-Symbolen, die in Maxima verwendet werden sollen, ist ein Fragezeichen 
<code>?</code> vorangestellt.  Siehe das Kapitel <a href="maxima_27.html#SEC197">Lisp und Maxima</a> f&uuml;r eine 
ausf&uuml;hrlichere Beschreibung.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) %an_ordinary_identifier42;
(%o1)               %an_ordinary_identifier42
(%i2) embedded\ spaces\ in\ an\ identifier;
(%o2)           embedded spaces in an identifier
(%i3) symbolp (%);
(%o3)                         true
(%i4) [foo+bar, foo\+bar];
(%o4)                 [foo + bar, foo+bar]
(%i5) [1729, \1729];
(%o5)                     [1729, 1729]
(%i6) [symbolp (foo\+bar), symbolp (\1729)];
(%o6)                     [true, true]
(%i7) [is (foo\+bar = foo+bar), is (\1729 = 1729)];
(%o7)                    [false, false]
(%i8) baz\~quux;
(%o8)                       baz~quux
(%i9) declare (&quot;~&quot;, alphabetic);
(%o9)                         done
(%i10) baz~quux;
(%o10)                      baz~quux
(%i11) [is (foo = FOO), is (FOO = Foo), is (Foo = foo)];
(%o11)                [false, false, false]
(%i12) :lisp (defvar *my-lisp-variable* '$foo)
*MY-LISP-VARIABLE*
(%i12) ?\*my\-lisp\-variable\*;
(%o12)                         foo
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Ausdr_00fccke"></a>
<a name="SEC43"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC42" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC39" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.4 Funktionen und Variablen f&uuml;r Ausdr&uuml;cke </h2>

<p><a name="alias"></a>
</p><dl>
<dt><u>Funktion:</u> <b>alias</b><i> (<var>new_name_1</var>, <var>old_name_1</var>, &hellip;, <var>new_name_n</var>, <var>old_name_n</var>)</i>
<a name="IDX186"></a>
</dt>
<dd><p>Die Funktion <code>alias</code> erm&ouml;glicht einen alternativen Alias-Namen f&uuml;r eine 
Maxima-Funktion, einer Variablen oder einem Array.  Der Funktion <code>alias</code> 
kann eine beliebige Anzahl von paarweisen Namen und Alias-Namen &uuml;bergeben 
werden.
</p>
<p><code>alias</code> gibt eine Liste mit den Symbolen zur&uuml;ck, denen ein Alias-Name
zugewiesen werden konnte.  Wurde einem Symbol bereits derselbe Alias-Name 
gegeben, enth&auml;lt die Liste den Wert <code>false</code>.  Wird versucht einem Symbol,
das bereits einen Alias-Namen hat, einen neuen Alias-Namen zu geben, bricht
<code>alias</code> mit einer Fehlermeldung ab.
</p>
<p>Symbole, die einen Alias-Namen erhalten haben, werden in die Systemvariable 
<code>aliases</code> eingetragen.  Siehe die Systemvariable <code><a href="#aliases">aliases</a></code>.
</p>
<p>Die Funktionen <code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code> sowie die Deklaration
eines Symbols als ein <code><a href="#noun">noun</a></code> mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code> erzeugen
automatisch Alias-Namen, die in die Liste <code>aliases</code> eingetragen werden.
</p>
<p>Der Alias-Name kann mit der Funktion <code><a href="maxima_4.html#kill">kill</a></code> entfernt werden.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) alias(mysqrt,sqrt);
(%o1)                        [sqrt]
(%i2) aliases;
(%o2)                        [sqrt]
(%i3) mysqrt(4);
(%o3)                           2
(%i4) kill(mysqrt);
(%o4)                         done
(%i5) mysqrt(4);
(%o5)                       mysqrt(4)
(%i6) aliases;
(%o6)                          []
</pre></dd></dl>

<p><a name="aliases"></a>
</p><dl>
<dt><u>Systemvariable:</u> <b>aliases</b>
<a name="IDX187"></a>
</dt>
<dd><p>Anfangswert: <code>[]</code>
</p>
<p>Die Systemvariable <code>aliases</code> ist eine Informationsliste der Symbole, die 
einen vom Nutzer definierten Alias-Namen mit dem Kommando <code>alias</code> 
erhalten haben.  Weiterhin werden von den Funktionen <code><a href="#ordergreat">ordergreat</a></code> und 
<code><a href="#orderless">orderless</a></code> sowie bei der Deklaration eines Symbols als ein
<code><a href="#noun">noun</a></code> mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code> Alias-Namen generiert, die in die
Liste <code>aliases</code> eingetragen werden.
</p>
<p>Siehe auch die Funktion <code><a href="#alias">alias</a></code> f&uuml;r ein Beispiel.
</p></dd></dl>

<p><a name="allbut"></a>
</p><dl>
<dt><u>Schl&uuml;sselwort:</u> <b>allbut</b>
<a name="IDX188"></a>
</dt>
<dd><p>Das Schl&uuml;sselwort <code>allbut</code> wird bei <code>part</code>-Befehlen wie
<code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code>, <code><a href="#substpart">substpart</a></code>,
<code><a href="#substinpart">substinpart</a></code>, <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> genutzt, um Indizes bei
der Auswahl von Teilausdr&uuml;cken auszuschlie&szlig;en.
</p>
<p>Das Schl&uuml;sselwort <code>allbut</code> kann auch zusammen mit dem Kommando
<code>kill</code> verwendet werden.  <code>kill(allbut(<var>a_1</var>, <var>a_2</var>, ...))</code>
hat denselben Effekt wie <code>kill(all)</code> mit der Ausnahme, dass die Symbole 
<var>a_1</var>, <var>a_2</var>, &hellip; von <code>kill</code> ausgenommen werden.  Siehe die 
Funktion <code><a href="maxima_4.html#kill">kill</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, [2, 5]);
(%o2)                         d + a

(%i3) expr : e + d + c + b + a;
(%o3)                   e + d + c + b + a
(%i4) part (expr, allbut (2, 5));
(%o4)                       e + c + b
</pre>
<p>Das Schl&uuml;sselwort <code>allbut</code> kann zusammen mit dem Kommando <code>kill</code>
verwendet werden.
</p>
<pre class="example">(%i1) [aa : 11, bb : 22, cc : 33, dd : 44, ee : 55];
(%o1)                 [11, 22, 33, 44, 55]
(%i2) kill (allbut (cc, dd));
(%o0)                         done
(%i1) [aa, bb, cc, dd];
(%o1)                   [aa, bb, 33, 44]
</pre></dd></dl>

<p><a name="args"></a>
</p><dl>
<dt><u>Funktion:</u> <b>args</b><i> (<var>expr</var>)</i>
<a name="IDX189"></a>
</dt>
<dd><p>Die Funktion <code>args</code> gibt eine Liste mit den Argumenten des Hauptoperators
des Ausdrucks <var>expr</var> zur&uuml;ck.
</p>
<p>Die Anordnung der Argumente der Ergebnisliste wird von der Optionsvariablen
<code>inflag</code> beeinflu&szlig;t.  Hat <code>inflag</code> den Wert <code>true</code>, ist die
Anordnung entsprechend der internen Darstellung des Ausdrucks <var>expr</var>.
Ansonsten ist die Anordnung wie in der externen Darstellung f&uuml;r die Anzeige.
Siehe die Optionsvariable <code><a href="#inflag">inflag</a></code>.
</p>
<p><code>args(<var>expr</var>)</code> ist &auml;quivalent zu 
<code>substpart(&quot;[&quot;, <var>expr</var>, 0)</code>.  Siehe auch <code><a href="#substpart">substpart</a></code> und 
<code><a href="#op">op</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) args(gamma_incomplete(a,x));
(%o1)                        [a, x]
(%i2) args(x+y+z);
(%o2)                       [z, y, x]
(%i3) args(x+y+z),inflag:true;
(%o3)                       [x, y, z]
(%i4) args(x+2*a);
(%o4)                       [x, 2 a]
</pre></dd></dl>

<p><a name="atom"></a>
</p><dl>
<dt><u>Funktion:</u> <b>atom</b><i> (<var>expr</var>)</i>
<a name="IDX190"></a>
</dt>
<dd><p>Gibt den Wert <code>true</code> zur&uuml;ck, wenn das Argument <var>expr</var> ein Atom ist.
Atome sind ganze Zahlen, Gleitkommazahlen, Zeichenketten und Symbole.  Siehe
auch die Funktionen <code><a href="#symbolp">symbolp</a></code> und <code><a href="maxima_5.html#listp">listp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) atom(5);
(%o1)                         true
(%i2) atom(5.0);
(%o2)                         true
(%i3) atom(5.0b0);
(%o3)                         true
(%i4) atom(1/2);
(%o4)                         false
(%i5) atom('a);
(%o5)                         true
(%i6) atom(2*x);
(%o6)                         false
(%i7) atom(&quot;string&quot;);
(%o7)                         true
</pre></dd></dl>

<p><a name="box"></a>
</p><dl>
<dt><u>Funktion:</u> <b>box</b><i> (<var>expr</var>)</i>
<a name="IDX191"></a>
</dt>
<dt><u>Funktion:</u> <b>box</b><i> (<var>expr</var>, <var>a</var>)</i>
<a name="IDX192"></a>
</dt>
<dd><p>Die Funktion <code>box(<var>expr</var>)</code> umschlie&szlig;t den Ausdruck <var>expr</var> in 
der Ausgabe mit einem Rahmen, wenn <code>display2d</code> den Wert <code>true</code> hat.
Ansonsten ist der R&uuml;ckgabewert ein Ausdruck mit <code>box</code> als Operator und 
<var>expr</var> als Argument.
</p>
<p><code>box(<var>expr</var>, <var>a</var>)</code> umschlie&szlig;t <var>expr</var> mit einem Rahmen, der
mit einer Marke <var>a</var> bezeichnet ist.  Ist die Marke l&auml;nger als der Rahmen,
werden Zeichen abgeschnitten.
</p>
<p>Die Funktion <code>box</code> wertet ihre Argumente aus.  Die eingerahmten Ausdr&uuml;cke
werden dagegen nicht mehr ausgewertet.
</p>
<p>Die Optionsvariable <code><a href="#boxchar">boxchar</a></code> enth&auml;lt das Zeichen, das von den Funktionen
<code>box</code> sowie <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> verwendet wird, um den Rahmen
auszugeben.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
</pre></dd></dl>

<p><a name="boxchar"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>boxchar</b>
<a name="IDX193"></a>
</dt>
<dd><p>Standardwert: <code>&quot;</code>
</p>
<p>Die Optionsvariable <code>boxchar</code> enth&auml;lt das Zeichen, welches von den 
Funktionen <code><a href="#box">box</a></code> sowie <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> genutzt wird, um
einen Rahmen auszugeben.
</p>
<p>Die Rahmen werden immer mit dem aktuellen Wert von <code>boxchar</code> ausgegeben.
Das Zeichen <code>boxchar</code> wird nicht zusammen mit dem eingerahmten Ausdruck
gespeichert.
</p></dd></dl>

<p><a name="collapse"></a>
</p><dl>
<dt><u>Funktion:</u> <b>collapse</b><i> (<var>expr</var>)</i>
<a name="IDX194"></a>
</dt>
<dt><u>Funktion:</u> <b>collapse</b><i> ([<var>expr_1</var>, <var>expr_2</var>, &hellip;])</i>
<a name="IDX195"></a>
</dt>
<dd><p>Komprimiert einen Ausdruck <var>expr</var>, indem gemeinsame Teilausdr&uuml;cke 
denselben Speicher nutzen.  <code>collapse</code> wird von der Funktion 
<code>optimize</code> aufgerufen.  <code>collapse</code> kann auch mit einer Liste 
aufgerufen werden, die mehrere Argumente enth&auml;lt.
</p>

<p>Siehe auch die Funktion <code><a href="#optimize">optimize</a></code>.
</p></dd></dl>

<p><a name="dispform"></a>
</p><dl>
<dt><u>Funktion:</u> <b>dispform</b><i> (<var>expr</var>)</i>
<a name="IDX196"></a>
</dt>
<dt><u>Funktion:</u> <b>dispform</b><i> (<var>expr</var>, all)</i>
<a name="IDX197"></a>
</dt>
<dd><p><code>dispform</code> formatiert den Ausdruck <var>expr</var> von der internen Darstellung
in eine externe Darstellung, wie sie f&uuml;r die Anzeige des Ausdrucks ben&ouml;tigt 
wird.  Bei der Formatierung sind Optionsvariablen wie <code><a href="maxima_18.html#dispflag">dispflag</a></code> und
<code><a href="maxima_4.html#powerdisp">powerdisp</a></code> wirksam.
</p>
<p>Beispiele f&uuml;r die interne und externe Darstellung von Ausdr&uuml;cken sind:
</p>
<pre class="example">          Interne Darstellung            Externe Darstellung
------------------------------------------------------------
-x      : ((MTIMES) -1 $x)               ((MMINUS) $x)
sqrt(x) : ((MEXPT) $x ((RAT) 1 2))       ((%SQRT) $X)
a/b     : ((MTIMES) $A ((MEXPT) $B -1))  ((MQUOTIENT) $A $B)
</pre>
<p><code>dispform(<var>expr</var>)</code> gibt die externe Darstellung nur f&uuml;r den ersten 
Operator im Ausdruck zur&uuml;ck.  <code>dispform(<var>expr</var>, all)</code> gibt die 
externe Darstellung aller Operatoren im Ausdruck <var>expr</var> zur&uuml;ck.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#inflag">inflag</a></code>.
</p>
<p>Beispiel:
</p>
<p>Die Funktion <code>dispform</code> kann genutzt werden, um die Wurzelfunktion in
einem Ausdruck zu substituieren.  Die Wurzelfunktion ist nur in der externen
Darstellung eines Ausdruckes vorhanden:
</p>
<pre class="example">(%i1) expr: sqrt(5)/(5+sqrt(2));
                             sqrt(5)
(%o1)                      -----------
                           sqrt(2) + 5
(%i2) subst(f,sqrt,expr);
                             sqrt(5)
(%o2)                      -----------
                           sqrt(2) + 5
(%i3) subst(f,sqrt,dispform(expr));
                              f(5)
(%o3)                      -----------
                           sqrt(2) + 5
(%i4) subst(f,sqrt,dispform(expr,all));
                              f(5)
(%o4)                       --------
                            f(2) + 5
</pre></dd></dl>

<p><a name="disolate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>disolate</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX198"></a>
</dt>
<dd><p>Die Funktion <code>disolate</code> arbeitet &auml;hnlich wie die Funktion <code>isolate</code>.
Teilausdr&uuml;cke im Ausdruck <var>expr</var>, die die Variablen <var>x_1</var>, &hellip;, 
<var>x_n</var> nicht enthalten, werden durch Zwischenmarken <code>%t1</code>, <code>%t2</code>, 
&hellip; ersetzt.  Im Unterschied zu der Funktion <code>isolate</code> kann die
Funktion <code>disolate</code> Teilausdr&uuml;cke zu mehr als einer Variablen aus einem
Ausdruck isolieren.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken durch Zwischenmarken kann mit der 
Optionsvariable <code>isolate_wrt_times</code> kontrolliert werden.  Hat die
Optionsvariable <code>isolate_wrt_times</code> den Wert <code>true</code>, werden 
Ersetzungen in Produkten ausgef&uuml;hrt.  Der Standardwert ist <code>false</code>.
Siehe <code><a href="#isolate_005fwrt_005ftimes">isolate_wrt_times</a></code> f&uuml;r Beispiele.
</p>
<p>Die Optionsvariable <code><a href="#exptisolate">exptisolate</a></code> hat im Unterschied zur Funktion
<code>isolate</code> keinen Einfluss auf die Ersetzung von Teilausdr&uuml;cken durch
Zwischenmarken.
</p>
<p><code>disolate</code> wird automatisch aus der Datei
<tt>`share/simplification/disol.mac'</tt> geladen.  Das Kommando 
<code>demo(disol)$</code> zeigt Beispiele.
</p>
<p>Siehe auch die Funktion <code><a href="#isolate">isolate</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) expr:a*(e*(g+f)+b*(d+c));
(%o1)               a (e (g + f) + b (d + c))
(%i2) disolate(expr,a,b,e);
(%t2)                         d + c

(%t3)                         g + f

(%o3)                   a (%t3 e + %t2 b)
</pre></dd></dl>

<p><a name="dpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>dpart</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX199"></a>
</dt>
<dd><p>W&auml;hlt wie die Funktion <code>part</code> einen Teilausdruck aus, gibt aber den 
vollst&auml;ndigen Ausdruck zur&uuml;ck, wobei der ausgew&auml;hlte Teilausdruck 
eingerahmt ist.  Der Rahmen ist Teil des zur&uuml;ckgegebenen Ausdrucks.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#lpart">lpart</a></code> sowie <code><a href="#box">box</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre></dd></dl>

<p><a name="exptisolate"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>exptisolate</b>
<a name="IDX200"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>exptisolate</code> den Wert <code>true</code>, dann sucht die Funktion
<code>isolate</code> auch in den Exponenten von Zahlen oder Symbolen nach
Teilausdr&uuml;cken zu einer Variablen.
</p>
<p>Siehe die Funktion <code><a href="#isolate">isolate</a></code> f&uuml;r Beispiele.
</p></dd></dl>

<p><a name="exptsubst"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>exptsubst</b>
<a name="IDX201"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>exptsubst</code> kontrolliert die Substitution von
Ausdr&uuml;cken mit der Exponentialfunktion durch die Funktionen <code><a href="#subst">subst</a></code> und
<code><a href="#psubst">psubst</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) subst(y,%e^x,%e^(a*x)),exptsubst:false;
                                a x
(%o1)                         %e
(%i2) subst(y,%e^x,%e^(a*x)),exptsubst:true;
                                a
(%o2)                          y
</pre></dd></dl>

<p><a name="freeof"></a>
</p><dl>
<dt><u>Funktion:</u> <b>freeof</b><i> (<var>x</var>, <var>expr</var>)</i>
<a name="IDX202"></a>
</dt>
<dt><u>Funktion:</u> <b>freeof</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>, <var>expr</var>)</i>
<a name="IDX203"></a>
</dt>
<dd><p><code>freeof(<var>x</var>, <var>expr</var>)</code> gibt das Ergebnis <code>true</code> zur&uuml;ck, wenn
das Argument <var>x</var> nicht im Ausdruck <var>expr</var> enthalten ist.  Ansonsten ist
der R&uuml;ckgabewert <code>false</code>.
</p>
<p><code>freeof(<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code> gibt das Ergebnis 
<code>true</code> zur&uuml;ck, wenn keines der Argumente <var>x_1</var>, <var>x_2</var>, &hellip;
im Ausdruck <var>expr</var> enthalten ist.
</p>
<p>Die Argumente <var>x_1</var>, &hellip;, <var>x_n</var> k&ouml;nnen die Namen von Funktionen 
und Variablen sein, indizierte Namen, die Namen von Operatoren oder allgemeine
Ausdr&uuml;cke.  Die Funktion <code>freeof</code> wertet die Argumente aus.
</p>
<p>Bei der Pr&uuml;fung, ob ein Teilausdruck <var>x</var> im Ausdruck <var>expr</var> enthalten
ist, untersucht die Funktion <code>freeof</code> den Ausdruck <var>expr</var> in der 
vorliegenden Form (nach Auswertung und Vereinfachung) und versucht nicht 
herauszufinden, ob der Teilausdruck in einem &auml;quivalenten Ausdruck enth&auml;lten
w&auml;re.
</p>
<p><code>freeof</code> ignoriert Dummy-Variablen.  Dummy-Variablen sind Variablen, die 
au&szlig;erhalb eines Ausdrucks nicht in Erscheinung treten.  Folgende 
Dummy-Variablen werden von <code>freeof</code> ignoriert: der Index einer Summe oder 
eines Produktes, die unabh&auml;ngige Variable in einem Grenzwert, die 
Integrationsvariable eines bestimmten Integrals oder einer 
Laplacetransformation, formale Variablen in <code><a href="maxima_16.html#at">at</a></code>- oder
<code><a href="maxima_25.html#lambda">lambda</a></code>-Ausdr&uuml;cke, lokale Variablen eines Blocks oder einer
<code><a href="maxima_27.html#do">do</a></code>-Schleife.
</p>
<p>Das unbestimmte Integral ist <i>nicht</i> frei von der Integrationsvariablen.
</p>
<p>Beispiele:
</p>
<p>Argumente sind Namen von Funktionen, Variablen, indizierten Variablen, 
Operatoren und Ausdr&uuml;cke.  <code>freeof(a, b, expr)</code> ist &auml;quivalent zu
<code>freeof(a, expr) and freeof(b, expr)</code>.
</p>
<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
(%i2) freeof(z, expr);
(%o2)                         false
(%i3) freeof(cos, expr);
(%o3)                         false
(%i4) freeof(a[1], expr);
(%o4)                         false
(%i5) freeof(cos (a[1]), expr);
(%o5)                         false
(%i6) freeof(b^(c+d), expr);
(%o6)                         false
(%i7) freeof(&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof(w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre>
<p>Die Funktion <code>freeof</code> wertet die Argumente aus.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof(c, expr);
(%o3)                         false
</pre>
<p><code>freeof</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Vereinfachungen 
k&ouml;nnen einen &auml;quivalenten Ausdruck liefern, der jedoch den Teilausdruck 
nicht mehr enth&auml;lt.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand(expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof(a+b, %);
(%o3)                         true
(%i4) freeof(a+b, expr);
(%o4)                         false
</pre>
<p>Die Exponentialfunktion <code>exp(x)</code> wird von Maxima sofort zu <code>%e^x</code> 
vereinfacht.  Der Name <code>exp</code> der Exponentialfunktion ist daher nicht in
einem Ausdruck enthalten.
</p>
<pre class="example">(%i5) exp(x);
                                 x
(%o5)                          %e
(%i6) freeof(exp, exp (x));
(%o6)                         true
</pre>
<p>Eine Summe ist frei von dem Index und ein bestimmtes Integral ist frei von der
Integrationsvariablen.  Ein unbestimmtes Integral ist nicht frei von der 
Integrationsvariablen.
</p>
<pre class="example">(%i1) freeof(i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof(x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof(x, 'integrate (x^2, x));
(%o3)                         false
</pre></dd></dl>

<p><a name="inflag"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>inflag</b>
<a name="IDX204"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>inflag</code> den Wert <code>true</code>, wird von Funktionen,
die Teile eines Ausdrucks <code>expr</code> extrahieren, die interne Form des
Ausdrucks <code>expr</code> betrachtet.
</p>
<p>Die Anordnung der Argumente der internen Darstellung unterscheidet sich zum
Beispiel f&uuml;r die Addition von der externen Darstellung f&uuml;r die Anzeige.
Daher hat <code>first(x+y)</code> das Ergebnis <code>x</code>, wenn <code>inflag</code> den Wert
<code>true</code> hat, und <code>y</code>, wenn <code>inflag</code> den Wert <code>false</code> hat.
Der Ausdruck <code>first(y+x)</code> gibt in beiden F&auml;llen dasselbe Ergebnis.
</p>
<p>Hat <code>inflag</code> den Wert <code>true</code>, entsprechen die Funktionen <code>part</code> 
und <code>substpart</code> den Funktionen <code>inpart</code> und <code>substinpart</code>.
</p>
<p>Folgende Funktionen werden von der Optionsvariablen <code>inflag</code> beeinflusst:
<code><a href="#part">part</a></code>, <code><a href="#substpart">substpart</a></code>, <code><a href="maxima_5.html#first">first</a></code>, <code><a href="maxima_5.html#rest">rest</a></code>,
<code><a href="maxima_5.html#last">last</a></code>, <code><a href="maxima_5.html#length">length</a></code>, die Konstruktion <code><a href="maxima_27.html#for">for</a></code> &hellip;
<code>in</code>, <code><a href="maxima_25.html#map">map</a></code>, <code><a href="maxima_25.html#fullmap">fullmap</a></code>, <code><a href="maxima_25.html#maplist">maplist</a></code>,
<code><a href="#reveal">reveal</a></code>, <code><a href="#pickapart">pickapart</a></code>, <code><a href="#args">args</a></code> und <code><a href="#op">op</a></code>.
</p></dd></dl>

<p><a name="inpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>inpart</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX205"></a>
</dt>
<dd><p>Die Funktion <code>inpart</code> ist &auml;hnlich wie <code>part</code>, arbeitet aber mit der 
internen Darstellung eines Ausdruckes und nicht mit der externen Darstellung 
f&uuml;r die Anzeige.  Da keine Formatierung vorgenommen wird, ist die Funktion 
<code>inpart</code> schneller als <code>part</code>.
</p>
<p>Immer dann, wenn sich die interne und die externe Darstellung eines Ausdrucks
voneinander unterscheiden, haben die Funktionen <code>inpart</code> und <code>part</code>
verschiedene Ergebnisse.  Dies trifft zu f&uuml;r die Anordnung der Argumente einer
Addition, der Subtraktion und Division sowie zum Beispiel f&uuml;r die 
Wurzelfunktion.
</p>
<p>Ist das letzte Argument einer <code>part</code>-Funktion eine Liste mit Indizes, 
werden mehrere Teilausdr&uuml;cke heraus gepickt.  So hat
<code>inpart(x + y + z, [1, 3])</code> das Ergebnis <code>z+x</code>.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre></dd></dl>

<p><a name="isolate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>isolate</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX206"></a>
</dt>
<dd><p>Teilausdr&uuml;cke im Ausdruck <var>expr</var>, die die Variable <var>x</var> nicht 
enthalten, werden durch Zwischenmarken <code>%t1</code>, <code>%t2</code>, &hellip; ersetzt.
Dies kann genutzt werden, um die weitere Auswertung und Vereinfachung dieser
Teilausdr&uuml;cke zu verhindern.  Die Ersetzung der Teilausdr&uuml;cke kann durch 
eine Auswertung des Ausdrucks r&uuml;ckg&auml;ngig gemacht werden.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken kann mit den Optionsvariablen 
<code><a href="#exptisolate">exptisolate</a></code> und <code><a href="#isolate_005fwrt_005ftimes">isolate_wrt_times</a></code> kontrolliert werden.  Hat die
Optionsvariable <code>exptisolate</code> den Wert <code>true</code>, werden Ersetzungen auch
f&uuml;r die Exponentiation ausgef&uuml;hrt.  Die Basis muss dabei eine Zahl oder ein 
Symbol wie <code>%e</code> sein.  Hat die Optionsvariable <code>isolate_wrt_times</code> den 
Wert <code>true</code>, werden Ersetzungen in Produkten ausgef&uuml;hrt.  Siehe
<code>isolate_wrt_times</code> f&uuml;r Beispiele.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken f&uuml;r mehrere Variable kann mit der Funktion
<code>disolate</code> ausgef&uuml;hrt werden.  Siehe <code><a href="#disolate">disolate</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) (b+a)^4*(x*((d+c)^2+2*x)+1);
                       4                  2
(%o1)           (b + a)  (x (2 x + (d + c) ) + 1)
(%i2) isolate(%,x);

                                   2
(%t2)                       (d + c)


                                   4
(%t3)                       (b + a)

(%o3)                %t3 (x (2 x + %t2) + 1)
(%i4) ratexpand(%);
                          2
(%o4)              2 %t3 x  + %t2 %t3 x + %t3
(%i5) ev(%);
                  4  2          4        2            4
(%o5)    2 (b + a)  x  + (b + a)  (d + c)  x + (b + a)
(%i6) (b+a)*(b+a+x)^2*%e^(b+a*x+x^2);
                                       2
                                  2   x  + a x + b
(%o6)          (b + a) (x + b + a)  %e
(%i7) ev(isolate(%,x),exptisolate:true);

(%t7)                         b + a


                                 b
(%t8)                          %e

                                        2
                                   2   x  + a x
(%o8)             %t7 %t8 (x + %t7)  %e
</pre></dd></dl>

<p><a name="isolate_005fwrt_005ftimes"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>isolate_wrt_times</b>
<a name="IDX207"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>isolate_wrt_times</code> den Wert <code>true</code>, f&uuml;hren 
die Funktionen <code>isolate</code> und <code>disolate</code> auch Ersetzungen in Produkten 
aus.
</p>
<p>Siehe auch die Funktionen <code><a href="#isolate">isolate</a></code> und <code><a href="#disolate">disolate</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre></dd></dl>

<p><a name="listconstvars"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>listconstvars</b>
<a name="IDX208"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>listconstvars</code> den Wert <code>true</code>, werden
Konstante wie <code><a href="maxima_5.html#g_t_0025e">%e</a></code>, <code><a href="maxima_5.html#g_t_0025pi">%pi</a></code> und Variablen, die als konstant
deklariert sind, von der Funktion <code><a href="#listofvars">listofvars</a></code> in die Ergebnisliste
aufgenommen.  Der Standardwert von <code>listconstvars</code> ist <code>false</code> und
Konstante werden ignoriert.
</p></dd></dl>

<p><a name="listdummyvars"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>listdummyvars</b>
<a name="IDX209"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>listdummyvars</code> den Wert <code>false</code>, werden die Dummy-Variablen eines
Ausdrucks von der Funktion <code><a href="#listofvars">listofvars</a></code> ignoriert.  Dummy-Variablen sind
zum Beispiel der Index einer Summe, die Grenzwertvariable oder die
Integrationsvariable eines bestimmten Integrals.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre></dd></dl>

<p><a name="listofvars"></a>
</p><dl>
<dt><u>Funktion:</u> <b>listofvars</b><i> (<var>expr</var>)</i>
<a name="IDX210"></a>
</dt>
<dd><p>Die Funktion <code>listofvars</code> gibt eine Liste der Variablen zur&uuml;ck, die im 
Ausdruck <var>expr</var> enthalten sind.
</p>
<p>Hat die Optionsvariable <code><a href="#listconstvars">listconstvars</a></code> den Wert <code>true</code>, werden auch
Konstante wie <code><a href="maxima_5.html#g_t_0025e">%e</a></code>, <code><a href="maxima_5.html#g_t_0025pi">%pi</a></code> und <code><a href="maxima_5.html#g_t_0025i">%i</a></code> sowie als konstant
deklarierte Variable in die Liste aufgenommen.  Der Standardwert von
<code>listconstvars</code> ist <code>false</code>.
</p>
<p>Siehe entsprechend die Optionsvariable <code><a href="#listdummyvars">listdummyvars</a></code> f&uuml;r 
Dummy-Variablen.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre></dd></dl>

<p><a name="lfreeof"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lfreeof</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX211"></a>
</dt>
<dd><p>F&uuml;r jedes Element <var>m</var> der Liste <var>list</var> wird die Funktion
<code>freeof</code> aufgerufen.  <code>lfreeof</code> hat den R&uuml;ckgabewert <code>true</code>,
wenn keines der Elemente der Liste <var>list</var> im Ausdruck <code>expr</code> enthalten
ist.  Ansonsten ist der R&uuml;ckgabewert <code>false</code>.
</p>
<p>Siehe auch die Funktion <code><a href="#freeof">freeof</a></code>.
</p></dd></dl>

<p><a name="lpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lpart</b><i> (<var>label</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX212"></a>
</dt>
<dd><p>Die Funktion <code>lpart</code> ist &auml;hnlich zu <code>dpart</code>, verwendet aber einen
Rahmen, der mit einer Marke gekennzeichnet ist.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#dpart">dpart</a></code>.
</p></dd></dl>

<p><a name="mainvar"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>mainvar</b>
<a name="IDX213"></a>
</dt>
<dd><p>Die Deklaration einer Variablen als eine Hauptvariable mit der Funktion
<code><a href="maxima_11.html#declare">declare</a></code> &auml;ndert deren Anordnung in einem Ausdruck der kanonisch geordnet
ist.  Hauptvariable sind bez&uuml;glich der Funktionen <code><a href="#ordergreatp">ordergreatp</a></code> und
<code><a href="#orderlessp">orderlessp</a></code> stets gr&ouml;&szlig;er als alle anderen Symbole, Konstanten und
Zahlen.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) sort([9, 1, %pi, g, t, a]);
(%o1)                 [1, 9, %pi, a, g, t]

(%i2) declare(a, mainvar)$
(%i3) sort([9, 1, %pi, g, t, a]);
(%o3)                 [1, 9, %pi, g, t, a]
</pre></dd></dl>

<p><a name="noun"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>noun</b>
<a name="IDX214"></a>
</dt>
<dd><p><code>noun</code> ist eine der Optionen des Kommandos <code><a href="maxima_11.html#declare">declare</a></code>.  Wird eine
Funktion als <code>noun</code> deklariert, wird diese als Substantivform behandelt
und nicht ausgewertet.
</p>
<p>Ein Symbol <code>f</code>, dass als <code>noun</code> deklariert wird, wird in die
Informationsliste <code><a href="#aliases">aliases</a></code> eingetragen und die R&uuml;ckgabe der Funktion
<code><a href="maxima_11.html#properties">properties</a></code> enth&auml;lt den Eintrag <code>noun</code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) factor (12345678);
                             2
(%o1)                     2 3  47 14593
(%i2) declare (factor, noun);
(%o2)                         done
(%i3) factor (12345678);
(%o3)                   factor(12345678)
(%i4) ''%, nouns;
                             2
(%o4)                     2 3  47 14593
</pre></dd></dl>

<p><a name="noundisp"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>noundisp</b>
<a name="IDX215"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>noundisp</code> den Wert <code>true</code>, werden Substantivformen mit einem
vorangestelltem Hochkomma angezeigt.  Diese Optionsvariable hat immer den Wert
<code>true</code>, wenn die Definition von Funktionen angezeigt wird.
</p></dd></dl>

<p><a name="nounify"></a>
</p><dl>
<dt><u>Funktion:</u> <b>nounify</b><i> (<var>f</var>)</i>
<a name="IDX216"></a>
</dt>
<dd><p>Die Funktion <code>nounify</code> gibt den Namen einer Funktion <var>f</var> in einer 
Substantivform zur&uuml;ck.  Der Name <var>f</var> ist ein Symbol oder eine
Zeichenkette.
</p>
<p>Einige Funktionen geben eine Substantivform zur&uuml;ck, wenn die Funktion nicht 
ausgewertet werden kann.  Wird einem Funktionsaufruf wie zum Beispiel 
<code>'f(x)</code> oder <code>'(f(x))</code> ein Hochkomma vorangestellt, wird ebenfalls 
eine Substantivform zur&uuml;ckgegeben.
</p>
<p>Siehe auch die Funktion <code><a href="#verbify">verbify</a></code>.
</p></dd></dl>

<p><a name="nterms"></a>
</p><dl>
<dt><u>Funktion:</u> <b>nterms</b><i> (<var>expr</var>)</i>
<a name="IDX217"></a>
</dt>
<dd><p>Die Funktion <code>nterms</code> gibt die Anzahl der Terme des Ausdrucks <var>expr</var> 
zur&uuml;ck, wobei der Ausdruck als vollst&auml;ndig expandiert angenommen wird, ohne 
dass Terme gek&uuml;rzt oder zusammengefasst werden.
</p>
<p>Ausdr&uuml;cke wie <code>sin(<var>expr</var>)</code>, <code>sqrt(<var>expr</var>)</code> oder 
<code>exp(<var>expr</var>)</code> werden dabei als ein Term gez&auml;hlt.
</p></dd></dl>

<p><a name="op"></a>
</p><dl>
<dt><u>Funktion:</u> <b>op</b><i> (<var>expr</var>)</i>
<a name="IDX218"></a>
</dt>
<dd><p>Die Funktion <code>op</code> gibt den Hauptoperator des Ausdrucks <var>expr</var> zur&uuml;ck.
<code>op(<var>expr</var>)</code> ist &auml;quivalent zu <code>part(<var>expr</var>, 0)</code>.
</p>
<p>Ist der Hauptoperator des Ausdrucks <var>expr</var> ein Operator wie &quot;+&quot;, &quot;*&quot; oder 
&quot;/&quot; wird der Name des Operators als Zeichenkette zur&uuml;ckgegeben.  Andernfalls 
wird ein Symbol zur&uuml;ckgegeben.
</p>
<p><code>op</code> beachtet den Wert der Optionsvariablen <code><a href="#inflag">inflag</a></code>.  <code>op</code>
wertet die Argumente aus.  Siehe auch <code><a href="#args">args</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre></dd></dl>

<p><a name="operatorp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>operatorp</b><i> (<var>expr</var>, <var>op</var>)</i>
<a name="IDX219"></a>
</dt>
<dt><u>Funktion:</u> <b>operatorp</b><i> (<var>expr</var>, [<var>op_1</var>, &hellip;, <var>op_n</var>])</i>
<a name="IDX220"></a>
</dt>
<dd><p>Das Kommando <code>operatorp(<var>expr</var>, <var>op</var>)</code> gibt <code>true</code> zur&uuml;ck,
wenn <var>op</var> der Hauptoperator des Ausdrucks <var>expr</var> ist.
</p>
<p><code>operatorp(<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> gibt <code>true</code> 
zur&uuml;ck, wenn einer der Operatoren <var>op_1</var>, &hellip;, <var>op_n</var> der 
Hauptoperator des Ausdrucks <var>expr</var> ist.
</p></dd></dl>

<p><a name="option_005fopsubst"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>opsubst</b>
<a name="IDX221"></a>
</dt>
<dd>
<p>Hat die Optionsvariable <code>opsubst</code> den Wert <code>false</code>, f&uuml;hrt die 
Funktion <code><a href="#subst">subst</a></code> keine Substitution in einen Operator eines Ausdrucks aus.
Zum Beispiel hat <code>(opsubst: false, subst(x^2, r, r+r[0]))</code> das Ergebnis
<code>x^2+r[0]</code>.
</p></dd></dl>

<p><a name="optimize"></a>
</p><dl>
<dt><u>Funktion:</u> <b>optimize</b><i> (<var>expr</var>)</i>
<a name="IDX222"></a>
</dt>
<dd><p>Die Funktion <code>optimize</code> gibt einen Ausdruck zur&uuml;ck, der dasselbe Ergebnis 
und dieselben Seiteneffekte wie <var>expr</var> hat, der jedoch effizienter 
ausgewertet werden kann.  Im neuen Ausdruck wird die mehrfache Berechnung 
gleicher Teilausdr&uuml;cke vermieden und gleiche Teilausdr&uuml;cke werden 
zusammengefasst.
</p>
<p>Siehe auch die Funktion <code><a href="#collapse">collapse</a></code>.
</p>

<p><code>example(optimize)</code> zeigt ein Beispiel.
</p></dd></dl>

<p><a name="optimprefix"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>optimprefix</b>
<a name="IDX223"></a>
</dt>
<dd><p>Standardwert: <code>%</code>
</p>
<p>Die Optionsvariable <code>optimprefix</code> enth&auml;lt den Pr&auml;fix, der von der 
Funktion <code><a href="#optimize">optimize</a></code> benutzt wird, um einen Teilausdruck zu benennen.
</p></dd></dl>

<p><a name="ordergreat"></a>
<a name="orderless"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ordergreat</b><i> (<var>v_1</var>, &hellip;, <var>v_n</var>)</i>
<a name="IDX224"></a>
</dt>
<dt><u>Funktion:</u> <b>orderless</b><i> (<var>v_1</var>, &hellip;, <var>v_n</var>)</i>
<a name="IDX225"></a>
</dt>
<dd><p>Die Funktion <code>ordergreat</code> &auml;ndert die kanonische Anordnung der Symbole so,
dass <var>v_1</var> &gt; <var>v_2</var> &gt; &hellip; &gt; <var>v_n</var>.  Weiterhin ist <var>v_n</var> 
kleiner als jedes andere Symbol, das nicht in der Liste enthalten ist.
</p>
<p><code>orderless</code> &auml;ndert die kanonische Anordnung der Symbole so, dass
<var>v_1</var> &lt; <var>v_2</var> &lt; &hellip; &lt; <var>v_n</var>.  Weiterhin ist <var>v_n</var>
gr&ouml;&szlig;er als jedes andere Symbol, das nicht in der Liste enthalten ist.
</p>
<p>Die durch <code>ordergreat</code> und <code>orderless</code> definierte Ordnung wird durch
<code><a href="#unorder">unorder</a></code> wieder aufgehoben.  <code>ordergreat</code> und <code>orderless</code> 
k&ouml;nnen jeweils nur einmal aufgerufen werden, solange nicht mit <code>unorder</code> 
zuvor die definierte Ordnung aufgehoben wird.
</p>
<p>Siehe auch <code><a href="#ordergreatp">ordergreatp</a></code>, <code><a href="#orderlessp">orderlessp</a></code> und <code><a href="#mainvar">mainvar</a></code>.
</p></dd></dl>

<p><a name="ordergreatp"></a>
<a name="orderlessp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ordergreatp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX226"></a>
</dt>
<dt><u>Funktion:</u> <b>orderlessp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX227"></a>
</dt>
<dd><p>Die Funktion <code>ordergreatp</code> gibt <code>true</code> zur&uuml;ck, wenn in der 
kanonischen Ordnung von Maxima <var>expr_1</var> gr&ouml;&szlig;er als <var>expr_2</var> ist.
Ansonsten ist das Ergebnis <code>false</code>.
</p>
<p>Die Funktion <code>orderlessp</code> gibt <code>true</code> zur&uuml;ck, wenn in der 
kanonischen Ordnung von Maxima <var>expr_1</var> kleiner als <var>expr_2</var> ist.
Ansonsten ist das Ergebnis <code>false</code>.
</p>
<p>Alle Maxima-Atome und Ausdr&uuml;cke sind vergleichbar unter <code>ordergreatp</code> und
<code>orderlessp</code>.  Die kanonische Ordnung von Atomen ist folgenderma&szlig;en:
</p>
<p align="left">   Numerische Konstanten &lt;
   deklarierte Konstanten &lt;
   deklarierte Skalare &lt;
   erstes Argument von <code>orderless</code> &lt;
   weitere Argumente von <code>orderless</code> &lt;
   letztes Argument von <code>orderless</code> &lt;
   Variablen beginnend mit a, ... &lt;
   Variablen beginnend mit Z &lt;
   letzte Argument von <code>ordergreat</code> &lt;
   weitere Argumente von <code>ordergreat</code> &lt;
   erste Argument von <code>ordergreat</code> &lt;
   deklarierte Hauptvariablen.
</p>
<p>Die Ordnung f&uuml;r Ausdr&uuml;cke, die keine Atome sind, wird von der f&uuml;r Atome 
abgeleitet.  F&uuml;r die Operatoren <code>&quot;+&quot;</code>, <code>&quot;*&quot;</code> und <code>&quot;^&quot;</code> kann die
Ordnung nicht einfach beschrieben werden.  Andere Operatoren, Funktionen und 
Ausdr&uuml;cke werden angeordnet nach den Argumenten, dann nach den Namen.
Bei Ausdr&uuml;cken mit Indizes wird der Name des Symbols als Operator und der 
Index als Argument betrachtet.
</p>
<p>Die kanonische Ordnung der Ausdr&uuml;cke wird modifiziert durch die Funktionen
<code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code> sowie der Deklarationen
<code><a href="#mainvar">mainvar</a></code>, <code><a href="maxima_11.html#constant">constant</a></code> und <code><a href="maxima_11.html#scalar">scalar</a></code>.
</p>
<p>Siehe auch <code><a href="maxima_5.html#sort">sort</a></code>.
</p>
<p>Beispiele:
</p>
<p>Ordne Symbole und Konstanten.  <code><a href="maxima_5.html#g_t_0025pi">%pi</a></code> wird nicht nach dem numerischen Wert
sortiert, sondern wie eine Konstante.
</p>
<pre class="example">(%i1) stringdisp : true;
(%o1)                         true
(%i2) sort ([%pi, 3b0, 3.0, x, X, &quot;foo&quot;, 3, a, &quot;bar&quot;, 4.0, 4b0]);
(%o2) [3, 3.0, 4.0, 3.0b0, 4.0b0, %pi, &quot;bar&quot;, &quot;foo&quot;, a, x, X]
</pre>
<p>Anwendung der Funktionen <code>ordergreat</code> und <code>orderless</code>.
</p>
<pre class="example">(%i1) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o1)           [A, E, G, H, J, K, M, P, S, T, W]
(%i2) ordergreat (S, J);
(%o2)                         done
(%i3) orderless (M, H);
(%o3)                         done
(%i4) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o4)           [M, H, A, E, G, K, P, T, W, J, S]
</pre>
<p>Anwendung der Deklarationen <code>mainvar</code>, <code>constant</code> und <code>scalar</code>.
</p>
<pre class="example">(%i1) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o1)   [aa, bar, baz, bb, cc, dd, foo, quux, A1, B1, C1]
(%i2) declare (aa, mainvar);
(%o2)                         done
(%i3) declare ([baz, quux], constant);
(%o3)                         done
(%i4) declare ([A1, B1], scalar);
(%o4)                         done
(%i5) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o5)   [baz, quux, A1, B1, bar, bb, cc, dd, foo, C1, aa]
</pre>
<p>Ordne nicht atomare Ausdr&uuml;cke.
</p>
<pre class="example">(%i1) sort ([f(1), f(2), f(2, 1), g(1), g(1, 2), g(n), f(n, 1)]);
(%o1) [f(1), g(1), g(1, 2), f(2), f(2, 1), g(n), f(n, 1)]
(%i2) sort ([foo(1), X[1], X[k], foo(k), 1, k]);
(%o2)            [1, foo(1), X , k, foo(k), X ]
                              1              k
</pre></dd></dl>

<p><a name="ordermagnitudep"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ordermagnitudep</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX228"></a>
</dt>
<dd><p>Ist eine Aussagefunktion, die das Ergebnis <code>true</code> hat, wenn die Argumente
<var>expr_1</var> und <var>expr_2</var> Zahlen, Konstante oder konstante Ausdr&uuml;cke
repr&auml;sentieren und <var>expr_1</var> kleiner als <var>expr_2</var> ist.  Sind die
Argumente nicht der Gr&ouml;&szlig;e nach vergleichbar, wird die Ordnung durch die
Aussagefunktion <code><a href="#orderlessp">orderlessp</a></code> bestimmt.
</p>
<p>Wird die Aussagefunktion <code>ordermagnitudep</code> als Argument der Funktion 
<code><a href="maxima_5.html#sort">sort</a></code> verwendet, werden die Elemente einer Liste nach der Gr&ouml;&szlig;e
sortiert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) ordermagnitudep(1, 2);
(%o1)                         true
(%i2) ordermagnitudep(%e, %pi);
(%o2)                         true
(%i3) sort([%e, %pi, sin(1), 0, 1, 2, 3, 4]);
(%o3)           [0, 1, 2, 3, 4, %e, %pi, sin(1)]
(%i4) sort([%e, %pi, sin(1), 0, 1, 2, 3, 4], ordermagnitudep);
(%o4)           [0, sin(1), 1, 2, %e, 3, %pi, 4]
</pre></dd></dl>

<p><a name="part"></a>
</p><dl>
<dt><u>Funktion:</u> <b>part</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX229"></a>
</dt>
<dd><p>Die Funktion <code>part</code> gibt einen Teilausdruck des Ausdrucks <var>expr</var>
zur&uuml;ck.  Der Ausdruck <var>expr</var> wird zuvor in das Format f&uuml;r die Anzeige
umgewandelt.
</p>
<p>Der Teilausdruck wird durch die Indizes <var>n_1</var>, &hellip;, <var>n_k</var> 
ausgew&auml;hlt.  Zuerst wird der Teilausdruck <var>n_1</var> ermittelt, von diesem der
Teilausdruck <var>n_2</var>, u.s.w.  Der zum Index <var>n_k</var> zuletzt gewonnene 
Teilausdruck ist dann das Ergebnis.
</p>
<p><code>part</code> kann auch verwendet werden, um ein Element einer Liste oder die
Zeile einer Matrix zu erhalten.
</p>
<p>Das letzte Argument einer <code>part</code>-Funktion kann eine Liste mit Indizes sein.
In diesem Fall werden alle angegebenen Teilausdr&uuml;cke als Ergebnis
zur&uuml;ckgegeben.  Zum Beispiel hat das Kommando <code>part(x + y + z, [1, 3])</code>
das Ergebnis <code>z+x</code>.
</p>
<p>Die Systemvariable <code><a href="#piece">piece</a></code> enth&auml;lt den letzten Ausdruck, der bei der
Verwendung einer <code>part</code>-Funktion ausgew&auml;hlt wurde.
</p>
<p>Hat die Optionsvariable <code><a href="#partswitch">partswitch</a></code> den Wert <code>true</code>, wird <code>end</code>
zur&uuml;ckgegeben, wenn versucht wurde, einen Teilausdruck zu bilden, der nicht
existiert, andernfalls wird eine Fehlermeldung ausgegeben.
</p>
<p>Siehe auch <code><a href="#inpart">inpart</a></code>, <code><a href="#substpart">substpart</a></code>, <code><a href="#substinpart">substinpart</a></code>,
<code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code>.
</p> 
<p>Beispiele:
</p>
<pre class="example">(%i1) part(z+2*y+a,2);
(%o1)                                 2 y
(%i2) part(z+2*y+a,[1,3]);
(%o2)                                z + a
(%i3) part(z+2*y+a,2,1);
(%o3)                                  2
</pre>
<p><code>example(part)</code> zeigt weitere Beispiele.
</p></dd></dl>

<p><a name="partition"></a>
</p><dl>
<dt><u>Funktion:</u> <b>partition</b><i> (<var>expr</var>, <var>var</var>)</i>
<a name="IDX230"></a>
</dt>
<dd><p>Die Funktion <code>partition</code> gibt eine Liste mit zwei Ausdr&uuml;cken zur&uuml;ck.
Ist das Argument <var>expr</var> ein Produkt enth&auml;lt das erste Element die
Faktoren, die die Variable <code>var</code> enthalten, und das zweite Element
enth&auml;lt die &uuml;brigen Faktoren.  Entsprechend enth&auml;lt das erste Element die
Terme einer Summe oder die Elemente einer Liste, die die Variable <var>var</var>
enthalten, und das zweite Elemente die verbleibende Terme der Summe oder
Elemente der Liste.
</p>
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre></dd></dl>

<p><a name="partswitch"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>partswitch</b>
<a name="IDX231"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>partswitch</code> den Wert <code>true</code>, wird <code>end</code> 
zur&uuml;ckgegeben, wenn versucht wird, einen Teilausdruck zu bilden, der nicht
existiert, andernfalls wird eine Fehlermeldung ausgegeben.
</p></dd></dl>

<p><a name="pickapart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>pickapart</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX232"></a>
</dt>
<dd><p>Den Teilausdr&uuml;cken in einer Tiefe <var>n</var> eines verschachtelten Ausdrucks 
werden Zwischenmarken zugewiesen.  <var>n</var> ist eine ganze positive Zahl.  Die 
R&uuml;ckgabe von <code>pickapart</code> ist ein &auml;quivalenter Ausdruck, der die 
Zwischenmarken enth&auml;lt.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#dpart">dpart</a></code>, <code><a href="#lpart">lpart</a></code>,
<code><a href="#inpart">inpart</a></code> und <code><a href="#reveal">reveal</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%i2) pickapart (expr, 0);

                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2

(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)

                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre></dd></dl>

<p><a name="piece"></a>
</p><dl>
<dt><u>Systemvariable:</u> <b>piece</b>
<a name="IDX233"></a>
</dt>
<dd><p>Die Systemvariable <code>piece</code> enth&auml;lt den letzten Ausdruck, der bei der 
Verwendung einer <code>part</code>-Funktion ausgew&auml;hlt wurde.
</p>
<p>Siehe auch <code><a href="#part">part</a></code> und <code><a href="#inpart">inpart</a></code>.
</p></dd></dl>

<p><a name="psubst"></a>
</p><dl>
<dt><u>Funktion:</u> <b>psubst</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX234"></a>
</dt>
<dt><u>Funktion:</u> <b>psubst</b><i> (<var>a</var>, <var>b</var>, <var>expr</var>)</i>
<a name="IDX235"></a>
</dt>
<dd><p><code>psubst(<var>a</var>, <var>b</var>, <var>expr</var>)</code> ist identisch mit <code>subst</code>.
Siehe <code><a href="#subst">subst</a></code>.
</p>
<p>Im Unterschied zu <code>subst</code> f&uuml;hrt die Funktion <code>psubst</code> Substitutionen
parallel aus, wenn das erste Argument <var>list</var> eine Liste mit Gleichungen ist.
</p>
<p>Siehe auch die Funktion <code><a href="#sublis">sublis</a></code>, um Substitutionen parallel
auszuf&uuml;hren.
</p>
<p>Beispiel:
</p>
<p>Das erste Beispiel zeigt die parallele Substitution mit <code>psubst</code>.  Das 
zweite Beispiel zeigt das Ergebnis f&uuml;r die Funktion <code>subst</code>.  In diesem
Fall werden die Substitutionen nacheinander ausgef&uuml;hrt.
</p>
<pre class="example">(%i4) psubst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o4)                           sin(b) + sin(a)
(%i5) subst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o5)                              2 sin(a)
</pre></dd></dl>

<p><a name="rembox"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rembox</b><i> (<var>expr</var>, unlabelled)</i>
<a name="IDX236"></a>
</dt>
<dt><u>Funktion:</u> <b>rembox</b><i> (<var>expr</var>, <var>label</var>)</i>
<a name="IDX237"></a>
</dt>
<dt><u>Funktion:</u> <b>rembox</b><i> (<var>expr</var>)</i>
<a name="IDX238"></a>
</dt>
<dd><p>Die Funktion <code>rembox</code> entfernt Rahmen aus dem Ausdruck <var>expr</var>.
<code>rembox(<var>expr</var>, unlabelled)</code> entfernt alle Rahmen, die keine Marke 
haben.  <code>rembox(<var>expr</var>, <var>label</var>)</code> entfernt nur Rahmen, die mit der 
Marke <var>label</var> gekennzeichnet sind.  <code>rembox(<var>expr</var>)</code> entfernt alle 
Rahmen.
</p>
<p>Rahmen werden mit den Funktionen <code><a href="#box">box</a></code>, <code><a href="#dpart">dpart</a></code> und
<code><a href="#lpart">lpart</a></code> einem Ausdruck hinzugef&uuml;gt.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h

(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;

(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

(%i4) rembox (expr2, unlabelled);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

(%i5) rembox (expr2, FOO);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

(%i6) rembox (expr2, BAR);
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;

(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre></dd></dl>

<p><a name="reveal"></a>
</p><dl>
<dt><u>Funktion:</u> <b>reveal</b><i> (<var>expr</var>, <var>depth</var>)</i>
<a name="IDX239"></a>
</dt>
<dd><p>Ersetzt Teile des Ausdrucks <var>expr</var> in der ganzzahligen Tiefe <var>depth</var> 
durch eine beschreibende Zusammenfassung:
</p>
<ul>
<li>
Summen und Differenzen werden durch <code>Sum(<var>n</var>)</code> ersetzt, wobei <var>n</var>
die Anzahl der Terme der Summe oder Differenz ist.

</li><li>
Produkte werden durch <code>Product(<var>n</var>)</code> ersetzt, wobei <var>n</var> die Anzahl
der Faktoren des Produktes ist.

</li><li>
Exponentiationen werden durch <code>Expt</code> ersetzt.

</li><li>
Quotienten werden durch <code>Quotient</code> ersetzt.

</li><li>
Die Negation wird durch <code>Negterm</code> ersetzt.

</li><li>
Listen werden durch <code>List(<var>n</var>)</code> ersetzt, wobei <var>n</var> die Anzahl der 
Elemente der Liste ist.
</li></ul>

<p>Ist <var>depth</var> gr&ouml;&szlig;er oder gleich der maximalen Tiefe des Ausdrucks 
<var>expr</var>, gibt <code>reveal</code> den Ausdruck <var>expr</var> unver&auml;ndert zur&uuml;ck.
</p>
<p><code>reveal</code> wertet die Argumente aus.  <code>reveal</code> gibt die 
Zusammenfassung zur&uuml;ck.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) e: expand ((a - b)^2)/expand ((exp(a) + exp(b))^2);
                          2            2
                         b  - 2 a b + a
(%o1)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
(%i2) reveal (e, 1);
(%o2)                       Quotient
(%i3) reveal (e, 2);
                             Sum(3)
(%o3)                        ------
                             Sum(3)
(%i4) reveal (e, 3);
                     Expt + Negterm + Expt
(%o4)               ------------------------
                    Product(2) + Expt + Expt
(%i5) reveal (e, 4);
                       2                 2
                      b  - Product(3) + a
(%o5)         ------------------------------------
                         Product(2)     Product(2)
              2 Expt + %e           + %e
(%i6) reveal (e, 5);
                         2            2
                        b  - 2 a b + a
(%o6)              --------------------------
                       Sum(2)     2 b     2 a
                   2 %e       + %e    + %e
(%i7) reveal (e, 6);
                          2            2
                         b  - 2 a b + a
(%o7)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
</pre></dd></dl>

<p><a name="sublis"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sublis</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX240"></a>
</dt>
<dd><p>F&uuml;hrt im Unterschied zu der Funktion <code><a href="#subst">subst</a></code> die Substitutionen der
Liste <var>list</var> parallel und nicht nacheinander aus.
</p>
<p>Mit der Optionsvariablen <code><a href="#sublis_005fapply_005flambda">sublis_apply_lambda</a></code> wird die Vereinfachung
von Lamda-Ausdr&uuml;cken kontrolliert, nachdem die Substitution ausgef&uuml;hrt 
wurde.
</p>
<p>Siehe auch die Funktion <code><a href="#psubst">psubst</a></code>, um parallele Substitutionen
auszuf&uuml;hren.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) sublis ([a=b, b=a], sin(a) + cos(b));
(%o1)                    sin(b) + cos(a)
</pre></dd></dl>

<p><a name="sublis_005fapply_005flambda"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>sublis_apply_lambda</b>
<a name="IDX241"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Kontrolliert, ob Lambda-Ausdr&uuml;cke nach einer Substitution ausgewertet werden.
Hat <code>sublis_apply_lambda</code> den Wert <code>true</code> werden Lambda-Ausdr&uuml;cke
ausgewertet.  Ansonsten verbleiben diese nach der Substitution im Ausdruck.
</p></dd></dl>

<p><a name="subnumsimp"></a>
</p><dl>
<dt><u>Option variable:</u> <b>subnumsimp</b>
<a name="IDX242"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>true</code> then the functions <code><a href="#subst">subst</a></code> and <code><a href="#psubst">psubst</a></code> can substitute
a subscripted variable <code>f[x]</code> with a number, when only the symbol <code>f</code>
is given.
</p>
<p>See also <code><a href="#subst">subst</a></code>.
</p>
<pre class="example">(%i1) subst(100,g,g[x]+2);

subst: cannot substitute 100 for operator g in expression g
                                                           x
 -- an error. To debug this try: debugmode(true);

(%i2) subst(100,g,g[x]+2),subnumsimp:true;
(%o2)                          102
</pre></dd></dl>

<p><a name="subst"></a>
</p><dl>
<dt><u>Funktion:</u> <b>subst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX243"></a>
</dt>
<dd><p>Substituiert <var>a</var> f&uuml;r <var>b</var> in den Ausdruck <var>c</var>.  Das Argument 
<var>b</var> muss ein Atom oder ein vollst&auml;ndiger Teilausdruck von <var>c</var> sein.
Zum Beispiel ist <code>x+y+z</code> ein vollst&auml;ndiger Teilausdruck von
<code>2*(x+y+z)/w</code>, nicht aber <code>x+y</code>.  Hat <var>b</var> nicht diese Eigenschaft,
dann k&ouml;nnen m&ouml;glicherweise die Funktionen <code><a href="#substpart">substpart</a></code> oder 
<code><a href="maxima_17.html#ratsubst">ratsubst</a></code> angewendet werden.
</p>
<p>Hat <var>b</var> die Form <code>e/f</code>, kann <code>subst(a*f, e, c)</code> verwendet werden.
Ist <code>b</code> von der Form <code>e^(1/f)</code>, dann kann <code>subst(a^f, e, c)</code>
verwendet werden.  Die Funktion <code>subst</code> erkennt auch den Ausdruck 
<code>x^y</code> in <code>x^-y</code>, so dass <code>subst(a, sqrt(x), 1/sqrt(x))</code> das
Ergebnis <code>1/a</code> hat.  <var>a</var> und <var>b</var> k&ouml;nnen auch die Namen von 
Operatoren oder Funktionen sein.  Soll die unabh&auml;ngige Variable in
Ausdr&uuml;cken mit Ableitungen substituiert werden, sollte die Funktion
<code><a href="maxima_16.html#at">at</a></code> verwendet werden.
</p>
<p><code>subst</code> ist der Alias-Name f&uuml;r <code>substitute</code>.
</p>
<p><code>subst(<var>eq_1</var>, <var>expr</var>)</code> und <code>subst([<var>eq_1</var>, ..., 
<var>eq_k</var>], <var>expr</var>)</code> sind weitere m&ouml;gliche Formen.  <var>eq_i</var> sind
Gleichungen, die angeben, welche Substitutionen auszuf&uuml;hren sind.  F&uuml;r 
jede Gleichung wird die rechte Seite der Gleichung f&uuml;r die linke Seite in den
Ausdruck <var>expr</var> substituiert.
</p>
<p>Hat die Optionsvariable <code><a href="#exptsubst">exptsubst</a></code> den Wert <code>true</code>, wird eine
Substitution wie <code>y</code> f&uuml;r <code>%e^x</code> in einem Ausdruck der Form 
<code>%e^(a*x)</code> nicht ausgef&uuml;hrt.
</p>
<p>Hat die Optionsvariable <code><a href="#option_005fopsubst">opsubst</a></code> den Wert <code>false</code>,
f&uuml;hrt die Funktion <code>subst</code> keine Substitution in einen Operator eines
Ausdrucks aus.  Zum Beispiel hat <code>(opsubst: false, subst(x^2, r, r+r[0]))</code>
das Ergebnis <code>x^2+r[0]</code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) subst (a, x+y, x + (x+y)^2 + y);
                                    2
(%o1)                      y + x + a
(%i2) subst (-%i, %i, a + b*%i);
(%o2)                       a - %i b
</pre>

<p>Weitere Beispiele werden mit <code>example(subst)</code> angezeigt.
</p></dd></dl>

<p><a name="substinpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>substinpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX244"></a>
</dt>
<dd><p>Die Funktion <code>substinpart</code> ist vergleichbar mit <code><a href="#substpart">substpart</a></code>.
<code>substinpart</code> wirkt jedoch auf die interne Darstellung des Ausdrucks 
<var>expr</var>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) x . 'diff (f(x), x, 2);
                              2
                             d
(%o1)                   x . (--- (f(x)))
                               2
                             dx
(%i2) substinpart (d^2, %, 2);
                                  2
(%o2)                        x . d
(%i3) substinpart (f1, f[1](x + 1), 0);
(%o3)                       f1(x + 1)
</pre></dd></dl>

<p><a name="substpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>substpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX245"></a>
</dt>
<dd><p>Substituiert <var>x</var> f&uuml;r den Teilausdruck, der mit den restlichen Argumenten 
der Funktion <code>substpart</code> ausgew&auml;hlt wird.  Es wird der neue Ausdruck 
<var>expr</var> zur&uuml;ckgegeben.  <var>x</var> kann auch der Name eines Operators sein,
der f&uuml;r einen Operator im Ausdruck <var>expr</var> substituiert wird.  Zum Beispiel
hat <code>substpart(&quot;+&quot;, a*b, 0)</code> das Ergebnis <code>b + a</code>).
</p>
<p>Mit dem Wert <code>true</code> f&uuml;r die Optionsvariable <code><a href="#inflag">inflag</a></code>, verh&auml;lt
sich die Funktion <code>substpart</code> wie <code><a href="#substinpart">substinpart</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) 1/(x^2 + 2);
                               1
(%o1)                        ------
                              2
                             x  + 2
(%i2) substpart (3/2, %, 2, 1, 2);
                               1
(%o2)                       --------
                             3/2
                            x    + 2
(%i3) a*x + f(b, y);
(%o3)                     a x + f(b, y)
(%i4) substpart (&quot;+&quot;, %, 1, 0);
(%o4)                    x + f(b, y) + a
</pre></dd></dl>

<p><a name="symbolp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>symbolp</b><i> (<var>expr</var>)</i>
<a name="IDX246"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn <var>expr</var> ein Symbol ist, ansonsten 
<code>false</code>.  Das Kommando <code>symbolp(x)</code> ist &auml;quivalent zu
<code>atom(x) and not numberp(x)</code>.
</p>
<p>Siehe auch <a href="#SEC42">Bezeichner</a>.
</p></dd></dl>

<p><a name="unorder"></a>
</p><dl>
<dt><u>Funktion:</u> <b>unorder</b><i> ()</i>
<a name="IDX247"></a>
</dt>
<dd><p>L&ouml;scht die Ordnung, die mit dem letzten Aufruf der Funktionen 
<code>ordergreat</code> oder <code>orderless</code> erzeugt wurde.
</p>
<p>Siehe auch <code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) unorder();
(%o1)                          []
(%i2) b*x + a^2;
                                   2
(%o2)                       b x + a
(%i3) ordergreat (a);
(%o3)                         done
(%i4) b*x + a^2;
 %th(1) - %th(3);
                             2
(%o4)                       a  + b x
(%i5) unorder();
                              2    2
(%o5)                        a  - a
</pre></dd></dl>

<p><a name="verbify"></a>
</p><dl>
<dt><u>Funktion:</u> <b>verbify</b><i> (<var>f</var>)</i>
<a name="IDX248"></a>
</dt>
<dd><p>Gibt das Verb des Symbols <var>f</var> zur&uuml;ck.  Siehe auch das Kapitel
<a href="#SEC41">Substantive und Verben</a>, sowie <code><a href="#noun">noun</a></code> und <code><a href="#nounify">nounify</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC44" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>Oktober, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
