<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on Oktober, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 9. Vereinfachung</title>

<meta name="description" content="Maxima Manual: 9. Vereinfachung">
<meta name="keywords" content="Maxima Manual: 9. Vereinfachung">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Vereinfachung"></a>
<a name="SEC57"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_8.html#SEC56" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC58" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC54" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC60" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 9. Vereinfachung </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC58">9.1 Einf&uuml;hrung in die Vereinfachung</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC59">9.2 Funktionen und Variablen f&uuml;r die Vereinfachung</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-die-Vereinfachung"></a>
<a name="SEC58"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC57" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC57" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC57" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC60" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 9.1 Einf&uuml;hrung in die Vereinfachung </h2>

<p>Nach der Auswertung einer Eingabe, die in <a href="maxima_8.html#SEC54">Auswertung</a> beschrieben ist,
schlie&szlig;t sich die Vereinfachung eines Ausdrucks an.  Mathematische
Funktionen mit denen symbolisch gerechnet werden kann, werden nicht ausgewertet,
sondern vereinfacht.  Mathematische Funktionen werden intern von Maxima in einer
Substantivform dargestellt.  Auch Ausdr&uuml;cke mit den arithmetischen Operatoren
werden vereinfacht.  Numerische Rechnungen wie die Addition oder Multiplikation
sind daher keine Auswertung, sondern eine Vereinfachung.  Die Auswertung eines
Ausdrucks kann mit dem <code><a href="maxima_8.html#g_t_0027">Quote-Operator</a></code> <code>'</code> unterdr&uuml;ckt werden.
Entsprechend kann die Vereinfachung eines Ausdrucks mit der Optionsvariablen
<code><a href="#simp">simp</a></code> kontrolliert werden.
</p>
<p>Beispiele:
</p>
<p>Im ersten Beispiel wird die Auswertung mit dem Quote-Operator unterdr&uuml;ckt.
Das Ergebnis ist eine Substantivform f&uuml;r die Ableitung.  Im zweiten Beispiel
ist die Vereinfachung unterdr&uuml;ckt.  Die Ableitung wird ausgef&uuml;hrt, da es
sich um eine Auswertung handelt.  Das Ergebnis wird jedoch nicht zu <code>2*x</code> 
vereinfacht.
</p>
<pre class="example">(%i1) 'diff(x*x,x);
                             d    2
(%o1)                        -- (x )
                             dx
(%i2) simp:false;
(%o2)                         false
(%i3) diff(x*x,x);
(%o3)                       1 x + 1 x
</pre>
<p>F&uuml;r jede mathematischen Funktion oder Operator hat Maxima intern eine eigene
Routine, die f&uuml;r die Vereinfachung aufgerufen wird, sobald die Funktion oder
der Operator in einem Ausdruck auftritt.  Diese Routinen implementieren
Symmetrieeigenschaften, spezielle Funktionswerte oder andere Eigenschaften und
Regeln.  Mit einer Vielzahl von Optionsvariablen kann Einfluss auf die
Vereinfachung der Funktionen und Operatoren genommen werden.
</p>
<p>Beispiel:
</p>
<p>Die Vereinfachung der Exponentialfunktion <code><a href="maxima_10.html#exp">exp</a></code> wird von den folgenden
Optionsvariablen kontrolliert: <code><a href="maxima_10.html#g_t_0025enumer">%enumer</a></code>, <code><a href="maxima_10.html#g_t_0025emode">%emode</a></code>,
<code><a href="maxima_10.html#g_t_0025e_005fto_005fnumlog">%e_to_numlog</a></code>, <code><a href="#radexpand">radexpand</a></code>, <code><a href="maxima_10.html#logsimp">logsimp</a></code>, und
<code><a href="#demoivre">demoivre</a></code>.  Im ersten Beispiel wird der Ausdruck mit der 
Exponentialfunktion nicht vereinfacht.  Im zweiten Beispiel vereinfacht
Maxima ein Argument <code>%i*%pi/2</code>.
</p>
<pre class="example">(%i1) exp(x+%i*%pi/2), %emode:false;
                                %i %pi
                            x + ------
                                  2
(%o1)                     %e
(%i2) exp(x+%i*%pi/2), %emode:true;
                                  x
(%o2)                        %i %e
</pre>
<p>Zus&auml;tzlich zu der Vereinfachung von einzelnen mathematischen Funktionen und
Operatoren, die automatisch von Maxima ausgef&uuml;hrt werden, kennt Maxima
Funktionen wie <code><a href="#expand">expand</a></code> oder <code><a href="#radcan">radcan</a></code>, die auf Ausdr&uuml;cke
angewendet werden, um spezielle Vereinfachungen vorzunehmen.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) (log(x+x^2)-log(x))^a/log(1+x)^(a/2);
                           2               a
                     (log(x  + x) - log(x))
(%o1)                -----------------------
                                    a/2
                          log(x + 1)
(%i2) radcan(%);
                                    a/2
(%o2)                     log(x + 1)
</pre>
<p>Einem Operator oder einer Funktion k&ouml;nnen Eigenschaften wie linear oder 
symmetrisch gegeben werden.  Maxima ber&uuml;cksichtigt diese Eigenschaften bei der
Vereinfachung eines Ausdrucks.  Zum Beispiel wird mit dem Kommando 
<code>declare(f, oddfun)</code> eine Funktion als ungerade definiert.  Maxima 
vereinfacht dann jedes Auftreten eines Ausdrucks <code>f(-x)</code> zu <code>-f(x)</code>.
Entsprechend vereinfacht Maxima <code>f(-x)</code> zu <code>f(x)</code>, wenn die Funktion 
als gerade definiert wurde.
</p>
<p>Die folgenden Eigenschaften sind in der Liste <code><a href="#opproperties">opproperties</a></code> enthalten und
kontrollieren die Vereinfachung von Funktionen und Operatoren:
</p>
<pre class="verbatim">   additive        lassociative     oddfun
   antisymmetric   linear           outative
   commutative     multiplicative   rassociative
   evenfun         nary             symmetric
</pre>
<p>Dar&uuml;ber hinaus haben auch die Fakten und die Eigenschaften des aktuellen
Kontextes Einfluss auf die Vereinfachung von Ausdr&uuml;cken.  Siehe dazu die
Ausf&uuml;hrungen in <a href="maxima_11.html#SEC72">Maximas Datenbank</a>.
</p>
<p>Beispiel:
</p>
<p>Die Sinusfunktion vereinfacht f&uuml;r ein ganzzahliges Vielfaches von <code>%pi</code>
zum Wert <code>0</code>.  Erh&auml;lt das Symbol <code>n</code> die Eigenschaft <code>integer</code>,
wird die Sinusfunktion entsprechend vereinfacht.
</p>
<pre class="example">(%i1) sin(n*%pi);
(%o1)                      sin(%pi n)
(%i2) declare(n, integer);
(%o2)                         done
(%i3) sin(n*%pi);
(%o3)                           0
</pre>
<p>F&uuml;hren alle oben genannten M&ouml;glichkeiten nicht zu dem gew&uuml;nschten
Ergebnis, kann der Nutzer Maxima um weitere Regeln f&uuml;r die Vereinfachung
erweitern.  Diese M&ouml;glichkeiten werden in <a href="maxima_24.html#SEC183">Muster und Regeln</a> erl&auml;utert.
</p>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-die-Vereinfachung"></a>
<a name="SEC59"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC58" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC60" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC57" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC57" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC60" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 9.2 Funktionen und Variablen f&uuml;r die Vereinfachung </h2>

<p><a name="additive"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>additive</b>
<a name="IDX295"></a>
</dt>
<dd><p><code>declare(f, additive)</code> deklariert eine Funktion <code>f</code> als additiv.  Hat 
die Funktion <code>f</code> ein Argument, dann wird <code>f(x + y)</code> zu 
<code>f(x) + f(y)</code> vereinfacht.
</p>
<p>Ist <code>f</code> eine Funktion mit zwei oder mehr Argumenten, ist die
Additivit&auml;t f&uuml;r das erste Argument definiert.  Zum Beispiel wird
<code>f(x + y,a + b)</code> zu <code>f(y, b + a) + f(x, b + a)</code> vereinfacht.
</p>
<p>Siehe die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) F3 (a + b + c);
(%o1)                     F3(c + b + a)
(%i2) declare (F3, additive);
(%o2)                         done
(%i3) F3 (a + b + c);
(%o3)                 F3(c) + F3(b) + F3(a)
</pre></dd></dl>

<p><a name="antisymmetric"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>antisymmetric</b>
<a name="IDX296"></a>
</dt>
<dd><p><code>declare(f, antisymmetric)</code> deklariert die Funktion <code>f</code> als 
antisymmetrisch.  Zum Beispiel wird <code>f(y, x)</code> zu <code>- f(x, y)</code>
vereinfacht.
</p>
<p>Siehe auch die Eigenschaft <code><a href="#symmetric">symmetric</a></code> und die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) S (b, a);
(%o1)                        S(b, a)
(%i2) declare (T, antisymmetric);
(%o2)                         done
(%i3) T (b, a);
(%o3)                       - T(a, b)
(%i4) T (a, c, e, d, b);
(%o4)                   T(a, b, c, d, e)
</pre></dd></dl>

<p><a name="combine"></a>
</p><dl>
<dt><u>Funktion:</u> <b>combine</b><i> (<var>expr</var>)</i>
<a name="IDX297"></a>
</dt>
<dd><p>Terme einer rationalen Funktion, die denselben Nenner haben, werden 
zusammengefasst.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) x^2/(1+x)+2*x/(1+x);
                            2
                           x       2 x
(%o1)                     ----- + -----
                          x + 1   x + 1
(%i2) combine(%);
                             2
                            x  + 2 x
(%o2)                       --------
                             x + 1
</pre></dd></dl>

<p><a name="commutative"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>commutative</b>
<a name="IDX298"></a>
</dt>
<dd><p><code>declare(f, commutative)</code> deklariert die Funktion <code>f</code> als kommutativ.
Zum Beispiel wird <code>f(x, z, y)</code> zu <code>f(x, y, z)</code> vereinfacht.
Dies hat denselben Effekt wie die Deklaration <code><a href="#symmetric">symmetric</a></code>.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p></dd></dl>

<p><a name="demoivre"></a>
</p><dl>
<dt><u>Funktion:</u> <b>demoivre</b><i> (<var>expr</var>)</i>
<a name="IDX299"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>demoivre</b>
<a name="IDX300"></a>
</dt>
<dd><p>Die Funktion <code>demoivre(expr)</code> konvertiert den Ausdruck <var>expr</var>, ohne
die Optionsvariable <code>demoivre</code> zu setzen.
</p>
<p>Hat die Optionsvariable <code>demoivre</code> den Wert <code>true</code>, werden komplexe
Exponentialfunktionen in &auml;quivalente Kreisfunktionen umgewandelt.
<code>exp(a + b*%i)</code> wird zu <code>%e^a*(cos(b)+%i*sin(b))</code> vereinfacht,
wenn <code>b</code> frei von der imagin&auml;ren Einheit <code>%i</code> ist.  <code>a</code> und 
<code>b</code> werden nicht expandiert.
</p>
<p>Der Standardwert von <code>demoivre</code> ist <code>false</code>.
</p>
<p>Siehe auch die Funktion <code><a href="#exponentialize">exponentialize</a></code>, um trigonometrische und
hyperbolische Funktionen in eine Exponentialform zu konvertieren.
<code>demoivre</code> und <code>exponentialize</code> k&ouml;nnen nicht gleichzeitig den Wert
<code>true</code> haben.
</p></dd></dl>

<p><a name="function_005fdistrib"></a>
</p><dl>
<dt><u>Funktion:</u> <b>distrib</b><i> (<var>expr</var>)</i>
<a name="IDX301"></a>
</dt>
<dd><p>Summen werden ausmultipliziert.  Im Unterschied zu der Funktion
<code><a href="#expand">expand</a></code> wird <code>distrib</code> nur auf der obersten Ebene eines Ausdruckes
angewendet und ist daher schneller als <code>expand</code>.  Im Unterschied zu der
Funktion <code><a href="#multthru">multthru</a></code> werden die Summen der obersten Ebenen vollst&auml;ndig
ausmultipliziert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) distrib ((a+b) * (c+d));
(%o1)                 b d + a d + b c + a c
(%i2) multthru ((a+b) * (c+d));
(%o2)                 (b + a) d + (b + a) c
(%i3) distrib (1/((a+b) * (c+d)));
                                1
(%o3)                    ---------------
                         (b + a) (d + c)
(%i4) expand (1/((a+b) * (c+d)), 1, 0);
                                1
(%o4)                 ---------------------
                      b d + a d + b c + a c
</pre></dd></dl>

<p><a name="distribute_005fover"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>distribute_over</b>
<a name="IDX302"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Die Optionsvariable <code>distribute_over</code> kontrolliert die Anwendung von 
Funktionen auf Listen, Matrizen oder Gleichungen.  Diese Eigenschaft wird nicht 
angewendet, wenn <code>distribute_over</code> den Wert <code>false</code> hat.
</p>
<p>Beispiele:
</p>
<p>Die Funktion <code><a href="maxima_10.html#sin">sin</a></code> wird auf eine Liste angewendet.
</p>
<pre class="example">(%i1) sin([x,1,1.0]);
(%o1)                 [sin(x), sin(1), .8414709848078965]
</pre>
<p>Die Funktion <code><a href="maxima_21.html#mod">mod</a></code> hat zwei Argumente, die auf Listen angewendet werden
kann.  Die Funktion kann auch auf verschachtelte Listen angewendet werden.
</p>
<pre class="example">(%i2) mod([x,11,2*a],10);
(%o2)                    [mod(x, 10), 1, 2 mod(a, 5)]
(%i3) mod([[x,y,z],11,2*a],10);
(%o3)       [[mod(x, 10), mod(y, 10), mod(z, 10)], 1, 2 mod(a, 5)]
</pre>
<p>Anwendung der Funktion <code><a href="maxima_10.html#floor">floor</a></code> auf eine Matrix und eine Gleichung.
</p>
<pre class="example">(%i4) floor(matrix([a,b],[c,d]));
                            [ floor(a)  floor(b) ]
(%o4)                       [                    ]
                            [ floor(c)  floor(d) ]
(%i5) floor(a=b);
(%o5)                         floor(a) = floor(b)
</pre>
<p>Funktionen mit mehreren Argumenten k&ouml;nnen auf Listen f&uuml;r eines der Argumente
oder alle Argumente angewendet werden.
</p>
<pre class="example">(%i6) expintegral_e([1,2],[x,y]);
(%o6) [[expintegral_e(1, x), expintegral_e(1, y)], 
       [expintegral_e(2, x), expintegral_e(2, y)]]
</pre></dd></dl>

<p><a name="domain"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>domain</b>
<a name="IDX303"></a>
</dt>
<dd><p>Standardwert: <code>real</code>
</p>
<p>Hat <code>domain</code> den Wert <code>complex</code>, wird <code>sqrt(x^2)</code> nicht zu
<code>abs(x)</code> vereinfacht.
</p></dd></dl>

<p><a name="evenfun"></a>
<a name="oddfun"></a> 
</p><dl>
<dt><u>Eigenschaft:</u> <b>evenfun</b>
<a name="IDX304"></a>
</dt>
<dt><u>Eigenschaft:</u> <b>oddfun</b>
<a name="IDX305"></a>
</dt>
<dd><p>Erh&auml;lt eine Funktion oder ein Operator mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code> die
Eigenschaft <code>evenfun</code> oder <code>oddfun</code> wird die Funktion oder der
Operator von Maxima als gerade und ungerade interpretiert.  Diese Eigenschaft
wird bei der Vereinfachung von Ausdr&uuml;cken von Maxima angewendet.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) o (- x) + o (x);
(%o1)                     o(x) + o(- x)
(%i2) declare (o, oddfun);
(%o2)                         done
(%i3) o (- x) + o (x);
(%o3)                           0
(%i4) e (- x) - e (x);
(%o4)                     e(- x) - e(x)
(%i5) declare (e, evenfun);
(%o5)                         done
(%i6) e (- x) - e (x);
(%o6)                           0
</pre></dd></dl>

<p><a name="expand"></a>
</p><dl>
<dt><u>Funktion:</u> <b>expand</b><i> (<var>expr</var>)</i>
<a name="IDX306"></a>
</dt>
<dt><u>Funktion:</u> <b>expand</b><i> (<var>expr</var>, <var>p</var>, <var>n</var>)</i>
<a name="IDX307"></a>
</dt>
<dd><p>Expandiert den Ausdruck <var>expr</var>.  Produkte von Summen und Potenzen von Summen
werden ausmultipliziert.  Die Nenner von rationalen Ausdr&uuml;cken, die Summen 
sind, werden in ihre Terme aufgespalten.  Produkte (kommutative und 
nicht-kommutative) werden in Summen herein multipliziert.
</p>
<p>F&uuml;r Polynome ist es besser, die Funktion <code><a href="maxima_17.html#ratexpand">ratexpand</a></code> zu verwenden, welche
f&uuml;r diesen Fall einen effizienteren Algorithmus hat.
</p>
<p><code><a href="#maxnegex">maxnegex</a></code> und <code><a href="#maxposex">maxposex</a></code> kontrollieren den maximalen negativen und
positiven Exponenten, f&uuml;r die ein Ausdruck expandiert wird.
</p>
<p><code>expand(<var>expr</var>, <var>p</var>, <var>n</var>)</code> expandiert <var>expr</var>, wobei 
<code>maxposex</code> den Wert <var>p</var> und <code>maxnegex</code> den Wert <var>n</var> erhalten.
</p>
<p><code><a href="#expon">expon</a></code> ist der gr&ouml;&szlig;te negative Exponent, f&uuml;r den ein Ausdruck
automatisch expandiert wird.  Hat zum Beispiel <code>expon</code> den Wert 4, wird 
<code>(x+1)^(-5)</code> nicht automatisch expandiert.
</p>
<p><code><a href="#expop">expop</a></code> ist der gr&ouml;&szlig;te positive Exponent, f&uuml;r den ein Ausdruck
automatisch expandiert wird.  So wird <code>(x+1)^3</code> dann automatisch
expandiert, wenn <code>expop</code> gr&ouml;&szlig;er oder gleich 3 ist.  Soll 
<code>(x+1)^n</code> mit der Funktion <code>expand</code> expandiert werden, weil <code>n</code>
gr&ouml;&szlig;er als <code>expop</code> ist, dann ist dies nur m&ouml;glich, wenn <code>n</code>
kleiner als <code>maxposex</code> ist.
</p>
<p><code>expand(expr,0,0)</code> bewirkt eine erneuerte vollst&auml;ndige Vereinfachung 
des Ausdrucks <var>expr</var>.  Der Ausdruck wird nicht erneuert ausgewertet.  Im 
Unterschied zum Kommando <code>ev(expr, noeval)</code> wird eine spezielle Darstellung
(zum Beispiel eine CRE-Form) nicht entfernt.  Siehe auch <code><a href="maxima_8.html#ev">ev</a></code>.
</p>
<p>Das <code>expand</code>-Flag wird mit <code>ev</code> verwendet, um einen Ausdruck zu 
expandieren.
</p>
<p>Die Datei <tt>`simplification/facexp.mac'</tt> enth&auml;lt weitere Funktionen wie 
<code><a href="maxima_69.html#facsum">facsum</a></code>, <code><a href="maxima_69.html#factorfacsum">factorfacsum</a></code> und <code><a href="maxima_69.html#collectterms">collectterms</a></code> und Variablen wie
<code><a href="maxima_69.html#nextlayerfactor">nextlayerfactor</a></code> und <code><a href="maxima_69.html#facsum_005fcombine">facsum_combine</a></code>, um Ausdr&uuml;cke zu
vereinfachen.  Diese Funktionen werden automatisch geladen und erlauben
spezielle Expansionen von Ausdr&uuml;cken.  Eine kurze Beschreibung ist in der 
Datei <tt>`simplification/facexp.usg'</tt> enthalten.  Eine Demo kann mit
<code>demo(facexp)</code> ausgef&uuml;hrt werden.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) expr:(x+1)^2*(y+1)^3;
                               2        3
(%o1)                   (x + 1)  (y + 1)
(%i2) expand(expr);
       2  3        3    3      2  2        2      2      2
(%o2) x  y  + 2 x y  + y  + 3 x  y  + 6 x y  + 3 y  + 3 x  y
                                                      2
                                     + 6 x y + 3 y + x  + 2 x + 1
(%i3) expand(expr,2);
               2        3              3          3
(%o3)         x  (y + 1)  + 2 x (y + 1)  + (y + 1)
(%i4) expr:(x+1)^-2*(y+1)^3;
                                   3
                            (y + 1)
(%o4)                       --------
                                   2
                            (x + 1)
(%i5) expand(expr);
            3               2
           y             3 y            3 y             1
(%o5) ------------ + ------------ + ------------ + ------------
       2              2              2              2
      x  + 2 x + 1   x  + 2 x + 1   x  + 2 x + 1   x  + 2 x + 1
(%i6) expand(expr, 2, 2);
                                   3
                            (y + 1)
(%o6)                     ------------
                           2
                          x  + 2 x + 1
</pre>
<p>Vereinfache einen Ausdruck erneut:
</p>
<pre class="example">(%i7) expr:(1+x)^2*sin(x);
                                2
(%o7)                    (x + 1)  sin(x)
(%i8) exponentialize:true;
(%o8)                         true
(%i9) expand(expr, 0, 0);
                            2    %i x     - %i x
                  %i (x + 1)  (%e     - %e      )
(%o9)           - -------------------------------
                                 2
</pre></dd></dl>

<p><a name="expandwrt"></a>
</p><dl>
<dt><u>Funktion:</u> <b>expandwrt</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX308"></a>
</dt>
<dd><p>Expandiert den Ausdruck <code>expr</code> in Bezug auf die Variablen <var>x_1</var>, 
&hellip;, <var>x_n</var>.  Alle Produkte, die die Variablen enthalten, werden 
ausmultipliziert.  Das Ergebnis ist frei von Produkten von Summen, die nicht 
frei von den Variablen sind.  <var>x_1</var>, &hellip;, <var>x_n</var> k&ouml;nnen Variable, 
Operatoren oder Ausdr&uuml;cke sein.
</p>
<p>Standardm&auml;&szlig;ig wird der Nenner eines rationalen Ausdrucks nicht expandiert.
Dies kann mit der Optionsvariablen <code><a href="#expandwrt_005fdenom">expandwrt_denom</a></code> kontrolliert werden.
</p>
<p>Die Funktion wird automatisch aus der Datei <tt>`simplification/stopex.mac'</tt>
geladen.
</p></dd></dl>

<p><a name="expandwrt_005fdenom"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>expandwrt_denom</b>
<a name="IDX309"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p><code>expandwrt_denom</code> kontrolliert die Behandlung von rationalen Ausdr&uuml;cken 
durch die Funktion <code>expandwrt</code>.  Ist der Wert <code>true</code>, werden der
Z&auml;hler und der Nenner eines rationalen Ausdrucks expandiert.  Ist der Wert
<code>false</code>, wird allein der Z&auml;hler expandiert.
</p></dd></dl>

<p><a name="expandwrt_005ffactored"></a>
</p><dl>
<dt><u>Funktion:</u> <b>expandwrt_factored</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX310"></a>
</dt>
<dd><p>Ist vergleichbar mit der Funktion <code><a href="#expandwrt">expandwrt</a></code>, behandelt aber Ausdr&uuml;cke 
verschieden, die Produkte enthalten.  <code>expandwrt_factored</code> expandiert nur
die Faktoren im Ausdruck <code>expr</code>, die die Variablen <var>x_1</var>, &hellip;,
<var>x_n</var> enthalten.
</p></dd></dl>

<p><a name="expon"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>expon</b>
<a name="IDX311"></a>
</dt>
<dd><p>Standardwert: 0
</p>
<p><code>expon</code> ist der gr&ouml;&szlig;te negative Exponent f&uuml;r den ein Ausdruck 
automatisch expandiert wird.  Hat zum Beispiel <code>expon</code> den Wert 4, wird
<code>(x+1)^(-5)</code> nicht automatisch expandiert.  Siehe auch <code><a href="#expop">expop</a></code>.
</p></dd></dl>

<p><a name="exponentialize"></a>
</p><dl>
<dt><u>Funktion:</u> <b>exponentialize</b><i> (<var>expr</var>)</i>
<a name="IDX312"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>exponentialize</b>
<a name="IDX313"></a>
</dt>
<dd><p>Die Funktion <code>exponentialize</code> konvertiert trigonometrische und
hyperbolische Funktion die in dem Ausdruck <var>expr</var> auftreten in 
Exponentialfunktionen, ohne dass die Optionsvariable <code>exponentialize</code>
gesetzt wird.
</p>
<p>Hat die Optionsvariable <code>exponentialize</code> den Wert <code>true</code>, werden
trigonometrische und hyperbolischen Funktionen in eine Exponentialform 
konvertiert.  Der Standardwert ist <code>false</code>.
</p>
<p><code><a href="#demoivre">demoivre</a></code> konvertiert komplexe Exponentialfunktionen in trigonometrische
und hyperbolische Funktionen.  <code>exponentialize</code> und <code>demoivre</code> 
k&ouml;nnen nicht gleichzeitig den Wert <code>true</code> haben.
</p></dd></dl>

<p><a name="expop"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>expop</b>
<a name="IDX314"></a>
</dt>
<dd><p>Standardwert: 0
</p>
<p><code>expop</code> ist der gr&ouml;&szlig;te positive Exponent, f&uuml;r den ein Ausdruck 
automatisch expandiert wird.  So wird <code>(x+1)^3</code> dann automatisch
expandiert, wenn <code>expop</code> gr&ouml;&szlig;er oder gleich 3 ist.  Soll
<code>(x+1)^n</code> mit der Funktion <code><a href="#expand">expand</a></code> expandiert werden, weil <code>n</code>
gr&ouml;&szlig;er als <code>expop</code> ist, dann ist dies nur m&ouml;glich, wenn <code>n</code>
kleiner als <code><a href="#maxposex">maxposex</a></code> ist.  Siehe auch <code><a href="#expon">expon</a></code>.
</p></dd></dl>

<p><a name="lassociative"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>lassociative</b>
<a name="IDX315"></a>
</dt>
<dd><p><code>declare(f, lassociative)</code> deklariert <code>f</code> als eine links-assoziative
Funktion.  Zum Beispiel wird <code>f (f (a,b), f (c, d))</code> zu 
<code>f (f (f (a, b), c), d)</code> vereinfacht.
</p>
<p>Siehe auch die Eigenschaft <code><a href="#rassociative">rassociative</a></code> und die Funktion
<code><a href="maxima_11.html#declare">declare</a></code>.
</p></dd></dl>

<p><a name="linear"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>linear</b>
<a name="IDX316"></a>
</dt>
<dd><p><code>declare(f, linear)</code> deklariert die Funktion <code>f</code> als linear.
</p>
<p>Hat die Funktion <code>f</code> ein Argument, dann wird <code>f(x + y)</code> zu 
<code>f(x) + f(y)</code> und <code>f(a*x)</code> zu <code>a*f(x)</code> vereinfacht.
</p>
<p>Ist <code>f</code> eine Funktion mit zwei oder mehr Argumenten, ist die
Linearit&auml;t f&uuml;r das erste Argument definiert.  Zum Beispiel wird
<code>f(a*x + b, x)</code> zu <code>a f(x, x) + f(1, x) b</code> vereinfacht.
</p>
<p><code>linear</code> ist &auml;quivalent zu <code><a href="#additive">additive</a></code> und <code><a href="#outative">outative</a></code>.  Siehe
auch <code><a href="#opproperties">opproperties</a></code> und die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) 'sum (F(k) + G(k), k, 1, inf);
                       inf
                       ====
                       \
(%o1)                   &gt;    (G(k) + F(k))
                       /
                       ====
                       k = 1
(%i2) declare (nounify (sum), linear);
(%o2)                         done
(%i3) 'sum (F(k) + G(k), k, 1, inf);
                     inf          inf
                     ====         ====
                     \            \
(%o3)                 &gt;    G(k) +  &gt;    F(k)
                     /            /
                     ====         ====
                     k = 1        k = 1
</pre></dd></dl>

<p><a name="maxnegex"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>maxnegex</b>
<a name="IDX317"></a>
</dt>
<dd><p>Standardwert: 1000
</p>
<p><code>maxnegex</code> ist der gr&ouml;&szlig;te negative Exponent, der von der Funktion 
<code><a href="#expand">expand</a></code> exandieren wird.  Siehe auch <code><a href="#maxposex">maxposex</a></code>.
</p></dd></dl>

<p><a name="maxposex"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>maxposex</b>
<a name="IDX318"></a>
</dt>
<dd><p>Standardwert: 1000
</p>
<p><code>maxposex</code> ist der gr&ouml;&szlig;te positive Exponent, der von der Funktion 
<code><a href="#expand">expand</a></code> expandiert wird.  Siehe auch <code><a href="#maxnegex">maxnegex</a></code>.
</p></dd></dl>

<p><a name="multiplicative"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>multiplicative</b>
<a name="IDX319"></a>
</dt>
<dd><p><code>declare(f, multiplicative)</code> deklariert die Funktion <code>f</code> als 
multiplikativ.
</p>
<p>Hat die Funktion <code>f</code> ein Argument, dann wird <code>f(x*y)</code> zu
<code>f(x)*f(y)</code> vereinfacht.
</p>
<p>Ist <code>f</code> eine Funktion mit zwei oder mehr Argumenten, ist die
Multiplikativit&auml;t f&uuml;r das erste Argument definiert.  Zum Beispiel wird
<code>f(a*x + b, x)</code> zu <code>f(g(x), x)*f(h(x), x)</code> vereinfacht.
</p>
<p>Diese Vereinfachung werden nicht f&uuml;r Ausdr&uuml;cke der Form
<code>product(x[i], i, m, n)</code> ausgef&uuml;hrt.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) F2 (a * b * c);
(%o1)                       F2(a b c)
(%i2) declare (F2, multiplicative);
(%o2)                         done
(%i3) F2 (a * b * c);
(%o3)                   F2(a) F2(b) F2(c)
</pre></dd></dl>

<p><a name="multthru"></a>
</p><dl>
<dt><u>Funktion:</u> <b>multthru</b><i> (<var>expr</var>)</i>
<a name="IDX320"></a>
</dt>
<dt><u>Funktion:</u> <b>multthru</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX321"></a>
</dt>
<dd><p>Multipliziert einen oder mehrere Faktoren in eine Summe herein.  <code>multthru</code>
expandiert keine Potenzen von Summen.  <code>multthru</code> ist die effizienteste
Methode, um Produkte von Summen auszumultiplizieren.  Da Maxima intern die
Division als ein Produkt darstellt, kann <code>multthru</code> auch angewendet werden,
um einen Nenner in eine Summe hereinzumultiplizieren.
</p>
<p><code>multthru(<var>expr_1</var>, <var>expr_2</var>)</code> multipliziert jeden Term des
Ausdrucks <var>expr_2</var> mit <var>expr_1</var>.  Der Ausdruck <var>expr_2</var> kann dabei 
eine Summe oder eine Gleichung sein.
</p>
<p>Siehe auch die Funktionen <code><a href="#expand">expand</a></code> und <code><a href="#function_005fdistrib">function_distrib</a></code>.
</p>
<pre class="example">(%i1) x/(x-y)^2 - 1/(x-y) - f(x)/(x-y)^3;
                      1        x         f(x)
(%o1)             - ----- + -------- - --------
                    x - y          2          3
                            (x - y)    (x - y)
(%i2) multthru ((x-y)^3, %);
                           2
(%o2)             - (x - y)  + x (x - y) - f(x)
(%i3) ratexpand (%);
                           2
(%o3)                   - y  + x y - f(x)
(%i4) ((a+b)^10*s^2 + 2*a*b*s + (a*b)^2)/(a*b*s^2);
                        10  2              2  2
                 (b + a)   s  + 2 a b s + a  b
(%o4)            ------------------------------
                                  2
                             a b s
(%i5) multthru (%);  /* note that this does not expand (b+a)^10 */
                                        10
                       2   a b   (b + a)
(%o5)                  - + --- + ---------
                       s    2       a b
                           s
(%i6) multthru (a.(b+c.(d+e)+f));
(%o6)            a . f + a . c . (e + d) + a . b
(%i7) expand (a.(b+c.(d+e)+f));
(%o7)         a . f + a . c . e + a . c . d + a . b
</pre></dd></dl>

<p><a name="property_005fnary"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>nary</b>
<a name="IDX322"></a>
</dt>
<dd><p>Erh&auml;lt eine Funktion oder ein Operator mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code> die
Eigenschaft <code>nary</code>, werden verschachtelte Anwendungen der Funktion oder des
Operators wie zum Beispiel <code>foo(x, foo(y, z))</code> zu <code>foo(x, y, z)</code>
vereinfacht.  Die Deklaration als <code>nary</code> unterscheidet sich
von der Funktion <code>nary</code>.  W&auml;hrend der Funktionsaufruf einen neuen 
Operator definiert, wirkt sich die Deklaration nur auf die Vereinfachung aus.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) H (H (a, b), H (c, H (d, e)));
(%o1)               H(H(a, b), H(c, H(d, e)))
(%i2) declare (H, nary);
(%o2)                         done
(%i3) H (H (a, b), H (c, H (d, e)));
(%o3)                   H(a, b, c, d, e)
</pre></dd></dl>

<p><a name="negdistrib"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>negdistrib</b>
<a name="IDX323"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>negdistrib</code> den Wert <code>true</code>, wird die Zahl -1 in eine Summe
hereinmultipliziert.  Zum Beispiel wird <code>-(x + y)</code> zu <code>- y - x</code> 
vereinfacht.  <code>true</code> ist der Standardwert von <code>negdistrib</code>.
</p>
<p>Erh&auml;lt <code>negdistrib</code> den Wert <code>false</code> wird <code>-(x + y)</code>
nicht vereinfacht.  <code>negdistrib</code> sollte sehr umsichtig und nur in 
speziellen F&auml;llen f&uuml;r lokale Vereinfachungen genutzt werden.
</p></dd></dl>

<p><a name="opproperties"></a>
</p><dl>
<dt><u>Systemvariable:</u> <b>opproperties</b>
<a name="IDX324"></a>
</dt>
<dd><p><code>opproperties</code> ist eine Liste mit den Eigenschaften, die eine Funktion oder
ein Operator erhalten kann und die die Vereinfachung der Funktionen und 
Operatoren kontrollieren.  Diese Eigenschaften erhalten die Funktionen und
Operatoren mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code>.  Es gibt weitere Eigenschaften,
die Funktionen, Operatoren und Variablen erhalten k&ouml;nnen.  Die Systemvariable
<code><a href="maxima_11.html#features">features</a></code> enth&auml;lt eine vollst&auml;ndige Liste der Eigenschaften, die in 
Maximas Datenbank eingetragen werden.  Dar&uuml;berhinaus k&ouml;nnen mit der Funktion
<code>declare</code> noch Eigenschaften definiert werden, die in der
Lisp-Eigenschaftsliste eingetragen werden.
</p>
<p>Die folgenden Eigenschaften sind in der Liste <code>opproperties</code> enthalten und
kontrollieren die Vereinfachung von Funktionen und Operatoren:
</p>
<pre class="verbatim">   linear          additive        multiplicative
   outative        commutative     symmetric      
   antisymmetric   nary            lassociativ
   rassociative    evenfun         oddfun
</pre></dd></dl>

<p><a name="outative"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>outative</b>
<a name="IDX325"></a>
</dt>
<dd><p><code>declare(f, outative)</code> deklariert eine Funktion <code>f</code> als outative.
Hat der Operator oder die Funktion Argumente mit konstanten Faktoren, so werden
diese konstanten Faktoren herausgezogen.
</p>
<p>Hat die Funktion <code>f</code> ein Argument, dann wird <code>f(a*x)</code> zu 
<code>a*f(x)</code> vereinfacht, wenn <code>a</code> ein konstanter Faktor ist.
</p>
<p>Ist <code>f</code> eine Funktion mit zwei oder mehr Argumenten, ist die
Outativit&auml;t f&uuml;r das erste Argument definiert.  Zum Beispiel wird
<code>f(a*g(x), x)</code> zu <code>a*f(g(x),x)</code> vereinfacht, wenn <code>a</code> ein
konstanter Faktor ist.
</p>
<p>Die Funktionen <code><a href="maxima_15.html#sum">sum</a></code>, <code><a href="maxima_16.html#integrate">integrate</a></code> und <code><a href="maxima_16.html#limit">limit</a></code> haben die
Eigenschaft <code>outative</code>.  Siehe auch die Funktion <code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) F1 (100 * x);
(%o1)                       F1(100 x)
(%i2) declare (F1, outative);
(%o2)                         done
(%i3) F1 (100 * x);
(%o3)                       100 F1(x)
(%i4) declare (zz, constant);
(%o4)                         done
(%i5) F1 (zz * y);
(%o5)                       zz F1(y)
</pre></dd></dl>

<p><a name="radcan"></a>
</p><dl>
<dt><u>Funktion:</u> <b>radcan</b><i> (<var>expr</var>)</i>
<a name="IDX326"></a>
</dt>
<dd>


<p>Die Funktion <code>radcan</code> vereinfacht Ausdr&uuml;cke, die die Logarithmusfunktion,
Exponentialfunktionen und Wurzeln enthalten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) radcan((log(x+x^2)-log(x))^a/log(1+x)^(a/2));
                                           a/2
(%o1)                            log(x + 1)

(%i2) radcan((log(1+2*a^x+a^(2*x))/log(1+a^x)));
(%o2)                                  2

(%i3) radcan((%e^x-1)/(1+%e^(x/2)));
                                     x/2
(%o3)                              %e    - 1
</pre></dd></dl>

<p><a name="radexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>radexpand</b>
<a name="IDX327"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p><code>radexpand</code> kontrolliert die Vereinfachung von Wurzeln.
</p>
<p>Hat <code>radexpand</code> den Wert <code>all</code>, werden die nten-Wurzeln der Faktoren
eines Produktes, die eine n-te Potenz sind, aus der Wurzel herausgezogen.  Zum 
Beispiel vereinfacht <code>sqrt(16*x^2</code> zu <code>4*x</code>.
</p>
<p>Inbesondere vereinfacht der Ausdruck <code>sqrt(x^2)</code> folgenderma&szlig;en:
</p>
<ul>
<li>
Hat <code>radexpand</code> den Wert <code>all</code> oder wurde <code>assume(x&gt;0)</code> 
ausgef&uuml;hrt, dann vereinfacht <code>sqrt(x^2)</code> zu <code>x</code>.

</li><li>
Hat <code>radexpand</code> den Wert <code>true</code> und <code><a href="#domain">domain</a></code> ist <code>real</code>,
dann vereinfacht <code>sqrt(x^2)</code> zu <code>abs(x)</code>.

</li><li>
Hat <code>radexpand</code> den Wert <code>false</code> oder hat <code>radexpand</code> den Wert
<code>true</code> und <code><a href="#domain">domain</a></code> ist <code>complex</code>, dann wird <code>sqrt(x^2)</code>
nicht vereinfacht.
</li></ul>
</dd></dl>

<p><a name="rassociative"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>rassociative</b>
<a name="IDX328"></a>
</dt>
<dd><p><code>declare(f, rassociative)</code> deklariert die Funktion <code>f</code> als
rechts-assioziativ.  Zum Beispiel wird <code>f(f(a, b), f(c, d))</code> zu 
<code>f(a, f(b, f(c, d)))</code> vereinfacht.
</p>
<p>Siehe auch die Eigenschaft <code><a href="#lassociative">lassociative</a></code> und die Funktion
<code><a href="maxima_11.html#declare">declare</a></code>.
</p></dd></dl>

<p><a name="scsimp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>scsimp</b><i> (<var>expr</var>, <var>rule_1</var>, &hellip;, <var>rule_n</var>)</i>
<a name="IDX329"></a>
</dt>
<dd><p>Sequential Comparative Simplification (Methode nach Stoute).
</p>
<p><code>scsimp</code> versucht den Ausdruck <var>expr</var> mit Hilfe der Regeln 
<var>rule_1</var>, &hellip;, <var>rule_n</var> zu vereinfachen.  Die Regeln werden 
nacheinander solange angewendet, bis sich der Ausdruck nicht weiter vereinfacht.
F&uuml;hrt keine der Regeln zu einem Erfolg, wird der urspr&uuml;ngliche Ausdruck
zur&uuml;ckgegeben.
</p>
<p><code>example(scsimp)</code> zeigt einige Beispiele.
</p></dd></dl>

<p><a name="simp"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>simp</b>
<a name="IDX330"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p><code>simp</code> kontrolliert die Vereinfachung von Ausdr&uuml;cken.  Der Standardwert 
von <code>simp</code> ist <code>true</code> und Ausdr&uuml;cke werden vereinfacht.  <code>simp</code>
ist auch ein Auswertungsschalter f&uuml;r die Funktion <code><a href="maxima_8.html#ev">ev</a></code>.
</p>
<p>Wird <code>simp</code> als ein Auswertungschalter mit dem Wert <code>false</code> genutzt,
dann wird die Vereinfachung nur w&auml;hrend der Auswertungsphase unterdr&uuml;ckt.
<code>simp</code> kann nicht die Vereinfachung unterdr&uuml;cken, die sich der Auswertung
anschlie&szlig;t.
</p>
<p>Beispiele:
</p>
<p>Die Vereinfachung wird ausgeschaltet.  Der Ausdruck <code>sin(1.0)</code> wird nicht 
zu einem numerischen Wert vereinfacht.  Der Auswertungsschalter <code>simp</code>
schaltet die Vereinfachung ein.
</p>
<pre class="example">(%i1) simp:false;
(%o1)                                false
(%i2) sin(1.0);
(%o2)                              sin(1.0)
(%i3) sin(1.0),simp;
(%o3)                          .8414709848078965
</pre>
<p>Die Vereinfachung wird wieder eingeschaltet.  Der Auswertungsschalter 
<code>simp</code> kann die Vereinfachung nicht vollst&auml;ndig unterdr&uuml;cken.  In der 
Ausgabe ist der Ausdruck vereinfacht, aber die Variable <code>x</code> enth&auml;lt einen
nicht vereinfachten Ausdruck, da die Zuweisung noch w&auml;hrend der 
Auswertungsphase des Ausdrucks vorgenommen wurde.
</p>
<pre class="example">(%i4) simp:true;
(%o4)                                true
(%i5) x:sin(1.0),simp:false;
(%o5)                          .8414709848078965
(%i6) :lisp $X
((%SIN) 1.0)
</pre></dd></dl>

<p><a name="symmetric"></a>
</p><dl>
<dt><u>Eigenschaft:</u> <b>symmetric</b>
<a name="IDX331"></a>
</dt>
<dd><p><code>declare(f, symmetric)</code> deklariert die Funktion <code>f</code> als symmetrisch.
Zum Beispiel wird <code>f(x, z, y)</code> zu <code>f(x, y, z)</code> vereinfacht.
</p>
<p><code><a href="#commutative">commutative</a></code> entspricht <code>symmetric</code>  Siehe auch die Funktion
<code><a href="maxima_11.html#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) S (b, a);
(%o1)                        S(b, a)
(%i2) declare (S, symmetric);
(%o2)                         done
(%i3) S (b, a);
(%o3)                        S(a, b)
(%i4) S (a, c, e, d, b);
(%o4)                   S(a, b, c, d, e)
</pre></dd></dl>

<p><a name="xthru"></a>
</p><dl>
<dt><u>Funktion:</u> <b>xthru</b><i> (<var>expr</var>)</i>
<a name="IDX332"></a>
</dt>
<dd><p>Die Terme einer Summe des Ausdrucks <var>expr</var> werden so zusammengefasst, dass
sie einen gemeinsamen Nenner haben.  Produkte und Potenzen von Summen werden
dabei nicht expandiert.  Gemeinsame Faktoren im Z&auml;hler und Nenner werden
gek&uuml;rzt.
</p>
<p>Es kann vorteilhaft sein, vor dem Ausf&uuml;hren von <code><a href="maxima_17.html#ratsimp">ratsimp</a></code> zun&auml;chst mit
<code>xthru</code> die gemeinsamen Faktoren eines rationalen Ausdrucks zu k&uuml;rzen.
</p>
<p>Siehe auch die Funktion <code><a href="#combine">combine</a></code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) ((x+2)^20 - 2*y)/(x+y)^20 + (x+y)^(-19) - x/(x+y)^20;
                                20
                 1       (x + 2)   - 2 y       x
(%o1)        --------- + --------------- - ---------
                    19             20             20
             (y + x)        (y + x)        (y + x)
(%i2) xthru (%);
                                 20
                          (x + 2)   - y
(%o2)                     -------------
                                   20
                            (y + x)
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC57" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC60" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC410" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>Oktober, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
