<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on Outubro, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.41.0: 6. Expressões</title>

<meta name="description" content="Manual do Maxima 5.41.0: 6. Expressões">
<meta name="keywords" content="Manual do Maxima 5.41.0: 6. Expressões">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Express_00f5es"></a>
<a name="SEC20"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_5.html#SEC19" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC21" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_5.html#SEC12" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 6. Expressões </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC21">6.1 Introdução a Expressões</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC22">6.2 Complexo</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                     
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC23">6.3 Substantivos e Verbos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC24">6.4 Identificadores</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC25">6.5 Sequências de caracteres</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC26">6.6 Desigualdade</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                  
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC27">6.7 Sintaxe</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                      
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC28">6.8 Definições para Expressões</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Introdu_00e7_00e3o-a-Express_00f5es"></a>
<a name="SEC21"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC22" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.1 Introdução a Expressões </h2>

<p>Existe um conjunto de palavras reservadas que não pode ser usado como
nome de variável.   Seu uso pode causar um possível erro crítico de sintaxe.
</p>
<pre class="example">integrate            next           from                 diff            
in                   at             limit                sum             
for                  and            elseif               then            
else                 do             or                   if              
unless               product        while                thru            
step                                                                     
</pre>
<p>Muitas coisas em Maxima são expressões.   Uma sequência de expressões
pode ser feita dentro de uma expressão maior através da separação dessas através de vírgulas e
colocando parêntesis em torno dela.   Isso é similar ao <b>C</b>
<i>expressão com vírgula</i>.
</p>
<pre class="example">(%i1) x: 3$
(%i2) (x: x+1, x: x^2);
(%o2)                          16
(%i3) (if (x &gt; 17) then 2 else 4);
(%o3)                           4
(%i4) (if (x &gt; 17) then x: 2 else y: 4, y+x);
(%o4)                          20
</pre>
<p>Mesmo ciclos em Maxima são expressões, embora o valor de retorno desses
ciclos não seja muito útil (eles retornam sempre <code>done</code>).
</p>
<pre class="example">(%i1) y: (x: 1, for i from 1 thru 10 do (x: x*i))$
(%i2) y;
(%o2)                         done
</pre>
<p>enquanto que o que realmente queira seja provavelmente incluir um
terceiro termo na <i>expressão com vírgula</i> que fornece
de volta o valor actualizado.
</p>
<pre class="example">(%i3) y: (x: 1, for i from 1 thru 10 do (x: x*i), x)$
(%i4) y;
(%o4)                        3628800
</pre>


<hr size="6">
<a name="Complexo"></a>
<a name="SEC22"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC21" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC23" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.2 Complexo </h2>
<p>Uma expressão complexa é especificada no Maxima através da adição da
parte real da expressão a <code>%i</code> vezes a parte imaginária.  Dessa forma as
raízes da equação <code>x^2 - 4*x + 13 = 0</code> são <code>2 + 3*%i</code> e <code>2 - 3*%i</code>.  Note que
produtos de simplificação de expressões complexas podem ser efetuadas através da
expansão do produto.  Simplificação de quocientes, raízes, e outras
funções de expressões complexas podem usualmente serem realizadas através do uso
das funções <code>realpart</code>, <code>imagpart</code>, <code>rectform</code>, <code>polarform</code>, <code>abs</code>, <code>carg</code>.
</p>
<hr size="6">
<a name="Substantivos-e-Verbos"></a>
<a name="SEC23"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC22" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC24" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.3 Substantivos e Verbos </h2>
<p>Maxima distingue entre operadores que são &quot;substantivos&quot; e operadores que são &quot;verbos&quot;.
Um verbo é um operador que pode ser executado.
Um substantivo é um operador que aparece como um símbolo em uma expressão, sem ser executado.
Por padrão, nomes de função são verbos.
Um verbo pode ser mudado em um substantivo através da adição de um apóstrofo no início do nome da função
ou aplicando a função <code>nounify</code>.
Um substantivo pode ser mudado em um verbo através da aplicação da função <code>verbify</code>.
O sinalizador de avaliação <code>nouns</code> faz com que <code>ev</code> avalie substantivos em uma expressão.
</p>
<p>A forma verbal é distinguida através de
um sinal de dólar <code>$</code> no início do símbolo Lisp correspondente.
De forma oposta,
a forma substantiva é distinguida através de 
um sinal de <code>%</code> no início do símbolo Lisp correspondente.
Alguns substantivos possuem propriedades especiais de exibição, tais como <code>'integrate</code> e <code>'derivative</code>
(retornado por <code>diff</code>), mas muitos não.
Por padrão, as formas substantiva e verbal de uma função são idênticas quando mostradas.
O sinalizador global <code>noundisp</code> faz com que Maxima mostre substantivos com um apóstrofo no início <code>'</code>.
</p>
<p>Veja também <code>noun</code>, <code>nouns</code>, <code>nounify</code>, e <code>verbify</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) foo (x) := x^2;
                                     2
(%o1)                     foo(x) := x
(%i2) foo (42);
(%o2)                         1764
(%i3) 'foo (42);
(%o3)                        foo(42)
(%i4) 'foo (42), nouns;
(%o4)                         1764
(%i5) declare (bar, noun);
(%o5)                         done
(%i6) bar (x) := x/17;
                                     x
(%o6)                    ''bar(x) := --
                                     17
(%i7) bar (52);
(%o7)                        bar(52)
(%i8) bar (52), nouns;
                               52
(%o8)                          --
                               17
(%i9) integrate (1/x, x, 1, 42);
(%o9)                        log(42)
(%i10) 'integrate (1/x, x, 1, 42);
                             42
                            /
                            [   1
(%o10)                      I   - dx
                            ]   x
                            /
                             1
(%i11) ev (%, nouns);
(%o11)                       log(42)
</pre>
<hr size="6">
<a name="Identificadores"></a>
<a name="SEC24"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC23" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.4 Identificadores </h2>
<p>Identificadores do Maxima podem compreender caracteres alfabéticos,
mais os numerais de 0 a 9,
mais qualquer caractere especial precedido por um caractere contra-barra <code>\</code>.
</p>
<p>Um numeral pode ser o primeiro caractere de um identificador
se esse numeral for precedido por uma contra-barra.
Numerais que forem o segundo ou o último caractere não precisam ser precedidos por uma contra barra.
</p>
<p>Caracteres podem ser declarados para serem alfabéticos por meio da função <code>declare</code>.
Se então declarados alfabéticos, eles não precisam serem precedidos de uma contrabarra em um identificador.
Os caracteres alfabéticos vão inicialmente 
de <code>A</code> a <code>Z</code>, de <code>a</code> a <code>z</code>, <code>%</code>, e <code>_</code>.
</p>
<p>Maxima é sensível à caixa . Os identificadores <code>algumacoisa</code>, <code>ALGUMACOISA</code>, e <code>Algumacoisa</code> são distintos.
Veja <em>Lisp e Maxima</em> para mais sobre esse ponto.
</p>
<p>Um identificador Maxima é um símbolo Lisp que começa com um sinal de dólar <code>$</code>.
Qualquer outro símbolo Lisp é precedido por um ponto de interrogação <code>?</code> quando aparecer no Maxima.
Veja <em>Lisp e Maxima</em> para maiores detalhes sobre esse ponto.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) %an_ordinary_identifier42;
(%o1)               %an_ordinary_identifier42
(%i2) embedded\ spaces\ in\ an\ identifier;
(%o2)           embedded spaces in an identifier
(%i3) symbolp (%);
(%o3)                         true
(%i4) [foo+bar, foo\+bar];
(%o4)                 [foo + bar, foo+bar]
(%i5) [1729, \1729];
(%o5)                     [1729, 1729]
(%i6) [symbolp (foo\+bar), symbolp (\1729)];
(%o6)                     [true, true]
(%i7) [is (foo\+bar = foo+bar), is (\1729 = 1729)];
(%o7)                    [false, false]
(%i8) baz\~quux;
(%o8)                       baz~quux
(%i9) declare (&quot;~&quot;, alphabetic);
(%o9)                         done
(%i10) baz~quux;
(%o10)                      baz~quux
(%i11) [is (foo = FOO), is (FOO = Foo), is (Foo = foo)];
(%o11)                [false, false, false]
(%i12) :lisp (defvar *my-lisp-variable* '$foo)
*MY-LISP-VARIABLE*
(%i12) ?\*my\-lisp\-variable\*;
(%o12)                         foo
</pre>
<hr size="6">
<a name="Sequ_00eancias-de-caracteres"></a>
<a name="SEC25"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC24" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.5 Sequências de caracteres </h2>

<p>Strings (sequências de caracteres) são contidas entre aspas duplas <code>&quot;</code> em entradas de dados usados pelo Maxima,
e mostradas com ou sem as aspas duplas, 
dependendo do valor escolhido para a variável global <code>stringdisp</code>.
</p>
<p>Sequências de caracteres podem conter quaisquer caracteres,
incluindo tabulações (tab), nova linha (ou fim de linha), e caracteres de retorno da cabeça de impressão (carriage return).
A sequência <code>\&quot;</code> é reconhecida com uma aspa dupla literal,
e <code>\\</code> como uma contrabarra literal.
Quando a contrabarra aparecer no final de uma linha,
a contrabarra e a terminação de linha
(ou nova linha ou retorno de carro e nova linha)
são ignorados,
de forma que a sequência de caracteres continue na próxima linha.
Nenhuma outra combinação especial de contrabarra com outro caractere é reconhecida;
quando a contrabarra aparecer antes de qualquer outro caractere que não seja <code>&quot;</code>, <code>\</code>,
ou um fim de linha, a contrabarra é ignorada.
Não exite caminho para representar um caractere especial
(tal como uma tabulação, nova linha, ou retorno da cabeça de impressão)
excepto através de encaixar o caractere literal na sequência de caracteres.
</p>
<p>Não existe tipo de caractere no Maxima;
um caractere simples é representado como uma sequência de caracteres de um único caractere.
</p>
<p>Sequências de caracteres no Maxima são implementadas como símbolos do Lisp, não como sequencias de caracteres do not Lisp;
o que pode mudar em futuras versões do Maxima.
Maxima pode mostrar sequências de caracteres do Lisp e caracteres do Lisp,
embora algumas outras operações (por exemplo, testes de igualdade) possam falhar.
</p>
<p>O pacote adicional <code>stringproc</code> contém muitas funções que trabalham com sequências de caracteres.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) s_1 : &quot;Isso é uma sequência de caracteres  do Maxima.&quot;;
(%o1)               Isso é uma sequência de caracteres  do Maxima.
(%i2) s_2 : &quot;Caracteres \&quot;aspas duplas\&quot; e contrabarras \\ encaixados em uma sequência de caracteres.&quot;;
(%o2) Caracteres &quot;aspas duplas&quot; e contrabarra \ encaixados em uma sequência de caracteres.
(%i3) s_3 : &quot;Caractere de fim de linha encaixado
nessa sequência de caracteres.&quot;;
(%o3) Caractere de fim de linha encaixado
nessa sequência de caracteres.
(%i4) s_4 : &quot;Ignore o \
caractere de \
fim de linha nessa \
sequência de caracteres.&quot;;
(%o4) Ignore o caractere de fim de linha nessa sequência de caracteres.
(%i5) stringdisp : false;
(%o5)                         false
(%i6) s_1;
(%o6)               Isso é uma sequência de caracteres  do Maxima.
(%i7) stringdisp : true;
(%o7)                         true
(%i8) s_1;
(%o8)              &quot;Isso é uma sequência de caracteres  do Maxima.&quot;
</pre>
<hr size="6">
<a name="Desigualdade"></a>
<a name="SEC26"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC25" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC27" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.6 Desigualdade </h2>
<p>Maxima tem os operadores de desigualdade <code>&lt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, <code>&gt;</code>, <code>#</code>, e <code>notequal</code>.
Veja <code>if</code> para uma descrição de expressões condicionais.
</p>
<hr size="6">
<a name="Sintaxe"></a>
<a name="SEC27"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC26" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC28" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.7 Sintaxe </h2>
<p>É possível definir novos operadores com precedência especificada,
remover a definição de operadores existentes,
ou redefinir a precedência de operadores existentes.  
Um operador pode ser unário prefixado ou unário pósfixado, binario infixado, n-ário infixado, matchfix, ou nofix.
&quot;Matchfix&quot; significa um par de símbolos que abraçam seu argumento ou seus argumentos,
e &quot;nofix&quot; significa um operador que não precisa de argumentos.
Como exemplos dos diferentes tipos de operadores, existe o seguinte.
</p>
<dl compact="compact">
<dt> unário prefixado</dt>
<dd><p>negação <code>- a</code>
</p></dd>
<dt> unário posfixado</dt>
<dd><p>factorial <code>a!</code>
</p></dd>
<dt> binário infixado</dt>
<dd><p>exponenciação <code>a^b</code>
</p></dd>
<dt> n-ário infixado</dt>
<dd><p>adição <code>a + b</code>
</p></dd>
<dt> matchfix</dt>
<dd><p>construção de lista <code>[a, b]</code>
</p></dd>
</dl>

<p>(Não existe operadores internos nofix;
para um exemplo de tal operador, veja <code>nofix</code>.)
</p>
<p>O mecanismo para definir um novo operador é directo.
Somente é necessário declarar uma função como um operador;
a função operador pode ou não estar definida previamente.
</p>
<p>Um exemplo de operadores definidos pelo utilizador é o seguinte.
Note que a chamada explícita de função <code>&quot;dd&quot; (a)</code> é equivalente a <code>dd a</code>,
da mesma forma <code>&quot;&lt;-&quot; (a, b)</code> é equivalente a <code>a &lt;- b</code>.
Note também que as funções <code>&quot;dd&quot;</code> e <code>&quot;&lt;-&quot;</code> são indefinidas nesse exemplo.
</p>
<pre class="example">(%i1) prefix (&quot;dd&quot;);
(%o1)                          dd
(%i2) dd a;
(%o2)                         dd a
(%i3) &quot;dd&quot; (a);
(%o3)                         dd a
(%i4) infix (&quot;&lt;-&quot;);
(%o4)                          &lt;-
(%i5) a &lt;- dd b;
(%o5)                      a &lt;- dd b
(%i6) &quot;&lt;-&quot; (a, &quot;dd&quot; (b));
(%o6)                      a &lt;- dd b
</pre>
<p>As funções máxima que definem novos operadores estão sumarizadas nessa tabela,
equilibrando expoente associado esquerdo (padrão) e o expoente associado direito (&quot;eae&quot; e &quot;ead&quot;, respectivamente).
(Associação de expoentes determina a precedência do operador. todavia, uma vez que os expoentes
esquerdo e direito podem ser diferentes, associação de expoentes é até certo ponto mais complicado que precedência.)
Alguma das funções de definição de operações tomam argumentos adicionais;
veja as descrições de função para maiores detalhes.
</p>
<dl compact="compact">
<dt> <code>prefixado</code></dt>
<dd><p>ead=180
</p></dd>
<dt> <code>posfixado</code></dt>
<dd><p>eae=180
</p></dd>
<dt> <code>infixado</code></dt>
<dd><p>eae=180, ead=180
</p></dd>
<dt> <code>nário</code></dt>
<dd><p>eae=180, ead=180
</p></dd>
<dt> <code>matchfix</code></dt>
<dd><p>(associação de expoentes não é aplicável)
</p></dd>
<dt> <code>nofix</code></dt>
<dd><p>(associação de expoentes não é aplicável)
</p></dd>
</dl>

<p>Para comparação,
aqui está alguns operadores internos e seus expoentes associados esquerdo e direito.
</p>
<pre class="example">Operador   eae     ead

  :        180     20 
  ::       180     20 
  :=       180     20 
  ::=      180     20 
  !        160
  !!       160
  ^        140     139 
  .        130     129 
  *        120
  /        120     120 
  +        100     100 
  -        100     134 
  =        80      80 
  #        80      80 
  &gt;        80      80 
  &gt;=       80      80 
  &lt;        80      80 
  &lt;=       80      80 
  not              70 
  and      65
  or       60
  ,        10
  $        -1
  ;        -1
</pre>
<p><code>remove</code> e <code>kill</code> removem propriedades de operador de um átomo.
<code>remove (&quot;<var>a</var>&quot;, op)</code> remove somente as propriedades de operador de <var>a</var>.
<code>kill (&quot;<var>a</var>&quot;)</code> remove todas as propriedades de <var>a</var>, incluindo as propriedades de operador.
Note que o nome do operador dever estar abraçado por aspas duplas.
</p>
<pre class="example">(%i1) infix (&quot;##&quot;);
(%o1)                          ##
(%i2) &quot;##&quot; (a, b) := a^b;
                                     b
(%o2)                     a ## b := a
(%i3) 5 ## 3;
(%o3)                          125
(%i4) remove (&quot;##&quot;, op);
(%o4)                         done
(%i5) 5 ## 3;
Incorrect syntax: # is not a prefix operator
5 ##
  ^
(%i5) &quot;##&quot; (5, 3);
(%o5)                          125
(%i6) infix (&quot;##&quot;);
(%o6)                          ##
(%i7) 5 ## 3;
(%o7)                          125
(%i8) kill (&quot;##&quot;);
(%o8)                         done
(%i9) 5 ## 3;
Incorrect syntax: # is not a prefix operator
5 ##
  ^
(%i9) &quot;##&quot; (5, 3);
(%o9)                       ##(5, 3)
</pre>
<hr size="6">
<a name="Defini_00e7_00f5es-para-Express_00f5es"></a>
<a name="SEC28"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC27" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.8 Definições para Expressões </h2>

<dl>
<dt><u>Função:</u> <b>at</b><i> (<var>expr</var>, [<var>eqn_1</var>, ..., <var>eqn_n</var>])</i>
<a name="IDX134"></a>
</dt>
<dt><u>Função:</u> <b>at</b><i> (<var>expr</var>, <var>eqn</var>)</i>
<a name="IDX135"></a>
</dt>
<dd><p>Avalia a expressão <var>expr</var> com
as variáveis assumindo os valores como especificado para elas na lista de
equações <code>[<var>eqn_1</var>, ..., <var>eqn_n</var>]</code> ou a equação simples <var>eqn</var>.
</p>
<p>Se uma subexpressão depender de qualquer das variáveis para a qual um valor foi especificado
mas não existe <code>atvalue</code> especificado e essa subexpressão não pode ser avaliada de outra forma,
então uma forma substantiva de <code>at</code> é retornada que mostra em uma forma bidimensional.
</p>
<p><code>at</code> realiza múltiplas substituições em série, não em paralelo.
</p>
<p>Veja também <code>atvalue</code>.
Para outras funções que realizam substituições,
veja também <code>subst</code> e <code>ev</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x, y)^2 - u(x, y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>box</b><i> (<var>expr</var>)</i>
<a name="IDX136"></a>
</dt>
<dt><u>Função:</u> <b>box</b><i> (<var>expr</var>, <var>a</var>)</i>
<a name="IDX137"></a>
</dt>
<dd><p>Retorna <var>expr</var> dentro de uma caixa.
O valor de retorno é uma expressão com <code>box</code> como o operador e <var>expr</var> como o argumento.
Uma caixa é desenhada sobre a tela quando <code>display2d</code> for <code>true</code>.
</p>
<p><code>box (<var>expr</var>, <var>a</var>)</code>
Empacota <var>expr</var> em uma caixa rotulada pelo símbolo <var>a</var>.
O rótulo é truncado se for maior que a largura da caixa.
</p>
<p><code>box</code> avalia seu argumento.
Todavia, uma expressão dentro de uma caixa não avalia para seu conteúdo,
então expressões dentro de caixas são efectivamente excluídas de cálculos.
</p>
<p><code>boxchar</code> é o caractere usado para desenhar a caixa em <code>box</code>
e nas funções <code>dpart</code> e <code>lpart</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%i7) boxchar: &quot;-&quot;;
(%o7)                           -
(%i8) box (sin(x) + cos(y));
                        -----------------
(%o8)                   -cos(y) + sin(x)-
                        -----------------
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>boxchar</b>
<a name="IDX138"></a>
</dt>
<dd><p>Valor por omissão: <code>&quot;</code>
</p>
<p><code>boxchar</code> é o caractere usado para desenhar a caixa por <code>box</code>
e nas funções <code>dpart</code> e <code>lpart</code>.
</p>
<p>Todas as caixas em uma expressão são desenhadas com o valor actual
de <code>boxchar</code>; o caractere de desenho não é armazenado com a
expressão de caixa. Isso quer dizer que se desenhar uma caixa e em
seguida mudar o caracter de desenho a caixa anteriormente desenhada
será redesenhada com o caracter mudado caso isso seja solicitado.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>carg</b><i> (<var>z</var>)</i>
<a name="IDX139"></a>
</dt>
<dd><p>Retorna o argumento complexo de <var>z</var>.
O argumento complexo é um ângulo <code>theta</code> no intervalo de <code>(-%pi, %pi]</code>
tal que <code>r exp (theta %i) = <var>z</var></code> onde <code>r</code> é o módulo de <var>z</var>.
</p>
<p><code>carg</code> é uma função computacional,
não uma função de simplificação.
</p>
<p><code>carg</code> ignora a declaração <code>declare (<var>x</var>, complex)</code>,
e trata <var>x</var> como uma variável real.
Isso é um erro. </p>
<p>Veja também <code>abs</code> (módulo de número complexo), <code>polarform</code>, <code>rectform</code>,
<code>realpart</code>, e <code>imagpart</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) carg (1);
(%o1)                           0
(%i2) carg (1 + %i);
                               %pi
(%o2)                          ---
                                4
(%i3) carg (exp (%i));
(%o3)                           1
(%i4) carg (exp (%pi * %i));
(%o4)                          %pi
(%i5) carg (exp (3/2 * %pi * %i));
                                %pi
(%o5)                         - ---
                                 2
(%i6) carg (17 * exp (2 * %i));
(%o6)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Opereador especial:</u> <b>constant</b>
<a name="IDX140"></a>
</dt>
<dd><p><code>declare (<var>a</var>, constant)</code> declara <var>a</var> para ser uma constante.
Veja <code>declare</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>constantp</b><i> (<var>expr</var>)</i>
<a name="IDX141"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for uma expressão constante,
de outra forma retorna <code>false</code>.
</p>
<p>Uma expressão é considerada uma expressão constante se seus argumentos forem
números (incluindo números racionais, como mostrado com <code>/R/</code>),
constantes simbólicas como <code>%pi</code>, <code>%e</code>, e <code>%i</code>,
variáveis associadas a uma constante ou constante declarada através de <code>declare</code>,
ou funções cujos argumentos forem constantes.
</p>
<p><code>constantp</code> avalia seus argumentos.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) constantp (7 * sin(2));
(%o1)                                true
(%i2) constantp (rat (17/29));
(%o2)                                true
(%i3) constantp (%pi * sin(%e));
(%o3)                                true
(%i4) constantp (exp (x));
(%o4)                                false
(%i5) declare (x, constant);
(%o5)                                done
(%i6) constantp (exp (x));
(%o6)                                true
(%i7) constantp (foo (x) + bar (%e) + baz (2));
(%o7)                                false
(%i8) 
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>declare</b><i> (<var>a_1</var>, <var>p_1</var>, <var>a_2</var>, <var>p_2</var>, ...)</i>
<a name="IDX142"></a>
</dt>
<dd><p>Atribui aos átomos ou lista de átomos <var>a_i</var> a propriedade ou lista de propriedades <var>p_i</var>.
Quando <var>a_i</var> e/ou <var>p_i</var> forem listas,
cada um dos átomos recebe todas as propriedades.
</p>
<p><code>declare</code> não avalia seus argumentos.
<code>declare</code> sempre retorna <code>done</code>.
</p>
<p>Como colocado na descrição para cada sinalizador de declaração,
para alguns sinalizadores
<code>featurep(<var>objecto</var>, <var>recurso</var>)</code>
retorna <code>true</code> se <var>objecto</var> tiver sido declarado para ter <var>recurso</var>.
Todavia, <code>featurep</code> não reconhece alguns sinalizadores; isso é um erro.
</p>
<p>Veja também <code>features</code>.
</p>
<p><code>declare</code> reconhece as seguintes propriedades:
</p>
<dl compact="compact">
<dt> <code>evfun</code></dt>
<dd><p>Torna <var>a_i</var> conhecido para <code>ev</code> de forma que a função nomeada por <var>a_i</var>
é aplicada quando <var>a_i</var> aparece como um sinalizador argumento de <code>ev</code>.
Veja <code>evfun</code>.
</p>
</dd>
<dt> <code>evflag</code></dt>
<dd><p>Torna <var>a_i</var> conhecido para a função <code>ev</code> de forma que <var>a_i</var> é associado a <code>true</code>
durante a execução de <code>ev</code> quando <var>a_i</var> aparece como um sinalizador argumento de <code>ev</code>.
Veja <code>evflag</code>.
</p>
 

</dd>
<dt> <code>bindtest</code></dt>
<dd><p>Diz ao Maxima para disparar um erro quando <var>a_i</var> for avaliado como sendo livre de associação.
</p>
</dd>
<dt> <code>noun</code></dt>
<dd><p>Diz ao Maxima para passar <var>a_i</var> como um substantivo. 
O efeito disso é substituir intâncias de <var>a_i</var> com <code>'<var>a_i</var></code>
ou <code>nounify(<var>a_i</var>)</code>, ependendo do contexto.
</p>
</dd>
<dt> <code>constant</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma constante simbólica.
</p>
</dd>
<dt> <code>scalar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma variável escalar.
</p>
</dd>
<dt> <code>nonscalar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma variável não escalar.
The usual application is to declare a variable as a symbolic vector or matrix.
</p>
</dd>
<dt> <code>mainvar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma &quot;variável principal&quot; (<code>mainvar</code>).
<code>ordergreatp</code> determina a ordenação de átomos como segue:
</p>
<p>(variáveis principais) &gt; (outras variáveis) &gt; (variáveis escalares) &gt; (constantes) &gt; (números)
</p>
</dd>
<dt> <code>alphabetic</code></dt>
<dd><p>Diz ao Maxima para reconhecer todos os caracteres em <var>a_i</var> (que deve ser uma sequência de caracteres) como caractere alfabético.
</p>
</dd>
<dt> <code>feature</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como nome de um recurso.
Other atoms may then be declared to have the <var>a_i</var> property.
</p>
</dd>
<dt> <code>rassociative</code>, <code>lassociative</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma funcão associativa a direita ou associativa a esquerda.
</p>
</dd>
<dt> <code>nary</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma função n-ária (com muitos argumentos).
</p>
<p>A declaração <code>nary</code> não tem o mesmo objectivo que uma chamada à função <code>nary</code>.
O único efeito de <code>declare(foo, nary)</code> é para instruir o simplificador do Maxima
a melhorar as próximas expressões,
por exemplo, para simplificar <code>foo(x, foo(y, z))</code> para <code>foo(x, y, z)</code>.
</p>
</dd>
<dt> <code>symmetric</code>, <code>antisymmetric</code>, <code>commutative</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma função simétrica ou antisimétrica.
<code>commutative</code> é o mesmo que <code>symmetric</code>.
</p>
</dd>
<dt> <code>oddfun</code>, <code>evenfun</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma função par ou uma função ímpar.
</p> 
</dd>
<dt> <code>outative</code></dt>
<dd><p>Diz ao Maxima para simplificar expressões <var>a_i</var>
colocando factores constantes em evidência no primeiro argumento.
</p>
<p>Quando <var>a_i</var> tiver um argumento,
um factor é onsiderado constante se for um literal ou se for declarado como sendo constante.
</p>
<p>Quando <var>a_i</var> tiver dois ou mais argumentos,
um factor é considerado constante
se o segundo argumento for um símbolo
e o factor estiver livre do segundo argumento.
</p>
</dd>
<dt> <code>multiplicative</code></dt>
<dd><p>Diz ao Maxima para simplificar expressões do tipo <var>a_i</var>
através da substituição <code><var>a_i</var>(x * y * z * ...)</code> <code>--&gt;</code>
<code><var>a_i</var>(x) * <var>a_i</var>(y) * <var>a_i</var>(z) * ...</code>.
A substituição é realizada no primeiro argumento somente.
</p>
</dd>
<dt> <code>additive</code></dt>
<dd><p>Diz ao Maxima para simplificar expressões do tipo <var>a_i</var>
através da substituição <code><var>a_i</var>(x + y + z + ...)</code> <code>--&gt;</code>
<code><var>a_i</var>(x) + <var>a_i</var>(y) + <var>a_i</var>(z) + ...</code>.
A substituição é realizada no primeiro argumento somente.
</p>
</dd>
<dt> <code>linear</code></dt>
<dd><p>Equivalente a declarar <var>a_i</var> ao mesmo tempo <code>outative</code> e <code>additive</code>.
</p>
 
</dd>
<dt> <code>integer</code>, <code>noninteger</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como como uma variável inteira ou como uma variável não inteira.
</p> 
<p>Maxima reconhece os seguintes recursos de objectos:
</p>
</dd>
<dt> <code>even</code>, <code>odd</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma variável inteira par ou como uma variável inteira ímpar.
</p>
</dd>
<dt> <code>rational</code>, <code>irrational</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma variável real e racional ou como uma variável real e irracional.
</p>
</dd>
<dt> <code>real</code>, <code>imaginary</code>, <code>complex</code></dt>
<dd><p>Dia ao Maxima para reconhecer <var>a_i</var> como uma variável real, imaginária pura ou complexa.
</p> 
</dd>
<dt> <code>increasing</code>, <code>decreasing</code></dt>
<dd><p>Dia ao Maxima para reconhecer <var>a_i</var> como uma função de incremento ou decremento.
</p>
</dd>
<dt> <code>posfun</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma função positiva.
</p>
</dd>
<dt> <code>integervalued</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma função de valores inteiros.
</p>
</dd>
</dl>

<p>Exemplos:
</p>
<p>Declarações <code>evfun</code> e <code>evflag</code>.
</p><pre class="example">(%i1) declare (expand, evfun);
(%o1)                         done
(%i2) (a + b)^3;
                                   3
(%o2)                       (b + a)
(%i3) (a + b)^3, expand;
                     3        2      2      3
(%o3)               b  + 3 a b  + 3 a  b + a
(%i4) declare (demoivre, evflag);
(%o4)                         done
(%i5) exp (a + b*%i);
                             %i b + a
(%o5)                      %e
(%i6) exp (a + b*%i), demoivre;
                      a
(%o6)               %e  (%i sin(b) + cos(b))
</pre>
<p>Declaração <code>bindtest</code>.
</p><pre class="example">(%i1) aa + bb;
(%o1)                        bb + aa
(%i2) declare (aa, bindtest);
(%o2)                         done
(%i3) aa + bb;
aa unbound variable
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i4) aa : 1234;
(%o4)                         1234
(%i5) aa + bb;
(%o5)                       bb + 1234
</pre>
<p>Declaração <code>noun</code>.
</p><pre class="example">(%i1) factor (12345678);
                             2
(%o1)                     2 3  47 14593
(%i2) declare (factor, noun);
(%o2)                         done
(%i3) factor (12345678);
(%o3)                   factor(12345678)
(%i4) ''%, nouns;
                             2
(%o4)                     2 3  47 14593
</pre>
<p>Declarações <code>constant</code>, <code>scalar</code>, <code>nonscalar</code>, e <code>mainvar</code>.
</p>
<p>Declaração <code>alphabetic</code>.
</p><pre class="example">(%i1) xx\~yy\`\@ : 1729;
(%o1)                         1729
(%i2) declare (&quot;~`@&quot;, alphabetic);
(%o2)                         done
(%i3) xx~yy`@ + @yy`xx + `xx@@yy~;
(%o3)               `xx@@yy~ + @yy`xx + 1729
(%i4) listofvars (%);
(%o4)                  [@yy`xx, `xx@@yy~]
</pre>
<p>Declaração <code>feature</code>.
</p><pre class="example">(%i1) declare (FOO, feature);
(%o1)                         done
(%i2) declare (x, FOO);
(%o2)                         done
(%i3) featurep (x, FOO);
(%o3)                         true
</pre>
<p>Declarações <code>rassociative</code> e <code>lassociative</code>.
</p>
<p>Declaração <code>nary</code>.
</p><pre class="example">(%i1) H (H (a, b), H (c, H (d, e)));
(%o1)               H(H(a, b), H(c, H(d, e)))
(%i2) declare (H, nary);
(%o2)                         done
(%i3) H (H (a, b), H (c, H (d, e)));
(%o3)                   H(a, b, c, d, e)
</pre>
<p>Declarações <code>symmetric</code> e <code>antisymmetric</code>.
</p><pre class="example">(%i1) S (b, a);
(%o1)                        S(b, a)
(%i2) declare (S, symmetric);
(%o2)                         done
(%i3) S (b, a);
(%o3)                        S(a, b)
(%i4) S (a, c, e, d, b);
(%o4)                   S(a, b, c, d, e)
(%i5) T (b, a);
(%o5)                        T(b, a)
(%i6) declare (T, antisymmetric);
(%o6)                         done
(%i7) T (b, a);
(%o7)                       - T(a, b)
(%i8) T (a, c, e, d, b);
(%o8)                   T(a, b, c, d, e)
</pre>
<p>Declarações <code>oddfun</code> e <code>evenfun</code>.
</p><pre class="example">(%i1) o (- u) + o (u);
(%o1)                     o(u) + o(- u)
(%i2) declare (o, oddfun);
(%o2)                         done
(%i3) o (- u) + o (u);
(%o3)                           0
(%i4) e (- u) - e (u);
(%o4)                     e(- u) - e(u)
(%i5) declare (e, evenfun);
(%o5)                         done
(%i6) e (- u) - e (u);
(%o6)                           0
</pre>
<p>Declaração <code>outative</code>.
</p><pre class="example">(%i1) F1 (100 * x);
(%o1)                       F1(100 x)
(%i2) declare (F1, outative);
(%o2)                         done
(%i3) F1 (100 * x);
(%o3)                       100 F1(x)
(%i4) declare (zz, constant);
(%o4)                         done
(%i5) F1 (zz * y);
(%o5)                       zz F1(y)
</pre>
<p>Declaração <code>multiplicative</code>.
</p><pre class="example">(%i1) F2 (a * b * c);
(%o1)                       F2(a b c)
(%i2) declare (F2, multiplicative);
(%o2)                         done
(%i3) F2 (a * b * c);
(%o3)                   F2(a) F2(b) F2(c)
</pre>
<p>Declaração <code>additive</code>.
</p><pre class="example">(%i1) F3 (a + b + c);
(%o1)                     F3(c + b + a)
(%i2) declare (F3, additive);
(%o2)                         done
(%i3) F3 (a + b + c);
(%o3)                 F3(c) + F3(b) + F3(a)
</pre>
<p>Declaração <code>linear</code>.
</p><pre class="example">(%i1) 'sum (F(k) + G(k), k, 1, inf);
                       inf
                       ====
                       \
(%o1)                   &gt;    (G(k) + F(k))
                       /
                       ====
                       k = 1
(%i2) declare (nounify (sum), linear);
(%o2)                         done
(%i3) 'sum (F(k) + G(k), k, 1, inf);
                     inf          inf
                     ====         ====
                     \            \
(%o3)                 &gt;    G(k) +  &gt;    F(k)
                     /            /
                     ====         ====
                     k = 1        k = 1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>disolate</b><i> (<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</i>
<a name="IDX143"></a>
</dt>
<dd><p>é similar a <code>isolate (<var>expr</var>, <var>x</var>)</code>
excepto que essa função habilita ao utilizador isolar
mais que uma variável simultâneamente.  Isso pode ser útil, por
exemplo, se se tiver tentado mudar variáveis em uma integração
múltipla, e em mudança de variável envolvendo duas ou mais das
variáveis de integração.  Essa função é chamada automaticamente de
<tt>`simplification/disol.mac'</tt>.  Uma demostração está disponível através de
<code>demo(&quot;disol&quot;)$</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>dispform</b><i> (<var>expr</var>)</i>
<a name="IDX144"></a>
</dt>
<dd><p>Retorna a representação externa de <var>expr</var> com relação a seu
principal operador.  Isso pode ser útil em conjunção com <code>part</code> que
também lida com a representação externa.  Suponha que <var>expr</var> seja -A .
Então a representação interna de <var>expr</var> é  &quot;*&quot;(-1,A), enquanto que
a representação externa é &quot;-&quot;(A). <code>dispform (<var>expr</var>, all)</code> converte a
expressão inteira (não apenas o nível mais alto) para o formato externo.  Por
exemplo, se <code>expr: sin (sqrt (x))</code>, então <code>freeof (sqrt, expr)</code> e
<code>freeof (sqrt, dispform (expr))</code> fornece <code>true</code>, enquanto
<code>freeof (sqrt, dispform (expr, all))</code> fornece <code>false</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>distrib</b><i> (<var>expr</var>)</i>
<a name="IDX145"></a>
</dt>
<dd><p>Distribue adições sobre produtos.  <code>distrib</code> difere de <code>expand</code>
no facto de que <code>distrib</code> trabalha em somente no nível mais alto de uma expressão, i.e., <code>distrib</code> não
é recursiva e <code>distrib</code> é mais rápida que <code>expand</code>.  <code>distrib</code> difere de <code>multthru</code> no
que <code>distrib</code> expande todas as adições naquele nível.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) distrib ((a+b) * (c+d));
(%o1)                 b d + a d + b c + a c
(%i2) multthru ((a+b) * (c+d));
(%o2)                 (b + a) d + (b + a) c
(%i3) distrib (1/((a+b) * (c+d)));
                                1
(%o3)                    ---------------
                         (b + a) (d + c)
(%i4) expand (1/((a+b) * (c+d)), 1, 0);
                                1
(%o4)                 ---------------------
                      b d + a d + b c + a c
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>dpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX146"></a>
</dt>
<dd><p>Selecciona a mesma subexpressão que <code>part</code>, mas
em lugar de apenas retornar aquela subexpressão como seu valor, isso retorna
a expressão completa com a subexpressão seleccionada mostrada dentro
de uma caixa.  A caixa é actualmente parte da expressão.
</p>
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>exp</b><i> (<var>x</var>)</i>
<a name="IDX147"></a>
</dt>
<dd><p>Representa função exponencial.  
Instâncias de <code>exp (<var>x</var>)</code> em uma entrada são simplificadas para <code>%e^<var>x</var></code>;
<code>exp</code> não aparece em expressões simplificadas.
</p>
<p><code>demoivre</code> se <code>true</code> faz com que <code>%e^(a + b %i)</code> simplificar para
<code>%e^(a (cos(b) + %i sin(b)))</code> se <code>b</code> for livre de <code>%i</code>. veja <code>demoivre</code>.
</p>
<p><code>%emode</code>, quando <code>true</code>, 
faz com que <code>%e^(%pi %i x)</code> seja simplificado. Veja <code>%emode</code>.
</p>
<p><code>%enumer</code>, quando <code>true</code> faz com que <code>%e</code> seja substituído por
2.718...  quando <code>numer</code> for <code>true</code>. Veja <code>%enumer</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>%emode</b>
<a name="IDX148"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>%emode</code> for <code>true</code>,
<code>%e^(%pi %i x)</code> é simplificado como
segue.
</p>
<p><code>%e^(%pi %i x)</code> simplifica para <code>cos (%pi x) + %i sin (%pi x)</code> se <code>x</code> for um inteiro ou
um múltiplo de 1/2, 1/3, 1/4, ou 1/6, e então é adicionalmente simplificado.
</p>
<p>Para outro <code>x</code> numérico,
<code>%e^(%pi %i x)</code> simplifica para <code>%e^(%pi %i y)</code> onde <code>y</code> é <code>x - 2 k</code>
para algum inteiro <code>k</code> tal que <code>abs(y) &lt; 1</code>.  
</p>
<p>Quando <code>%emode</code> for <code>false</code>, nenhuma
simplificação adicional de <code>%e^(%pi %i x)</code> é realizada.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>%enumer</b>
<a name="IDX149"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>%enumer</code> for <code>true</code>,
<code>%e</code> é substituido por seu valor numérico
2.718...  mesmo que <code>numer</code> seja <code>true</code>. 
</p>
<p>Quando <code>%enumer</code> for <code>false</code>, essa substituição é realizada
somente se o expoente em <code>%e^x</code> avaliar para um número.
</p>
<p>Veja também <code>ev</code> e <code>numer</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>exptisolate</b>
<a name="IDX150"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p><code>exptisolate</code>, quando <code>true</code>, faz com que <code>isolate (expr, var)</code>
examine expoentes de átomos (tais como <code>%e</code>) que contenham <code>var</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>exptsubst</b>
<a name="IDX151"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p><code>exptsubst</code>, quando <code>true</code>, permite substituições tais como <code>y</code>
para <code>%e^x</code> em <code>%e^(a x)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>freeof</b><i> (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</i>
<a name="IDX152"></a>
</dt>
<dd><p><code>freeof (<var>x_1</var>, <var>expr</var>)</code>
Retorna <code>true</code>
se nenhuma subexpressão de <var>expr</var> for igual a <var>x_1</var>
ou se <var>x_1</var> ocorrer somente uma variável que não tenha associação fora da expressão <var>expr</var>,
e retorna <code>false</code> de outra forma.
</p>
<p><code>freeof (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code>
é equivalente a <code>freeof (<var>x_1</var>, <var>expr</var>) and ... and freeof (<var>x_n</var>, <var>expr</var>)</code>.
</p>
<p>Os argumentos <var>x_1</var>, ..., <var>x_n</var> 
podem ser nomes de funções e variáveis, nomes subscritos,
operadores (empacotados em aspas duplas), ou expressões gerais.
<code>freeof</code> avalia seus argumentos.
</p>
<p><code>freeof</code> opera somente sobre <var>expr</var> como isso representa (após simplificação e avaliação) e
não tenta determinar se alguma expressão equivalente pode fornecer um resultado diferente.
Em particular, simplificação pode retornar uma expressão equivalente mas diferente que compreende
alguns diferentes elementos da forma original de <var>expr</var>.
</p>
<p>Uma variável é uma variável dummy em uma expressão se não tiver associação fora da expressão.
Variáveis dummy recoreconhecidas através de <code>freeof</code> são
o índice de um somatório ou produtório, o limite da variável em <code>limit</code>,
a variável de integração na forma de integral definida de <code>integrate</code>,
a variável original em <code>laplace</code>,
variáveis formais em expressoes <code>at</code>,
e argumentos em expressões <code>lambda</code>.
Variáveis locais em <code>block</code> não são reconhecidas por <code>freeof</code> como variáveis dummy;
isso é um bug.
</p>
<p>A forma indefinida de <code>integrate</code> <i>not</i> é livre de suas variáveis de integração.
</p>
<ul>
<li>
Argumentos são nomes de funções, variáveis, nomes subscritos, operadores, e expressões.
<code>freeof (a, b, expr)</code> é equivalente a
<code>freeof (a, expr) and freeof (b, expr)</code>.

<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
(%i2) freeof (z, expr);
(%o2)                         false
(%i3) freeof (cos, expr);
(%o3)                         false
(%i4) freeof (a[1], expr);
(%o4)                         false
(%i5) freeof (cos (a[1]), expr);
(%o5)                         false
(%i6) freeof (b^(c+d), expr);
(%o6)                         false
(%i7) freeof (&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof (w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre>
</li><li>
<code>freeof</code> avalia seus argumentos.

<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof (c, expr);
(%o3)                         false
</pre>
</li><li>
<code>freeof</code> não considera expressões equivalentes.
Simplificação pode retornar uma expressão equivalente mas diferente.

<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand (expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof (a+b, %);
(%o3)                         true
(%i4) freeof (a+b, expr);
(%o4)                         false
(%i5) exp (x);
                                 x
(%o5)                          %e
(%i6) freeof (exp, exp (x));
(%o6)                         true
</pre>
</li><li> Um somatório ou uma integral definida está livre de uma variável dummy.
Uma integral indefinida não é livre de suas variáveis de integração.

<pre class="example">(%i1) freeof (i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof (x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof (x, 'integrate (x^2, x));
(%o3)                         false
</pre></li></ul>

</dd></dl>

<dl>
<dt><u>Função:</u> <b>genfact</b><i> (<var>x</var>, <var>y</var>, <var>z</var>)</i>
<a name="IDX153"></a>
</dt>
<dd><p>Retorna o factorial generalizado, definido como
<code>x (x-z) (x - 2 z) ... (x - (y - 1) z)</code>.  Dessa forma, para integral <var>x</var>,
<code>genfact (x, x, 1) = x!</code> e <code>genfact (x, x/2, 2) = x!!</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>imagpart</b><i> (<var>expr</var>)</i>
<a name="IDX154"></a>
</dt>
<dd><p>Retorna a parte imaginária da expressão <var>expr</var>.
</p>
<p><code>imagpart</code> é uma função computacional,
não uma função de simplificação.
</p>
<p>Veja também <code>abs</code>, <code>carg</code>, <code>polarform</code>, <code>rectform</code>,
e <code>realpart</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>infix</b><i> (<var>op</var>)</i>
<a name="IDX155"></a>
</dt>
<dt><u>Função:</u> <b>infix</b><i> (<var>op</var>, <var>lbp</var>, <var>rbp</var>)</i>
<a name="IDX156"></a>
</dt>
<dt><u>Função:</u> <b>infix</b><i> (<var>op</var>, <var>lbp</var>, <var>rbp</var>, <var>lpos</var>, <var>rpos</var>, <var>pos</var>)</i>
<a name="IDX157"></a>
</dt>
<dd><p>Declara <var>op</var> para ser um operador infixo.
Um operador infixo é uma função de dois argumentos,
com o nome da função escrito entre os argumentos.
Por exemplo, o operador de subtração <code>-</code> é um operador infixo.
</p>
<p><code>infix (<var>op</var>)</code> declara <var>op</var> para ser um operador infixo
com expoentes associados padrão (esquerdo e direito ambos iguais a 180)
e podendo ser qualquer entre prefixado, infixado, posfixado, nário, 
matchfix e nofix (esquerdo e direito ambos iguais a <code>any</code>).
</p>
<p><code>infix (<var>op</var>, <var>lbp</var>, <var>rbp</var>)</code> declara <var>op</var> para ser um operador infixo
com expoentes associados esquerdo e directio equilibrados
e podendo ser qualquer entre prefixado, infixado, posfixado, nário, 
matchfix e nofix (esquerdo e direito ambos iguais a <code>any</code>).
</p>
<p><code>infix (<var>op</var>, <var>lbp</var>, <var>rbp</var>, <var>lpos</var>, <var>rpos</var>, <var>pos</var>)</code>
declara <var>op</var> para ser um operdor infixo
com expoentes associados padrão e podendo ser um entre 
prefixado, infixado, posfixado, nário, matchfix e nofix.
</p>
<p>A precedência de <var>op</var> com relação a outros operadores
derivam dos expoentes associados directiro e esquerdo dos operadores em questão.
Se os expoentes associados esquerdo e direito de <var>op</var> forem ambos maiores
que o expoente associado esquerdo e o direito de algum outro operador,
então <var>op</var> tem prededência sobre o outro operador.
Se os expoentes associados não forem ambos maior ou menor,
alguma relação mais complicada ocorre.
</p>
<p>A associatividade de <var>op</var> depende de seus expoentes associados.
Maior expoente associado esquerdo (<var>eae</var>) implica uma instância de
<var>op</var> é avaliadas antes de outros operadores para sua esquerda em uma expressão,
enquanto maior expoente associado direito (<var>ead</var>) implica uma instância de
<var>op</var> é avaliada antes de outros operadores para sua direita em uma expressão.
Dessa forma maior <var>eae</var> torna <var>op</var> associativo à direita,
enquanto maior <var>ead</var> torna <var>op</var> associativa à esquerda.
Se <var>eae</var> for igual a <var>ead</var>, <var>op</var> é associativa à esquerda.
</p>
<p>Veja também <code>Syntax</code>.
</p>
<p>Exemplos:
</p>
<p>Se os expoentes associados esquerdo e direito de <var>op</var> forem ambos maiores
que os expoentes associados à direita e à esquerda de algum outro operador,
então <var>op</var> tem precedência sobre o outro operador.
</p>
<pre class="example">(%i1) :lisp (get '$+ 'lbp)
100
(%i1) :lisp (get '$+ 'rbp)
100
(%i1) infix (&quot;##&quot;, 101, 101);
(%o1)                          ##
(%i2) &quot;##&quot;(a, b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;);
(%o2)       (a ## b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;)
(%i3) 1 + a ## b + 2;
(%o3)                       (a,b) + 3
(%i4) infix (&quot;##&quot;, 99, 99);
(%o4)                          ##
(%i5) 1 + a ## b + 2;
(%o5)                       (a+1,b+2)
</pre>
<p>grande <var>eae</var> torna <var>op</var> associativa à direita,
enquanto grande <var>ead</var> torna <var>op</var> associativa à esquerda.
</p>
<pre class="example">(%i1) infix (&quot;##&quot;, 100, 99);
(%o1)                          ##
(%i2) &quot;##&quot;(a, b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;)$
(%i3) foo ## bar ## baz;
(%o3)                    (foo,(bar,baz))
(%i4) infix (&quot;##&quot;, 100, 101);
(%o4)                          ##
(%i5) foo ## bar ## baz;
(%o5)                    ((foo,bar),baz)
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>inflag</b>
<a name="IDX158"></a>
</dt>
<dd><p>Velor padrão: <code>false</code>
</p>
<p>Quando <code>inflag</code> for <code>true</code>, funções para extração de
partes inspecionam a forma interna de <code>expr</code>.
</p>
<p>Note que o simplificador re-organiza expressões.
Dessa forma <code>first (x + y)</code> retorna <code>x</code> se <code>inflag</code>
for <code>true</code> e <code>y</code> se <code>inflag</code> for <code>false</code>.
(<code>first (y + x)</code> fornece os mesmos resultados.)
</p>
<p>Também, escolhendo <code>inflag</code> para <code>true</code> e chamando <code>part</code> ou <code>substpart</code> é
o mesmo que chamar <code>inpart</code> ou <code>substinpart</code>.
</p>
<p>As funções afectadas pela posição do sinalizador <code>inflag</code> são:
<code>part</code>, <code>substpart</code>, <code>first</code>, <code>rest</code>, <code>last</code>, <code>length</code>,
a estrutura <code>for</code> ... <code>in</code>,
<code>map</code>, <code>fullmap</code>, <code>maplist</code>, <code>reveal</code> e <code>pickapart</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>inpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX159"></a>
</dt>
<dd><p>É similar a <code>part</code> mas trabalha sobre a representação
interna da expressão em lugar da forma de exibição e
dessa forma pode ser mais rápida uma vez que nenhuma formatação é realizada.  Cuidado deve ser tomado
com relação à ordem de subexpressões em adições e produtos
(uma vez que a ordem das variáveis na forma interna é muitas vezes diferente
daquela na forma mostrada) e no manuseio com menos unário,
subtração, e divisão (uma vez que esses operadores são removidos da
expressão). <code>part (x+y, 0)</code> ou <code>inpart (x+y, 0)</code> retorna <code>+</code>, embora com o objectivo de
referirse ao operador isso deva ser abraçado por aspas duplas.  Por exemplo
<code>... if inpart (%o9,0) = &quot;+&quot; then ...</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>isolate</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX160"></a>
</dt>
<dd><p>Retorna <var>expr</var> com subexpressões que são adições e
que não possuem <var>x</var> substituido por rótulos de expressão intermédia
(esses sendo símbolos at&ocirc;micos como <code>%t1</code>, <code>%t2</code>, ...).  Isso é muitas vezes útil
para evitar expansões desnecessárias de subexpressões que não possuam
a variável de interesse.  Uma vez que os rótulos intermédios são associados às
subexpressões eles podem todos ser substituídos de volta por avaliação da
expressão em que ocorrerem.
</p>
<p><code>exptisolate</code> (valor padrão: <code>false</code>) se <code>true</code> fará com que <code>isolate</code> examine expoentes de
átomos (como <code>%e</code>) que contenham <var>x</var>.
</p>
<p><code>isolate_wrt_times</code> se <code>true</code>, então <code>isolate</code> irá também isolar com relação a 
produtos. Veja <code>isolate_wrt_times</code>.
</p>
<p>Faça <code>example (isolate)</code> para exemplos.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>isolate_wrt_times</b>
<a name="IDX161"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>isolate_wrt_times</code> for <code>true</code>, <code>isolate</code>
irá também isolar com relação a produtos.  E.g. compare ambas as escolhas do
comutador em
</p>
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>listconstvars</b>
<a name="IDX162"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>listconstvars</code> for <code>true</code>, isso fará com que <code>listofvars</code>
inclua <code>%e</code>, <code>%pi</code>, <code>%i</code>, e quaisquer variáveis declaradas contantes na lista
seja retornado se aparecer na expressão que chamar <code>listofvars</code>.
O comportamento padrão é omitir isso.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>listdummyvars</b>
<a name="IDX163"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>listdummyvars</code> for <code>false</code>, &quot;variáveis dummy&quot; na
expressão não serão incluídas na lista retornada por <code>listofvars</code>.
(O significado de &quot;variável dummy&quot; é o mesmo que em <code>freeof</code>.
&quot;Variáveis dummy&quot; são conceitos matemáticos como o índice de um somatório ou
produtório, a variável limite, e a variável da integral definida.)
Exemplo:
</p>
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>listofvars</b><i> (<var>expr</var>)</i>
<a name="IDX164"></a>
</dt>
<dd><p>Retorna uma lista de variáveis em <var>expr</var>.
</p>
<p><code>listconstvars</code> se <code>true</code> faz com que <code>listofvars</code> inclua <code>%e</code>, <code>%pi</code>,
<code>%i</code>, e quaisquer variáveis declaradas constantes na lista é retornada se
aparecer em <var>expr</var>.  O comportamento padrão é omitir isso.
</p>
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>lfreeof</b><i> (<var>lista</var>, <var>expr</var>)</i>
<a name="IDX165"></a>
</dt>
<dd><p>Para cada um dos membros <var>m</var> de lista, chama <code>freeof (<var>m</var>, <var>expr</var>)</code>.
Retorna <code>false</code> se qualquer chamada a <code>freeof</code> for feita e <code>true</code> de outra forma.
</p></dd></dl>

<dl>
<dt><u>Função:</u> <b>lopow</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX166"></a>
</dt>
<dd><p>Retorna o menor expoente de <var>x</var> que explicitamente aparecer em
<var>expr</var>.  Dessa forma
</p>
<pre class="example">(%i1) lopow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       min(a, 2)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>lpart</b><i> (<var>rótulo</var>, <var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX167"></a>
</dt>
<dd><p>é similar a <code>dpart</code> mas usa uma caixa rotulada. Uma caixa
rotulada é similar à que é produzida por <code>dpart</code> mas a
produzida por <code>lpart</code> tem o nome na linha do topo.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>multthru</b><i> (<var>expr</var>)</i>
<a name="IDX168"></a>
</dt>
<dt><u>Função:</u> <b>multthru</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX169"></a>
</dt>
<dd><p>Multiplica um factor (que pode ser uma adição) de <var>expr</var> pelos
outros factores de <var>expr</var>.  Isto é, <var>expr</var> é <code><var>f_1</var> <var>f_2</var> ... <var>f_n</var></code>
onde ao menos
um factor, digamos <var>f_i</var>, é uma soma de termos.  Cada termo naquela soma é
multiplicado por outros factores no produto.  (A saber todos os
factores excepto <var>f_i</var>).  <code>multthru</code> não expande somas exponenciais.
Essa função é o caminho mais rápido para distribuir produtos (comutativos
ou não) sobre adições.  Uma vez que quocientes são representados como
produtos <code>multthru</code> podem ser usados para dividir adições por produtos também.
</p>
<p><code>multthru (<var>expr_1</var>, <var>expr_2</var>)</code> multiplica cada termo em <var>expr_2</var> (que pode ser uma
adição ou uma equção) por <var>expr_1</var>.  Se <var>expr_1</var> não for por si mesmo uma adição então essa
forma é equivalente a <code>multthru (<var>expr_1</var>*<var>expr_2</var>)</code>.
</p>
<pre class="example">(%i1) x/(x-y)^2 - 1/(x-y) - f(x)/(x-y)^3;
                      1        x         f(x)
(%o1)             - ----- + -------- - --------
                    x - y          2          3
                            (x - y)    (x - y)
(%i2) multthru ((x-y)^3, %);
                           2
(%o2)             - (x - y)  + x (x - y) - f(x)
(%i3) ratexpand (%);
                           2
(%o3)                   - y  + x y - f(x)
(%i4) ((a+b)^10*s^2 + 2*a*b*s + (a*b)^2)/(a*b*s^2);
                        10  2              2  2
                 (b + a)   s  + 2 a b s + a  b
(%o4)            ------------------------------
                                  2
                             a b s
(%i5) multthru (%);  /* note que isso não expande (b+a)^10 */
                                        10
                       2   a b   (b + a)
(%o5)                  - + --- + ---------
                       s    2       a b
                           s
(%i6) multthru (a.(b+c.(d+e)+f));
(%o6)            a . f + a . c . (e + d) + a . b
(%i7) expand (a.(b+c.(d+e)+f));
(%o7)         a . f + a . c . e + a . c . d + a . b
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>nounify</b><i> (<var>f</var>)</i>
<a name="IDX170"></a>
</dt>
<dd><p>Retorna a forma substantiva do nome da função <var>f</var>.  Isso é
necessário se se quer referir ao nome de uma função verbo como se esse nome
fosse um substantivo.  Note que algumas funções verbos irão retornar sua forma
substantiva senão puderem ser avaliadas para certos argumentos.  A forma substantiva é também
a forma retornada se uma chamada de função é precedida por um apóstrofo.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>nterms</b><i> (<var>expr</var>)</i>
<a name="IDX171"></a>
</dt>
<dd><p>Retorna o número de termos que <var>expr</var> pode ter se for
completamente expandida e nenhum cancelamento ou combinação de termos
acontecer.
Note expressões como <code>sin (<var>expr</var>)</code>, <code>sqrt (<var>expr</var>)</code>, <code>exp (<var>expr</var>)</code>, etc.
contam como apenas um termo independentemente de quantos termos <var>expr</var> tenha (se <var>expr</var> for uma
adição).
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>op</b><i> (<var>expr</var>)</i>
<a name="IDX172"></a>
</dt>
<dd><p>Retorna o operador principal da expressão <var>expr</var>.
<code>op (<var>expr</var>)</code> é equivalente a <code>part (<var>expr</var>, 0)</code>. 
</p>
<p><code>op</code> retorna uma sequência de caracteres se o operador principal for uma
operador interno ou definido pelo utilizador como
prefixado, binário ou n-ário infixo, posfixado, matchfix ou nofix.
De outra forma, se <var>expr</var> for uma expressão de função subscrita,
<code>op</code> retorna uma função subscrita;
nesse caso o valor de retorno não é um átomo.
De outro modo, <var>expr</var> é uma função de array ou uma expressão de função comum,
e <code>op</code> retorna um símbolo.
</p>
<p><code>op</code> observa o valor do sinalizador global <code>inflag</code>.
</p>
<p><code>op</code> avalia seus argumentos.
</p>
<p>Veja também <code>args</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>operatorp</b><i> (<var>expr</var>, <var>op</var>)</i>
<a name="IDX173"></a>
</dt>
<dt><u>Função:</u> <b>operatorp</b><i> (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</i>
<a name="IDX174"></a>
</dt>
<dd><p><code>operatorp (<var>expr</var>, <var>op</var>)</code> retorna <code>true</code>
se <var>op</var> for igual ao operador de <var>expr</var>.
</p>
<p><code>operatorp (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> retorna <code>true</code>
se algum elementos de <var>op_1</var>, ..., <var>op_n</var> for igual ao operador de <var>expr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>optimize</b><i> (<var>expr</var>)</i>
<a name="IDX175"></a>
</dt>
<dd><p>Retorna uma expressão que produz o mesmo valor e
efeito que <var>expr</var> mas faz de forma mais eficientemente por evitar a
recomputação de subexpressões comuns.  <code>optimize</code> também tem o mesmo
efeito de &quot;colapsar&quot; seus argumentos de forma que todas as subexpressões comuns
são compartilhadas.
Faça <code>example (optimize)</code> para exemplos.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>optimprefix</b>
<a name="IDX176"></a>
</dt>
<dd><p>Valor por omissão: <code>%</code>
</p>
<p><code>optimprefix</code> é o prefixo usado para símbolos gerados pelo
comando <code>optimize</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>ordergreat</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX177"></a>
</dt>
<dd><p>Escolhe aliases para as variáveis <var>v_1</var>, ..., <var>v_n</var>
tais que <var>v_1</var> &gt; <var>v_2</var> &gt; ...  &gt; <var>v_n</var>,
e <var>v_n</var> &gt; qualquer outra variável não mencionada como um
argumento.
</p>
<p>Veja também <code>orderless</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>ordergreatp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX178"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr_2</var> precede <var>expr_1</var> na
ordenação escolhida com a função <code>ordergreat</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>orderless</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX179"></a>
</dt>
<dd><p>Escolhe aliases para as variáveis <var>v_1</var>, ..., <var>v_n</var>
tais que <var>v_1</var> &lt; <var>v_2</var> &lt; ...  &lt; <var>v_n</var>,
and <var>v_n</var> &lt; qualquer outra variável não mencionada como um
argumento.
</p>
<p>Dessa forma a escala de ordenação completa é: constantes numéricas &lt;
constantes declaradas &lt; escalares declarados &lt; primeiro argumento para <code>orderless</code> &lt;
...  &lt; último argumento para <code>orderless</code> &lt; variáveis que começam com A &lt; ...
&lt; variáveis que começam com Z &lt; último argumento para <code>ordergreat</code> &lt;
 ... &lt; primeiro argumento para <code>ordergreat</code> &lt; <code>mainvar</code>s - variáveis principais declaradas.
</p>
<p>Veja também <code>ordergreat</code> e <code>mainvar</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>orderlessp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX180"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr_1</var> precede <var>expr_2</var> na
ordenação escolhida pelo comando <code>orderless</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>part</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX181"></a>
</dt>
<dd><p>Retorna partes da forma exibida de <code>expr</code>. Essa função
obtém a parte de <code>expr</code> como especificado pelos índices <var>n_1</var>, ..., <var>n_k</var>.  A primeira
parte <var>n_1</var> de <code>expr</code> é obtida, então a parte <var>n_2</var> daquela  é obtida, etc.  O resultado é
parte <var>n_k</var> de ... parte <var>n_2</var> da parte <var>n_1</var> da <code>expr</code>.
</p>
<p><code>part</code> pode ser usada para obter um elemento de uma lista, uma linha de uma matriz, etc.
</p>
<p>Se o último argumento para uma função <code>part</code> for uma lista de índices então
muitas subexpressões serão pinçadas, cada uma correspondendo a um
índice da lista.  Dessa forma <code>part (x + y + z, [1, 3])</code> é <code>z+x</code>.
</p>
<p><code>piece</code> mantém a última expressão seleccionada quando usando as funções
<code>part</code>.  Isso é escolhido durante a execução da função e dessa forma
pode referir-se à função em si mesma como mostrado abaixo.
</p>
<p>Se <code>partswitch</code> for escolhido para <code>true</code> então <code>end</code> é retornado quando uma
parte seleccionada de uma expressão não existir, de outra forma uma mensagem de
erro é forncecida.
</p>

<p>Exemplo: <code>part (z+2*y, 2, 1)</code> retorna 2.
</p>
<p><code>example (part)</code> mostra exemplos adicionais.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>partition</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX182"></a>
</dt>
<dd><p>Retorna uma lista de duas expressões.  Elas são (1)
os factores de <var>expr</var> (se essa expressão for um produto), os termos de <var>expr</var> (se isso for uma
adição), ou a lista (se isso for uma lsita) que não contiver <code>var</code> e, (2)
os factores, termos, ou lista que faz.
</p>
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>partswitch</b>
<a name="IDX183"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>partswitch</code> for <code>true</code>, <code>end</code> é retornado
quando uma parte seleccionada de uma expressão não existir, de outra forma uma
mensagem de erro é fornecida.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>pickapart</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX184"></a>
</dt>
<dd><p>Atribui rótulos de expressão intermédia a subexpressões de
<var>expr</var> de comprimento <var>n</var>, um inteiro.
A subexpressões maiores ou menores não são atribuidos rótulos.
<code>pickapart</code> retorna uma expressão em termos de expressões intermédias
equivalentes à expressão original <var>expr</var>.
</p>
<p>Veja também <code>part</code>, <code>dpart</code>, <code>lpart</code>, <code>inpart</code>, e <code>reveal</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%i2) pickapart (expr, 0);

                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2

(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)

                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre>
</dd></dl>

<dl>
<dt><u>Variável de sistema:</u> <b>piece</b>
<a name="IDX185"></a>
</dt>
<dd><p>Mantém a ultima expressão seleccionada quando usando funções
<code>part</code>.
Isso é escolhido durante a execução da função e dessa forma
pode referir-se à função em si mesma.
</p>

</dd></dl>

<dl>
<dt><u>Função:</u> <b>polarform</b><i> (<var>expr</var>)</i>
<a name="IDX186"></a>
</dt>
<dd><p>Retorna uma expressão <code>r %e^(%i theta)</code> equivalente a <var>expr</var>,
tal que <code>r</code> e <code>theta</code> sejam puramente reais.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>powers</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX187"></a>
</dt>
<dd><p>Fornece os expoentes de <var>x</var> que ocorrem em expressão <var>expr</var>.
</p>
<p><code>load (powers)</code> chama essa função.
</p>

</dd></dl>

<dl>
<dt><u>Função:</u> <b>product</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX188"></a>
</dt>
<dd><p>Representa um produto dos velores de <code>expr</code> com
o índice <var>i</var> variando de <var>i_0</var> a <var>i_1</var>.
A forma substantiva <code>'product</code> é mostrada como um pi maiísculo.
</p>
<p><code>product</code> avalia <var>expr</var> e os limites inferior e superior <var>i_0</var> e <var>i_1</var>,
<code>product</code> coloca um apóstrofo (não avalia) o índice <var>i</var>.
</p>
<p>Se os limites superiores e inferiores diferirem por um inteiro,
<var>expr</var> é avaliada para cada valor do índice <var>i</var>,
e o resultado  um produto explícito.
</p>
<p>de outra forma, o intervalo do índice é indefinido.
Algumas regras são aplicads para simplificar o produto.
Quando a variável global <code>simpproduct</code> for <code>true</code>, regras adicionais são aplicadas.
Em alguns casos, simplificação um resultado que não é um produto;
de outra forma, o resultado é uma forma substantiva <code>'product</code>.
</p>
<p>Veja também <code>nouns</code> e <code>evflag</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) product (x + i*(i+1)/2, i, 1, 4);
(%o1)           (x + 1) (x + 3) (x + 6) (x + 10)
(%i2) product (i^2, i, 1, 7);
(%o2)                       25401600
(%i3) product (a[i], i, 1, 7);
(%o3)                 a  a  a  a  a  a  a
                       1  2  3  4  5  6  7
(%i4) product (a(i), i, 1, 7);
(%o4)          a(1) a(2) a(3) a(4) a(5) a(6) a(7)
(%i5) product (a(i), i, 1, n);
                             n
                           /===\
                            ! !
(%o5)                       ! !  a(i)
                            ! !
                           i = 1
(%i6) product (k, k, 1, n);
                               n
                             /===\
                              ! !
(%o6)                         ! !  k
                              ! !
                             k = 1
(%i7) product (k, k, 1, n), simpproduct;
(%o7)                          n!
(%i8) product (integrate (x^k, x, 0, 1), k, 1, n);
                             n
                           /===\
                            ! !    1
(%o8)                       ! !  -----
                            ! !  k + 1
                           k = 1
(%i9) product (if k &lt;= 5 then a^k else b^k, k, 1, 10);
                              15  40
(%o9)                        a   b
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>realpart</b><i> (<var>expr</var>)</i>
<a name="IDX189"></a>
</dt>
<dd><p>Retorna a parte real de <var>expr</var>. <code>realpart</code> e <code>imagpart</code> irão
trabalhar sobre expressões envolvendo funções trigonométricas e hiperbólicas,
bem como raízes quadradas, logaritmos, e exponenciação.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>rectform</b><i> (<var>expr</var>)</i>
<a name="IDX190"></a>
</dt>
<dd><p>Retorna uma expressão <code>a + b %i</code> equivalente a <var>expr</var>,
tal que <var>a</var> e <var>b</var> sejam puramente reais.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>rembox</b><i> (<var>expr</var>, unlabelled)</i>
<a name="IDX191"></a>
</dt>
<dt><u>Função:</u> <b>rembox</b><i> (<var>expr</var>, <var>rótulo</var>)</i>
<a name="IDX192"></a>
</dt>
<dt><u>Função:</u> <b>rembox</b><i> (<var>expr</var>)</i>
<a name="IDX193"></a>
</dt>
<dd><p>Remove caixas de <var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, unlabelled)</code> remove todas as caixas sem rótulos de <var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, <var>rótulo</var>)</code> remove somente caixas contendo <var>rótulo</var>.
</p>
<p><code>rembox (<var>expr</var>)</code> remove todas as caixas, rotuladas e nã rotuladas.
</p>
<p>Caixas são desenhadas pelas funções <code>box</code>, <code>dpart</code>, e <code>lpart</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h
(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;
(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i4) rembox (expr2, unlabelled);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) rembox (expr2, FOO);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) rembox (expr2, BAR);
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;
(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>sum</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX194"></a>
</dt>
<dd><p>Representa um somatório dos valores de <var>expr</var> com
o índice <var>i</var> variando de <var>i_0</var> a <var>i_1</var>.
A forma substantiva <code>'sum</code> é mostrada com uma letra sigma maiúscula.
<code>sum</code> avalia seu somando <var>expr</var> e limites inferior e superior <var>i_0</var> e <var>i_1</var>,
<code>sum</code> coloca apóstrofo (não avalia) o índice <var>i</var>.
</p>
<p>Se os limites superiores e inferiores diferirem de um número inteiro,
o somatoriando <var>expr</var> é avaliado para cada valor do índice do somatório <var>i</var>,
e o resultado é uma adição explícita.
</p>
<p>De outra forma, o intervalo dos índices é indefinido.
Algumas regras são aplicadas para simplificar o somatório.
Quando a variável global <code>simpsum</code> for <code>true</code>, regras adicionais são aplicadas.
Em alguns casos, simplificações retornam um resultado que não é um somatório;
de outra forma, o resultado é uma forma substantiva <code>'sum</code>.
</p>
<p>Quando o <code>evflag</code> (sinalizador de avaliação) <code>cauchysum</code> for <code>true</code>,
um produto de somatórios é mostrado como um produto de Cauchy,
no qual o índice do somatório mais interno é uma função de
índice de um nível acima, em lugar de variar independentemente.
</p>
<p>A variável global <code>genindex</code> é o prefixo alfabético usado para gerar o próximo índice do somatório,
quando um índice automaticamente gerado for necessário.
</p>
<p><code>gensumnum</code> é o sufixo numérico usando para gerar o próximo índice do somatório,
quando um índice gerado automaticamente for necessário.
Quando <code>gensumnum</code> for <code>false</code>, um índice gerado automaticamente é somente
<code>genindex</code> sem sufixo numérico.
</p>
<p>Veja também <code>sumcontract</code>, <code>intosum</code>,
<code>bashindices</code>, <code>niceindices</code>,
<code>nouns</code>, <code>evflag</code>, e <code>zeilberger</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) sum (i^2, i, 1, 7);
(%o1)                          140
(%i2) sum (a[i], i, 1, 7);
(%o2)           a  + a  + a  + a  + a  + a  + a
                 7    6    5    4    3    2    1
(%i3) sum (a(i), i, 1, 7);
(%o3)    a(7) + a(6) + a(5) + a(4) + a(3) + a(2) + a(1)
(%i4) sum (a(i), i, 1, n);
                            n
                           ====
                           \
(%o4)                       &gt;    a(i)
                           /
                           ====
                           i = 1
(%i5) sum (2^i + i^2, i, 0, n);
                          n
                         ====
                         \       i    2
(%o5)                     &gt;    (2  + i )
                         /
                         ====
                         i = 0
(%i6) sum (2^i + i^2, i, 0, n), simpsum;
                              3      2
                   n + 1   2 n  + 3 n  + n
(%o6)             2      + --------------- - 1
                                  6
(%i7) sum (1/3^i, i, 1, inf);
                            inf
                            ====
                            \     1
(%o7)                        &gt;    --
                            /      i
                            ====  3
                            i = 1
(%i8) sum (1/3^i, i, 1, inf), simpsum;
                                1
(%o8)                           -
                                2
(%i9) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf);
                              inf
                              ====
                              \     1
(%o9)                      30  &gt;    --
                              /      2
                              ====  i
                              i = 1
(%i10) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf), simpsum;
                                  2
(%o10)                       5 %pi
(%i11) sum (integrate (x^k, x, 0, 1), k, 1, n);
                            n
                           ====
                           \       1
(%o11)                      &gt;    -----
                           /     k + 1
                           ====
                           k = 1
(%i12) sum (if k &lt;= 5 then a^k else b^k, k, 1, 10));
Incorrect syntax: Too many )'s
else b^k, k, 1, 10))
                  ^
(%i12) linenum:11;
(%o11)                         11
(%i12) sum (integrate (x^k, x, 0, 1), k, 1, n);
                            n
                           ====
                           \       1
(%o12)                      &gt;    -----
                           /     k + 1
                           ====
                           k = 1
(%i13) sum (if k &lt;= 5 then a^k else b^k, k, 1, 10);
          10    9    8    7    6    5    4    3    2
(%o13)   b   + b  + b  + b  + b  + a  + a  + a  + a  + a
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>lsum</b><i> (<var>expr</var>, <var>x</var>, <var>L</var>)</i>
<a name="IDX195"></a>
</dt>
<dd><p>Representas a adição de <var>expr</var> a cada elemento <var>x</var> em <var>L</var>.
</p>
<p>Uma forma substantiva <code>'lsum</code> é retornada
se o argumento <var>L</var> não avaliar para uma lista.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) lsum (x^i, i, [1, 2, 7]);
                            7    2
(%o1)                      x  + x  + x
(%i2) lsum (i^2, i, rootsof (x^3 - 1, x));
                     ====
                     \      2
(%o2)                 &gt;    i
                     /
                     ====
                                   3
                     i in rootsof(x  - 1, x)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>verbify</b><i> (<var>f</var>)</i>
<a name="IDX196"></a>
</dt>
<dd><p>Retorna a forma verbal da função chamada <var>f</var>.
</p>
<p>Veja também <code>verb</code>, <code>noun</code>, e <code>nounify</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>Outubro, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
