<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on Outubro, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima: 6. Express&otilde;es</title>

<meta name="description" content="Manual do Maxima: 6. Express&otilde;es">
<meta name="keywords" content="Manual do Maxima: 6. Express&otilde;es">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Express_00f5es"></a>
<a name="SEC20"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_5.html#SEC19" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC21" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_5.html#SEC12" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 6. Express&otilde;es </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC21">6.1 Introdu&ccedil;&atilde;o a Express&otilde;es</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC22">6.2 Complexo</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                     
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC23">6.3 Substantivos e Verbos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC24">6.4 Identificadores</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC25">6.5 Seq&uuml;&ecirc;ncias de caracteres</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC26">6.6 Desigualdade</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                  
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC27">6.7 Sintaxe</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">                      
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC28">6.8 Fun&ccedil;&otilde;es e Vari&aacute;veis Definidas para Express&otilde;es</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Introdu_00e7_00e3o-a-Express_00f5es"></a>
<a name="SEC21"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC22" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.1 Introdu&ccedil;&atilde;o a Express&otilde;es </h2>

<p>Existe um conjunto de palavras reservadas que n&atilde;o pode ser usado como
nome de vari&aacute;vel.   Seu uso pode causar um poss&iacute;vel erro cr&iacute;tico de sintaxe.
</p>
<pre class="example">integrate            next           from                 diff            
in                   at             limit                sum             
for                  and            elseif               then            
else                 do             or                   if              
unless               product        while                thru            
step                                                                     
</pre>
<p>Muitas coisas em Maxima s&atilde;o express&otilde;es.   Uma seq&uuml;&ecirc;ncia de express&otilde;es
pode ser feita dentro de uma express&atilde;o maior atrav&eacute;s da separa&ccedil;&atilde;o dessas atrav&eacute;s de v&iacute;rgulas e
colocando par&ecirc;ntesis em torno dela.   Isso &eacute; similar ao <b>C</b>
<i>express&atilde;o com v&iacute;rgula</i>.
</p>
<pre class="example">(%i1) x: 3$
(%i2) (x: x+1, x: x^2);
(%o2)                          16
(%i3) (if (x &gt; 17) then 2 else 4);
(%o3)                           4
(%i4) (if (x &gt; 17) then x: 2 else y: 4, y+x);
(%o4)                          20
</pre>
<p>Mesmo ciclos em Maxima s&atilde;o express&otilde;es, embora o valor de retorno desses
ciclos n&atilde;o seja muito &uacute;til (eles retornam sempre <code>done</code>).
</p>
<pre class="example">(%i1) y: (x: 1, for i from 1 thru 10 do (x: x*i))$
(%i2) y;
(%o2)                         done
</pre>
<p>contanto que o que voc&ecirc; realmente queira seja provavelmente incluir um terceiro
termo na <i>express&atilde;o com v&iacute;rgula</i> que fornece de volta o valor atualizado.
</p>
<pre class="example">(%i3) y: (x: 1, for i from 1 thru 10 do (x: x*i), x)$
(%i4) y;
(%o4)                        3628800
</pre>


<hr size="6">
<a name="Complexo"></a>
<a name="SEC22"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC21" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC23" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.2 Complexo </h2>
<p>Uma express&atilde;o complexa &eacute; especificada no Maxima atrav&eacute;s da adi&ccedil;&atilde;o da
parte real da express&atilde;o a <code>%i</code> vezes a parte imagin&aacute;ria.  Dessa forma as
ra&iacute;zes da equa&ccedil;&atilde;o <code>x^2 - 4*x + 13 = 0</code> s&atilde;o <code>2 + 3*%i</code> e <code>2 - 3*%i</code>.  Note que
produtos de simplifica&ccedil;&atilde;o de express&otilde;es complexas podem ser efetuadas atrav&eacute;s da
expans&atilde;o do produto.  Simplifica&ccedil;&atilde;o de quocientes, ra&iacute;zes, e outras
fun&ccedil;&otilde;es de express&otilde;es complexas podem usualmente serem realizadas atrav&eacute;s do uso
das fun&ccedil;&otilde;es <code>realpart</code>, <code>imagpart</code>, <code>rectform</code>, <code>polarform</code>, <code>abs</code>, <code>carg</code>.
</p>
<hr size="6">
<a name="Substantivos-e-Verbos"></a>
<a name="SEC23"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC22" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC24" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.3 Substantivos e Verbos </h2>
<p>Maxima distingue entre operadores que s&atilde;o &quot;substantivos&quot; e operadores que s&atilde;o &quot;verbos&quot;.
Um verbo &eacute; um operador que pode ser executado.
Um substantivo &eacute; um operador que aparece como um s&iacute;mbolo em uma express&atilde;o, sem ser executado.
Por padr&atilde;o, nomes de fun&ccedil;&atilde;o s&atilde;o verbos.
Um verbo pode ser mudado em um substantivo atrav&eacute;s da adi&ccedil;&atilde;o de um ap&oacute;strofo no in&iacute;cio do nome da fun&ccedil;&atilde;o
ou aplicando a fun&ccedil;&atilde;o <code>nounify</code>.
Um substantivo pode ser mudado em um verbo atrav&eacute;s da aplica&ccedil;&atilde;o da fun&ccedil;&atilde;o <code>verbify</code>.
O sinalizador de avalia&ccedil;&atilde;o <code>nouns</code> faz com que <code>ev</code> avalie substantivos em uma express&atilde;o.
</p>
<p>A forma verbal &eacute; distinguida atrav&eacute;s de
um sinal de d&oacute;lar <code>$</code> no in&iacute;cio do s&iacute;mbolo Lisp correspondente.
De forma oposta,
a forma substantiva &eacute; distinguida atrav&eacute;s de 
um sinal de <code>%</code> no in&iacute;cio do s&iacute;mbolo Lisp correspondente.
Alguns substantivos possuem propriedades especiais de exibi&ccedil;&atilde;o, tais como <code>'integrate</code> e <code>'derivative</code>
(retornado por <code>diff</code>), mas muitos n&atilde;o.
Por padr&atilde;o, as formas substantiva e verbal de uma fun&ccedil;&atilde;o s&atilde;o id&ecirc;nticas quando mostradas.
O sinalizador global <code>noundisp</code> faz com que Maxima mostre substantivos com um ap&oacute;strofo no in&iacute;cio <code>'</code>.
</p>
<p>Veja tamb&eacute;m <code>noun</code>, <code>nouns</code>, <code>nounify</code>, e <code>verbify</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) foo (x) := x^2;
                                     2
(%o1)                     foo(x) := x
(%i2) foo (42);
(%o2)                         1764
(%i3) 'foo (42);
(%o3)                        foo(42)
(%i4) 'foo (42), nouns;
(%o4)                         1764
(%i5) declare (bar, noun);
(%o5)                         done
(%i6) bar (x) := x/17;
                                     x
(%o6)                    ''bar(x) := --
                                     17
(%i7) bar (52);
(%o7)                        bar(52)
(%i8) bar (52), nouns;
                               52
(%o8)                          --
                               17
(%i9) integrate (1/x, x, 1, 42);
(%o9)                        log(42)
(%i10) 'integrate (1/x, x, 1, 42);
                             42
                            /
                            [   1
(%o10)                      I   - dx
                            ]   x
                            /
                             1
(%i11) ev (%, nouns);
(%o11)                       log(42)
</pre>
<hr size="6">
<a name="Identificadores"></a>
<a name="SEC24"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC23" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.4 Identificadores </h2>
<p>Identificadores do Maxima podem compreender caracteres alfab&eacute;ticos,
mais os numerais de 0 a 9,
mais qualquer caractere especial precedido por um caractere contra-barra <code>\</code>.
</p>
<p>Um numeral pode ser o primeiro caractere de um identificador
se esse numeral for precedido por uma contra-barra.
Numerais que forem o segundo ou o &uacute;ltimo caractere n&atilde;o precisam ser precedidos por uma contra barra.
</p>
<p>Caracteres podem ser declarados para serem alfab&eacute;ticos por meio da fun&ccedil;&atilde;o <code>declare</code>.
Se ent&atilde;o declarados alfab&eacute;ticos, eles n&atilde;o precisam serem precedidos de uma contrabarra em um identificador.
Os caracteres alfab&eacute;ticos v&atilde;o inicialmente 
de <code>A</code> a <code>Z</code>, de <code>a</code> a <code>z</code>, <code>%</code>, e <code>_</code>.
</p>
<p>Maxima &eacute; sens&iacute;vel &agrave; caixa . Os identificadores <code>algumacoisa</code>, <code>ALGUMACOISA</code>, e <code>Algumacoisa</code> s&atilde;o distintos.
Veja <a href="maxima_3.html#SEC5">Lisp e Maxima</a> para mais sobre esse ponto.
</p>
<p>Um identificador Maxima &eacute; um s&iacute;mbolo Lisp que come&ccedil;a com um sinal de d&oacute;lar <code>$</code>.
Qualquer outro s&iacute;mbolo Lisp &eacute; precedido por um ponto de interroga&ccedil;&atilde;o <code>?</code> quando aparecer no Maxima.
Veja <a href="maxima_3.html#SEC5">Lisp e Maxima</a> para maiores detalhes sobre esse ponto.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) %an_ordinary_identifier42;
(%o1)               %an_ordinary_identifier42
(%i2) embedded\ spaces\ in\ an\ identifier;
(%o2)           embedded spaces in an identifier
(%i3) symbolp (%);
(%o3)                         true
(%i4) [foo+bar, foo\+bar];
(%o4)                 [foo + bar, foo+bar]
(%i5) [1729, \1729];
(%o5)                     [1729, 1729]
(%i6) [symbolp (foo\+bar), symbolp (\1729)];
(%o6)                     [true, true]
(%i7) [is (foo\+bar = foo+bar), is (\1729 = 1729)];
(%o7)                    [false, false]
(%i8) baz\~quux;
(%o8)                       baz~quux
(%i9) declare (&quot;~&quot;, alphabetic);
(%o9)                         done
(%i10) baz~quux;
(%o10)                      baz~quux
(%i11) [is (foo = FOO), is (FOO = Foo), is (Foo = foo)];
(%o11)                [false, false, false]
(%i12) :lisp (defvar *my-lisp-variable* '$foo)
*MY-LISP-VARIABLE*
(%i12) ?\*my\-lisp\-variable\*;
(%o12)                         foo
</pre>
<hr size="6">
<a name="Seq_00fc_00eancias-de-caracteres"></a>
<a name="SEC25"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC24" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.5 Seq&uuml;&ecirc;ncias de caracteres </h2>

<p>Strings (seq&uuml;&ecirc;ncias de caracteres) s&atilde;o contidas entre aspas duplas <code>&quot;</code> em entradas de dados usados pelo Maxima,
e mostradas com ou sem as aspas duplas, 
dependendo do valor escolhido para a vari&aacute;vel global <code>stringdisp</code>.
</p>
<p>Seq&uuml;&ecirc;ncias de caracteres podem conter quaisquer caracteres,
incluindo tabula&ccedil;&otilde;es (tab), nova linha (ou fim de linha), e caracteres de retorno da cabe&ccedil;a de impress&atilde;o (carriage return).
A seq&uuml;&ecirc;ncia <code>\&quot;</code> &eacute; reconhecida com uma aspa dupla literal,
e <code>\\</code> como uma contrabarra literal.
Quando a contrabarra aparecer no final de uma linha,
a contrabarra e a termina&ccedil;&atilde;o de linha
(ou nova linha ou retorno de carro e nova linha)
s&atilde;o ignorados,
de forma que a seq&uuml;&ecirc;ncia de caracteres continue na pr&oacute;xima linha.
Nenhuma outra combina&ccedil;&atilde;o especial de contrabarra com outro caractere &eacute; reconhecida;
quando a contrabarra aparecer antes de qualquer outro caractere que n&atilde;o seja <code>&quot;</code>, <code>\</code>,
ou um fim de linha, a contrabarra &eacute; ignorada.
N&atilde;o exite caminho para representar um caractere especial
(tal como uma tabula&ccedil;&atilde;o, nova linha, ou retorno da cabe&ccedil;a de impress&atilde;o)
exceto atrav&eacute;s de encaixar o caractere literal na seq&uuml;&ecirc;ncia de caracteres.
</p>
<p>N&atilde;o existe tipo de caractere no Maxima;
um caractere simples &eacute; representado como uma seq&uuml;&ecirc;ncia de caracteres de um &uacute;nico caractere.
</p>
<p>Seq&uuml;&ecirc;ncias de caracteres no Maxima s&atilde;o implementadas como s&iacute;mbolos do Lisp, n&atilde;o como seq&uuml;encias de caracteres do not Lisp;
o que pode mudar em futuras vers&otilde;es do Maxima.
Maxima pode mostrar seq&uuml;&ecirc;ncias de caracteres do Lisp e caracteres do Lisp,
embora algumas outras opera&ccedil;&otilde;es (por exemplo, testes de igualdade) possam falhar.
</p>
<p>O pacote adicional <code>stringproc</code> cont&eacute;m muitas fun&ccedil;&otilde;es que trabalham com seq&uuml;&ecirc;ncias de caracteres.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) s_1 : &quot;Isso &eacute; uma seq&uuml;&ecirc;ncia de caracteres  do Maxima.&quot;;
(%o1)               Isso &eacute; uma seq&uuml;&ecirc;ncia de caracteres  do Maxima.
(%i2) s_2 : &quot;Caracteres \&quot;aspas duplas\&quot; e contrabarras \\ encaixados em uma seq&uuml;&ecirc;ncia de caracteres.&quot;;
(%o2) Caracteres &quot;aspas duplas&quot; e contrabarra \ encaixados em uma seq&uuml;&ecirc;ncia de caracteres.
(%i3) s_3 : &quot;Caractere de fim de linha encaixado
nessa seq&uuml;&ecirc;ncia de caracteres.&quot;;
(%o3) Caractere de fim de linha encaixado
nessa seq&uuml;&ecirc;ncia de caracteres.
(%i4) s_4 : &quot;Ignore o \
caractere de \
fim de linha nessa \
seq&uuml;&ecirc;ncia de caracteres.&quot;;
(%o4) Ignore o caractere de fim de linha nessa seq&uuml;&ecirc;ncia de caracteres.
(%i5) stringdisp : false;
(%o5)                         false
(%i6) s_1;
(%o6)               Isso &eacute; uma seq&uuml;&ecirc;ncia de caracteres  do Maxima.
(%i7) stringdisp : true;
(%o7)                         true
(%i8) s_1;
(%o8)              &quot;Isso &eacute; uma seq&uuml;&ecirc;ncia de caracteres  do Maxima.&quot;
</pre>
<hr size="6">
<a name="Desigualdade"></a>
<a name="SEC26"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC25" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC27" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.6 Desigualdade </h2>
<p>Maxima tem os operadores de desigualdade <code>&lt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, <code>&gt;</code>, <code>#</code>, e <code>notequal</code>.
Veja <code>if</code> para uma descri&ccedil;&atilde;o de express&otilde;es condicionais.
</p>
<hr size="6">
<a name="Sintaxe"></a>
<a name="SEC27"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC26" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC28" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.7 Sintaxe </h2>
<p>&Eacute; poss&iacute;vel definir novos operadores com preced&ecirc;ncia especificada,
remover a defini&ccedil;&atilde;o de operadores existentes,
ou redefinir a preced&ecirc;ncia de operadores existentes.  
Um operador pode ser un&aacute;rio prefixado ou un&aacute;rio p&oacute;sfixado, binario infixado, n-&aacute;rio infixado, matchfix, ou nofix.
&quot;Matchfix&quot; significa um par de s&iacute;mbolos que abra&ccedil;am seu argumento ou seus argumentos,
e &quot;nofix&quot; significa um operador que n&atilde;o precisa de argumentos.
Como exemplos dos diferentes tipos de operadores, existe o seguinte.
</p>
<dl compact="compact">
<dt> un&aacute;rio prefixado</dt>
<dd><p>nega&ccedil;&atilde;o <code>- a</code>
</p></dd>
<dt> un&aacute;rio posfixado</dt>
<dd><p>fatorial <code>a!</code>
</p></dd>
<dt> bin&aacute;rio infixado</dt>
<dd><p>exponencia&ccedil;&atilde;o <code>a^b</code>
</p></dd>
<dt> n-&aacute;rio infixado</dt>
<dd><p>adi&ccedil;&atilde;o <code>a + b</code>
</p></dd>
<dt> matchfix</dt>
<dd><p>constru&ccedil;&atilde;o de lista <code>[a, b]</code>
</p></dd>
</dl>

<p>(N&atilde;o existe operadores internos nofix;
para um exemplo de tal operador, veja <code>nofix</code>.)
</p>
<p>O mecanismo para definir um novo operador &eacute; direto.
Somente &eacute; necess&aacute;rio declarar uma fun&ccedil;&atilde;o como um operador;
a fun&ccedil;&atilde;o operador pode ou n&atilde;o estar definida previamente.
</p>
<p>Um exemplo de operadores definidos pelo usu&aacute;rio &eacute; o seguinte.
Note que a chamada expl&iacute;cita de fun&ccedil;&atilde;o <code>&quot;dd&quot; (a)</code> &eacute; equivalente a <code>dd a</code>,
da mesma forma <code>&quot;&lt;-&quot; (a, b)</code> &eacute; equivalente a <code>a &lt;- b</code>.
Note tamb&eacute;m que as fun&ccedil;&otilde;es <code>&quot;dd&quot;</code> e <code>&quot;&lt;-&quot;</code> s&atilde;o indefinidas nesse exemplo.
</p>
<pre class="example">(%i1) prefix (&quot;dd&quot;);
(%o1)                          dd
(%i2) dd a;
(%o2)                         dd a
(%i3) &quot;dd&quot; (a);
(%o3)                         dd a
(%i4) infix (&quot;&lt;-&quot;);
(%o4)                          &lt;-
(%i5) a &lt;- dd b;
(%o5)                      a &lt;- dd b
(%i6) &quot;&lt;-&quot; (a, &quot;dd&quot; (b));
(%o6)                      a &lt;- dd b
</pre>
<p>As fun&ccedil;&otilde;es m&aacute;xima que definem novos operadores est&atilde;o sumarizadas nessa tabela,
equilibrando expoente associado esquerdo (padr&atilde;o) e o expoente associado direito (&quot;eae&quot; e &quot;ead&quot;, respectivamente).
(Associa&ccedil;&atilde;o de expoentes determina a preced&ecirc;ncia do operador. todavia, uma vez que os expoentes
esquerdo e direito podem ser diferentes, associa&ccedil;&atilde;o de expoentes &eacute; at&eacute; certo ponto mais complicado que preced&ecirc;ncia.)
Alguma das fun&ccedil;&otilde;es de defini&ccedil;&atilde;o de opera&ccedil;&otilde;es tomam argumentos adicionais;
veja as descri&ccedil;&otilde;es de fun&ccedil;&atilde;o para maiores detalhes.
</p>
<dl compact="compact">
<dt> <code>prefixado</code></dt>
<dd><p>ead=180
</p></dd>
<dt> <code>posfixado</code></dt>
<dd><p>eae=180
</p></dd>
<dt> <code>infixado</code></dt>
<dd><p>eae=180, ead=180
</p></dd>
<dt> <code>n&aacute;rio</code></dt>
<dd><p>eae=180, ead=180
</p></dd>
<dt> <code>matchfix</code></dt>
<dd><p>(associa&ccedil;&atilde;o de expoentes n&atilde;o &eacute; aplic&aacute;vel)
</p></dd>
<dt> <code>nofix</code></dt>
<dd><p>(associa&ccedil;&atilde;o de expoentes n&atilde;o &eacute; aplic&aacute;vel)
</p></dd>
</dl>

<p>Para compara&ccedil;&atilde;o,
aqui est&aacute; alguns operadores internos e seus expoentes associados esquerdo e direito.
</p>
<pre class="example">Operador   eae     ead

  :        180     20 
  ::       180     20 
  :=       180     20 
  ::=      180     20 
  !        160
  !!       160
  ^        140     139 
  .        130     129 
  *        120
  /        120     120 
  +        100     100 
  -        100     134 
  =        80      80 
  #        80      80 
  &gt;        80      80 
  &gt;=       80      80 
  &lt;        80      80 
  &lt;=       80      80 
  not              70 
  and      65
  or       60
  ,        10
  $        -1
  ;        -1
</pre>
<p><code>remove</code> e <code>kill</code> removem propriedades de operador de um &aacute;tomo.
<code>remove (&quot;<var>a</var>&quot;, op)</code> remove somente as propriedades de operador de <var>a</var>.
<code>kill (&quot;<var>a</var>&quot;)</code> remove todas as propriedades de <var>a</var>, incluindo as propriedades de operador.
Note que o nome do operador dever estar abra&ccedil;ado por aspas duplas.
</p>
<pre class="example">(%i1) infix (&quot;##&quot;);
(%o1)                          ##
(%i2) &quot;##&quot; (a, b) := a^b;
                                     b
(%o2)                     a ## b := a
(%i3) 5 ## 3;
(%o3)                          125
(%i4) remove (&quot;##&quot;, op);
(%o4)                         done
(%i5) 5 ## 3;
Incorrect syntax: # is not a prefix operator
5 ##
  ^
(%i5) &quot;##&quot; (5, 3);
(%o5)                          125
(%i6) infix (&quot;##&quot;);
(%o6)                          ##
(%i7) 5 ## 3;
(%o7)                          125
(%i8) kill (&quot;##&quot;);
(%o8)                         done
(%i9) 5 ## 3;
Incorrect syntax: # is not a prefix operator
5 ##
  ^
(%i9) &quot;##&quot; (5, 3);
(%o9)                       ##(5, 3)
</pre>
<hr size="6">
<a name="Fun_00e7_00f5es-e-Vari_00e1veis-Definidas-para-Express_00f5es"></a>
<a name="SEC28"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC27" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.8 Fun&ccedil;&otilde;es e Vari&aacute;veis Definidas para Express&otilde;es </h2>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>at</b><i> (<var>expr</var>, [<var>eqn_1</var>, ..., <var>eqn_n</var>])</i>
<a name="IDX134"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>at</b><i> (<var>expr</var>, <var>eqn</var>)</i>
<a name="IDX135"></a>
</dt>
<dd><p>Avalia a express&atilde;o <var>expr</var> com
as vari&aacute;veis assumindo os valores como especificado para elas na lista de
equa&ccedil;&otilde;es <code>[<var>eqn_1</var>, ..., <var>eqn_n</var>]</code> ou a equa&ccedil;&atilde;o simples <var>eqn</var>.
</p>
<p>Se uma subexpress&atilde;o depender de qualquer das vari&aacute;veis para a qual um valor foi especificado
mas n&atilde;o existe <code>atvalue</code> especificado e essa subexpress&atilde;o n&atilde;o pode ser avaliada de outra forma,
ent&atilde;o uma forma substantiva de <code>at</code> &eacute; retornada que mostra em uma forma bidimensional.
</p>
<p><code>at</code> realiza m&uacute;ltiplas substitui&ccedil;&otilde;es em s&eacute;rie, n&atilde;o em paralelo.
</p>
<p>Veja tamb&eacute;m <code>atvalue</code>.
Para outras fun&ccedil;&otilde;es que realizam substitui&ccedil;&otilde;es,
veja tamb&eacute;m <code>subst</code> e <code>ev</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x, y)^2 - u(x, y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>box</b><i> (<var>expr</var>)</i>
<a name="IDX136"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>box</b><i> (<var>expr</var>, <var>a</var>)</i>
<a name="IDX137"></a>
</dt>
<dd><p>Retorna <var>expr</var> dentro de uma caixa.
O valor de retorno &eacute; uma express&atilde;o com <code>box</code> como o operador e <var>expr</var> como o argumento.
Uma caixa &eacute; desenhada sobre a tela quando <code>display2d</code> for <code>true</code>.
</p>
<p><code>box (<var>expr</var>, <var>a</var>)</code>
Empacota <var>expr</var> em uma caixa rotulada pelo s&iacute;mbolo <var>a</var>.
O r&oacute;tulo &eacute; truncado se for maior que a largura da caixa.
</p>
<p><code>box</code> avalia seu argumento.
Todavia, uma express&atilde;o dentro de uma caixa n&atilde;o avalia para seu conte&uacute;do,
ent&atilde;o express&otilde;es dentro de caixas s&atilde;o efetivamente exclu&iacute;das de c&aacute;lculos.
</p>
<p><code>boxchar</code> &eacute; o caractere usado para desenhar a caixa em <code>box</code>
e nas fun&ccedil;&otilde;es <code>dpart</code> e <code>lpart</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%i7) boxchar: &quot;-&quot;;
(%o7)                           -
(%i8) box (sin(x) + cos(y));
                        -----------------
(%o8)                   -cos(y) + sin(x)-
                        -----------------
</pre>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>boxchar</b>
<a name="IDX138"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>&quot;</code>
</p>
<p><code>boxchar</code> &eacute; o caractere usado para desenhar a caixa por <code>box</code>
e nas fun&ccedil;&otilde;es <code>dpart</code> e <code>lpart</code>.
</p>
<p>Todas as caixas em uma express&atilde;o s&atilde;o desenhadas com o valor atual de <code>boxchar</code>;
o caractere de desenho n&atilde;o &eacute; armazenado com a express&atilde;o de caixa. Isso quer dizer que se voc&ecirc;
desenhar uma caixa e em seguida mudar o caractere de desenho a caixa anteriormente
desenhada ser&aacute; redesenhada com o caractere mudado caso isso seja solicitado.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>carg</b><i> (<var>z</var>)</i>
<a name="IDX139"></a>
</dt>
<dd><p>Retorna o argumento complexo de <var>z</var>.
O argumento complexo &eacute; um &acirc;ngulo <code>theta</code> no intervalo de <code>(-%pi, %pi]</code>
tal que <code>r exp (theta %i) = <var>z</var></code> onde <code>r</code> &eacute; o m&oacute;dulo de <var>z</var>.
</p>
<p><code>carg</code> &eacute; uma fun&ccedil;&atilde;o computacional,
n&atilde;o uma fun&ccedil;&atilde;o de simplifica&ccedil;&atilde;o.
</p>
<p><code>carg</code> ignora a declara&ccedil;&atilde;o <code>declare (<var>x</var>, complex)</code>,
e trata <var>x</var> como uma vari&aacute;vel real.
Isso &eacute; um erro. </p>
<p>Veja tamb&eacute;m <code>abs</code> (m&oacute;dulo de n&uacute;mero complexo), <code>polarform</code>, <code>rectform</code>,
<code>realpart</code>, e <code>imagpart</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) carg (1);
(%o1)                           0
(%i2) carg (1 + %i);
                               %pi
(%o2)                          ---
                                4
(%i3) carg (exp (%i));
(%o3)                           1
(%i4) carg (exp (%pi * %i));
(%o4)                          %pi
(%i5) carg (exp (3/2 * %pi * %i));
                                %pi
(%o5)                         - ---
                                 2
(%i6) carg (17 * exp (2 * %i));
(%o6)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Opereador especial:</u> <b>constant</b>
<a name="IDX140"></a>
</dt>
<dd><p><code>declare (<var>a</var>, constant)</code> declara <var>a</var> para ser uma constante.
Veja <code>declare</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>constantp</b><i> (<var>expr</var>)</i>
<a name="IDX141"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for uma express&atilde;o constante,
de outra forma retorna <code>false</code>.
</p>
<p>Uma express&atilde;o &eacute; considerada uma express&atilde;o constante se seus argumentos forem
n&uacute;meros (incluindo n&uacute;meros racionais, como mostrado com <code>/R/</code>),
constantes simb&oacute;licas como <code>%pi</code>, <code>%e</code>, e <code>%i</code>,
vari&aacute;veis associadas a uma constante ou constante declarada atrav&eacute;s de <code>declare</code>,
ou fun&ccedil;&otilde;es cujos argumentos forem constantes.
</p>
<p><code>constantp</code> avalia seus argumentos.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) constantp (7 * sin(2));
(%o1)                                true
(%i2) constantp (rat (17/29));
(%o2)                                true
(%i3) constantp (%pi * sin(%e));
(%o3)                                true
(%i4) constantp (exp (x));
(%o4)                                false
(%i5) declare (x, constant);
(%o5)                                done
(%i6) constantp (exp (x));
(%o6)                                true
(%i7) constantp (foo (x) + bar (%e) + baz (2));
(%o7)                                false
(%i8) 
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>declare</b><i> (<var>a_1</var>, <var>p_1</var>, <var>a_2</var>, <var>p_2</var>, ...)</i>
<a name="IDX142"></a>
</dt>
<dd><p>Atribui aos &aacute;tomos ou lista de &aacute;tomos <var>a_i</var> a propriedade ou lista de propriedades <var>p_i</var>.
Quando <var>a_i</var> e/ou <var>p_i</var> forem listas,
cada um dos &aacute;tomos recebe todas as propriedades.
</p>
<p><code>declare</code> n&atilde;o avalia seus argumentos.
<code>declare</code> sempre retorna <code>done</code>.
</p>
<p>Como colocado na descri&ccedil;&atilde;o para cada sinalizador de declara&ccedil;&atilde;o,
para alguns sinalizadores
<code>featurep(<var>objeto</var>, <var>recurso</var>)</code>
retorna <code>true</code> se <var>objeto</var> tiver sido declarado para ter <var>recurso</var>.
Todavia, <code>featurep</code> n&atilde;o reconhece alguns sinalizadores; isso &eacute; um erro.
</p>
<p>Veja tamb&eacute;m <code>features</code>.
</p>
<p><code>declare</code> reconhece as seguintes propriedades:
</p>
<dl compact="compact">
<dt> <code>evfun</code></dt>
<dd><p>Torna <var>a_i</var> conhecido para <code>ev</code> de forma que a fun&ccedil;&atilde;o nomeada por <var>a_i</var>
&eacute; aplicada quando <var>a_i</var> aparece como um sinalizador argumento de <code>ev</code>.
Veja <code>evfun</code>.
</p>
</dd>
<dt> <code>evflag</code></dt>
<dd><p>Torna <var>a_i</var> conhecido para a fun&ccedil;&atilde;o <code>ev</code> de forma que <var>a_i</var> &eacute; associado a <code>true</code>
durante a execu&ccedil;&atilde;o de <code>ev</code> quando <var>a_i</var> aparece como um sinalizador argumento de <code>ev</code>.
Veja <code>evflag</code>.
</p>
 

</dd>
<dt> <code>bindtest</code></dt>
<dd><p>Diz ao Maxima para disparar um erro quando <var>a_i</var> for avaliado como sendo livre de associa&ccedil;&atilde;o.
</p>
</dd>
<dt> <code>noun</code></dt>
<dd><p>Diz ao Maxima para passar <var>a_i</var> como um substantivo. 
O efeito disso &eacute; substituir int&acirc;ncias de <var>a_i</var> com <code>'<var>a_i</var></code>
ou <code>nounify(<var>a_i</var>)</code>, ependendo do contexto.
</p>
</dd>
<dt> <code>constant</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma constante simb&oacute;lica.
</p>
</dd>
<dt> <code>scalar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma vari&aacute;vel escalar.
</p>
</dd>
<dt> <code>nonscalar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma vari&aacute;vel n&atilde;o escalar.
The usual application is to declare a variable as a symbolic vector or matrix.
</p>
</dd>
<dt> <code>mainvar</code></dt>
<dd><p>Diz ao Maxima para considerar <var>a_i</var> uma &quot;vari&aacute;vel principal&quot; (<code>mainvar</code>).
<code>ordergreatp</code> determina a ordena&ccedil;&atilde;o de &aacute;tomos como segue:
</p>
<p>(vari&aacute;veis principais) &gt; (outras vari&aacute;veis) &gt; (vari&aacute;veis escalares) &gt; (constantes) &gt; (n&uacute;meros)
</p>
</dd>
<dt> <code>alphabetic</code></dt>
<dd><p>Diz ao Maxima para reconhecer todos os caracteres em <var>a_i</var> (que deve ser uma seq&uuml;&ecirc;ncia de caracteres) como caractere alfab&eacute;tico.
</p>
</dd>
<dt> <code>feature</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como nome de um recurso.
Other atoms may then be declared to have the <var>a_i</var> property.
</p>
</dd>
<dt> <code>rassociative</code>, <code>lassociative</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma func&atilde;o associativa a direita ou associativa a esquerda.
</p>
</dd>
<dt> <code>nary</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o n-&aacute;ria (com muitos argumentos).
</p>
<p>A declara&ccedil;&atilde;o <code>nary</code> n&atilde;o tem o mesmo objetivo que uma chamada &agrave; fun&ccedil;&atilde;o <code>nary</code>.
O &uacute;nico efeito de <code>declare(foo, nary)</code> &eacute; para instruir o simplificador do Maxima
a melhorar as pr&oacute;ximas express&otilde;es,
por exemplo, para simplificar <code>foo(x, foo(y, z))</code> para <code>foo(x, y, z)</code>.
</p>
</dd>
<dt> <code>symmetric</code>, <code>antisymmetric</code>, <code>commutative</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o sim&eacute;trica ou antisim&eacute;trica.
<code>commutative</code> &eacute; o mesmo que <code>symmetric</code>.
</p>
</dd>
<dt> <code>oddfun</code>, <code>evenfun</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o par ou uma fun&ccedil;&atilde;o &iacute;mpar.
</p> 
</dd>
<dt> <code>outative</code></dt>
<dd><p>Diz ao Maxima para simplificar express&otilde;es <var>a_i</var>
colocando fatores constantes em evid&ecirc;ncia no primeiro argumento.
</p>
<p>Quando <var>a_i</var> tiver um argumento,
um fator &eacute; onsiderado constante se for um literal ou se for declarado como sendo constante.
</p>
<p>Quando <var>a_i</var> tiver dois ou mais argumentos,
um fator &eacute; considerado constante
se o segundo argumento for um s&iacute;mbolo
e o fator estiver livre do segundo argumento.
</p>
</dd>
<dt> <code>multiplicative</code></dt>
<dd><p>Diz ao Maxima para simplificar express&otilde;es do tipo <var>a_i</var>
atrav&eacute;s da substitui&ccedil;&atilde;o <code><var>a_i</var>(x * y * z * ...)</code> <code>--&gt;</code>
<code><var>a_i</var>(x) * <var>a_i</var>(y) * <var>a_i</var>(z) * ...</code>.
A substitui&ccedil;&atilde;o &eacute; realizada no primeiro argumento somente.
</p>
</dd>
<dt> <code>additive</code></dt>
<dd><p>Diz ao Maxima para simplificar express&otilde;es do tipo <var>a_i</var>
atrav&eacute;s da substitui&ccedil;&atilde;o <code><var>a_i</var>(x + y + z + ...)</code> <code>--&gt;</code>
<code><var>a_i</var>(x) + <var>a_i</var>(y) + <var>a_i</var>(z) + ...</code>.
A substitui&ccedil;&atilde;o &eacute; realizada no primeiro argumento somente.
</p>
</dd>
<dt> <code>linear</code></dt>
<dd><p>Equivalente a declarar <var>a_i</var> ao mesmo tempo <code>outative</code> e <code>additive</code>.
</p>
 
</dd>
<dt> <code>integer</code>, <code>noninteger</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como como uma vari&aacute;vel inteira ou como uma vari&aacute;vel n&atilde;o inteira.
</p> 
<p>Maxima reconhece os seguintes recursos de objetos:
</p>
</dd>
<dt> <code>even</code>, <code>odd</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma vari&aacute;vel inteira par ou como uma vari&aacute;vel inteira &iacute;mpar.
</p>
</dd>
<dt> <code>rational</code>, <code>irrational</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma vari&aacute;vel real e racional ou como uma vari&aacute;vel real e irracional.
</p>
</dd>
<dt> <code>real</code>, <code>imaginary</code>, <code>complex</code></dt>
<dd><p>Dia ao Maxima para reconhecer <var>a_i</var> como uma vari&aacute;vel real, imagin&aacute;ria pura ou complexa.
</p> 
</dd>
<dt> <code>increasing</code>, <code>decreasing</code></dt>
<dd><p>Dia ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o de incremento ou decremento.
</p>
</dd>
<dt> <code>posfun</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o positiva.
</p>
</dd>
<dt> <code>integervalued</code></dt>
<dd><p>Diz ao Maxima para reconhecer <var>a_i</var> como uma fun&ccedil;&atilde;o de valores inteiros.
</p>
</dd>
</dl>

<p>Exemplos:
</p>
<p>Declara&ccedil;&otilde;es <code>evfun</code> e <code>evflag</code>.
</p><pre class="example">(%i1) declare (expand, evfun);
(%o1)                         done
(%i2) (a + b)^3;
                                   3
(%o2)                       (b + a)
(%i3) (a + b)^3, expand;
                     3        2      2      3
(%o3)               b  + 3 a b  + 3 a  b + a
(%i4) declare (demoivre, evflag);
(%o4)                         done
(%i5) exp (a + b*%i);
                             %i b + a
(%o5)                      %e
(%i6) exp (a + b*%i), demoivre;
                      a
(%o6)               %e  (%i sin(b) + cos(b))
</pre>
<p>Declara&ccedil;&atilde;o <code>bindtest</code>.
</p><pre class="example">(%i1) aa + bb;
(%o1)                        bb + aa
(%i2) declare (aa, bindtest);
(%o2)                         done
(%i3) aa + bb;
aa unbound variable
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i4) aa : 1234;
(%o4)                         1234
(%i5) aa + bb;
(%o5)                       bb + 1234
</pre>
<p>Declara&ccedil;&atilde;o <code>noun</code>.
</p><pre class="example">(%i1) factor (12345678);
                             2
(%o1)                     2 3  47 14593
(%i2) declare (factor, noun);
(%o2)                         done
(%i3) factor (12345678);
(%o3)                   factor(12345678)
(%i4) ''%, nouns;
                             2
(%o4)                     2 3  47 14593
</pre>
<p>Declara&ccedil;&otilde;es <code>constant</code>, <code>scalar</code>, <code>nonscalar</code>, e <code>mainvar</code>.
</p>
<p>Declara&ccedil;&atilde;o <code>alphabetic</code>.
</p><pre class="example">(%i1) xx\~yy\`\@ : 1729;
(%o1)                         1729
(%i2) declare (&quot;~`@&quot;, alphabetic);
(%o2)                         done
(%i3) xx~yy`@ + @yy`xx + `xx@@yy~;
(%o3)               `xx@@yy~ + @yy`xx + 1729
(%i4) listofvars (%);
(%o4)                  [@yy`xx, `xx@@yy~]
</pre>
<p>Declara&ccedil;&atilde;o <code>feature</code>.
</p><pre class="example">(%i1) declare (FOO, feature);
(%o1)                         done
(%i2) declare (x, FOO);
(%o2)                         done
(%i3) featurep (x, FOO);
(%o3)                         true
</pre>
<p>Declara&ccedil;&otilde;es <code>rassociative</code> e <code>lassociative</code>.
</p>
<p>Declara&ccedil;&atilde;o <code>nary</code>.
</p><pre class="example">(%i1) H (H (a, b), H (c, H (d, e)));
(%o1)               H(H(a, b), H(c, H(d, e)))
(%i2) declare (H, nary);
(%o2)                         done
(%i3) H (H (a, b), H (c, H (d, e)));
(%o3)                   H(a, b, c, d, e)
</pre>
<p>Declara&ccedil;&otilde;es <code>symmetric</code> e <code>antisymmetric</code>.
</p><pre class="example">(%i1) S (b, a);
(%o1)                        S(b, a)
(%i2) declare (S, symmetric);
(%o2)                         done
(%i3) S (b, a);
(%o3)                        S(a, b)
(%i4) S (a, c, e, d, b);
(%o4)                   S(a, b, c, d, e)
(%i5) T (b, a);
(%o5)                        T(b, a)
(%i6) declare (T, antisymmetric);
(%o6)                         done
(%i7) T (b, a);
(%o7)                       - T(a, b)
(%i8) T (a, c, e, d, b);
(%o8)                   T(a, b, c, d, e)
</pre>
<p>Declara&ccedil;&otilde;es <code>oddfun</code> e <code>evenfun</code>.
</p><pre class="example">(%i1) o (- u) + o (u);
(%o1)                     o(u) + o(- u)
(%i2) declare (o, oddfun);
(%o2)                         done
(%i3) o (- u) + o (u);
(%o3)                           0
(%i4) e (- u) - e (u);
(%o4)                     e(- u) - e(u)
(%i5) declare (e, evenfun);
(%o5)                         done
(%i6) e (- u) - e (u);
(%o6)                           0
</pre>
<p>Declara&ccedil;&atilde;o <code>outative</code>.
</p><pre class="example">(%i1) F1 (100 * x);
(%o1)                       F1(100 x)
(%i2) declare (F1, outative);
(%o2)                         done
(%i3) F1 (100 * x);
(%o3)                       100 F1(x)
(%i4) declare (zz, constant);
(%o4)                         done
(%i5) F1 (zz * y);
(%o5)                       zz F1(y)
</pre>
<p>Declara&ccedil;&atilde;o <code>multiplicative</code>.
</p><pre class="example">(%i1) F2 (a * b * c);
(%o1)                       F2(a b c)
(%i2) declare (F2, multiplicative);
(%o2)                         done
(%i3) F2 (a * b * c);
(%o3)                   F2(a) F2(b) F2(c)
</pre>
<p>Declara&ccedil;&atilde;o <code>additive</code>.
</p><pre class="example">(%i1) F3 (a + b + c);
(%o1)                     F3(c + b + a)
(%i2) declare (F3, additive);
(%o2)                         done
(%i3) F3 (a + b + c);
(%o3)                 F3(c) + F3(b) + F3(a)
</pre>
<p>Declara&ccedil;&atilde;o <code>linear</code>.
</p><pre class="example">(%i1) 'sum (F(k) + G(k), k, 1, inf);
                       inf
                       ====
                       \
(%o1)                   &gt;    (G(k) + F(k))
                       /
                       ====
                       k = 1
(%i2) declare (nounify (sum), linear);
(%o2)                         done
(%i3) 'sum (F(k) + G(k), k, 1, inf);
                     inf          inf
                     ====         ====
                     \            \
(%o3)                 &gt;    G(k) +  &gt;    F(k)
                     /            /
                     ====         ====
                     k = 1        k = 1
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>disolate</b><i> (<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</i>
<a name="IDX143"></a>
</dt>
<dd><p>&eacute; similar a <code>isolate (<var>expr</var>, <var>x</var>)</code>
exceto que essa fun&ccedil;&atilde;o habilita ao usu&aacute;rio isolar
mais que uma vari&aacute;vel simult&acirc;neamente.  Isso pode ser &uacute;til, por
exemplo, se se tiver tentado mudar vari&aacute;veis em uma integra&ccedil;&atilde;o
m&uacute;ltipla, e em mudan&ccedil;a de vari&aacute;vel envolvendo duas ou mais das
vari&aacute;veis de integra&ccedil;&atilde;o.  Essa fun&ccedil;&atilde;o &eacute; chamada automaticamente de
<tt>`simplification/disol.mac'</tt>.  Uma demostra&ccedil;&atilde;o est&aacute; dispon&iacute;vel atrav&eacute;s de
<code>demo(&quot;disol&quot;)$</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>dispform</b><i> (<var>expr</var>)</i>
<a name="IDX144"></a>
</dt>
<dd><p>Retorna a representa&ccedil;&atilde;o externa de <var>expr</var> com rela&ccedil;&atilde;o a seu
principal operador.  Isso pode ser &uacute;til em conjun&ccedil;&atilde;o com <code>part</code> que
tamb&eacute;m lida com a representa&ccedil;&atilde;o externa.  Suponha que <var>expr</var> seja -A .
Ent&atilde;o a representa&ccedil;&atilde;o interna de <var>expr</var> &eacute;  &quot;*&quot;(-1,A), enquanto que
a representa&ccedil;&atilde;o externa &eacute; &quot;-&quot;(A). <code>dispform (<var>expr</var>, all)</code> converte a
express&atilde;o inteira (n&atilde;o apenas o n&iacute;vel mais alto) para o formato externo.  Por
exemplo, se <code>expr: sin (sqrt (x))</code>, ent&atilde;o <code>freeof (sqrt, expr)</code> e
<code>freeof (sqrt, dispform (expr))</code> fornece <code>true</code>, enquanto
<code>freeof (sqrt, dispform (expr, all))</code> fornece <code>false</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>distrib</b><i> (<var>expr</var>)</i>
<a name="IDX145"></a>
</dt>
<dd><p>Distribue adi&ccedil;&otilde;es sobre produtos.  <code>distrib</code> difere de <code>expand</code>
no fato de que <code>distrib</code> trabalha em somente no n&iacute;vel mais alto de uma express&atilde;o, i.e., <code>distrib</code> n&atilde;o
&eacute; recursiva e <code>distrib</code> &eacute; mais r&aacute;pida que <code>expand</code>.  <code>distrib</code> difere de <code>multthru</code> no
que <code>distrib</code> expande todas as adi&ccedil;&otilde;es naquele n&iacute;vel.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) distrib ((a+b) * (c+d));
(%o1)                 b d + a d + b c + a c
(%i2) multthru ((a+b) * (c+d));
(%o2)                 (b + a) d + (b + a) c
(%i3) distrib (1/((a+b) * (c+d)));
                                1
(%o3)                    ---------------
                         (b + a) (d + c)
(%i4) expand (1/((a+b) * (c+d)), 1, 0);
                                1
(%o4)                 ---------------------
                      b d + a d + b c + a c
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>dpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX146"></a>
</dt>
<dd><p>Seleciona a mesma subexpress&atilde;o que <code>part</code>, mas
em lugar de apenas retornar aquela subexpress&atilde;o como seu valor, isso retorna
a express&atilde;o completa com a subexpress&atilde;o selecionada mostrada dentro
de uma caixa.  A caixa &eacute; atualmente parte da express&atilde;o.
</p>
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>exp</b><i> (<var>x</var>)</i>
<a name="IDX147"></a>
</dt>
<dd><p>Representa fun&ccedil;&atilde;o exponencial.  
Inst&acirc;ncias de <code>exp (<var>x</var>)</code> em uma entrada s&atilde;o simplificadas para <code>%e^<var>x</var></code>;
<code>exp</code> n&atilde;o aparece em express&otilde;es simplificadas.
</p>
<p><code>demoivre</code> se <code>true</code> faz com que <code>%e^(a + b %i)</code> simplificar para
<code>%e^(a (cos(b) + %i sin(b)))</code> se <code>b</code> for livre de <code>%i</code>. veja <code>demoivre</code>.
</p>
<p><code>%emode</code>, quando <code>true</code>, 
faz com que <code>%e^(%pi %i x)</code> seja simplificado. Veja <code>%emode</code>.
</p>
<p><code>%enumer</code>, quando <code>true</code> faz com que <code>%e</code> seja substitu&iacute;do por
2.718...  quando <code>numer</code> for <code>true</code>. Veja <code>%enumer</code>.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>%emode</b>
<a name="IDX148"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>true</code>
</p>
<p>Quando <code>%emode</code> for <code>true</code>,
<code>%e^(%pi %i x)</code> &eacute; simplificado como
segue.
</p>
<p><code>%e^(%pi %i x)</code> simplifica para <code>cos (%pi x) + %i sin (%pi x)</code> se <code>x</code> for um inteiro ou
um multiplo de 1/2, 1/3, 1/4, ou 1/6, e ent&atilde;o &eacute; adicionalmente simplificado.
</p>
<p>Para outro <code>x</code> num&eacute;rico,
<code>%e^(%pi %i x)</code> simplifica para <code>%e^(%pi %i y)</code> onde <code>y</code> &eacute; <code>x - 2 k</code>
para algum inteiro <code>k</code> tal que <code>abs(y) &lt; 1</code>.  
</p>
<p>Quando <code>%emode</code> for <code>false</code>, nenhuma
simplifica&ccedil;&atilde;o adicional de <code>%e^(%pi %i x)</code> &eacute; realizada.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>%enumer</b>
<a name="IDX149"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p>Quando <code>%enumer</code> for <code>true</code>,
<code>%e</code> &eacute; substituido por seu valor num&eacute;rico
2.718...  mesmo que <code>numer</code> seja <code>true</code>. 
</p>
<p>Quando <code>%enumer</code> for <code>false</code>, essa substitui&ccedil;&atilde;o &eacute; realizada
somente se o expoente em <code>%e^x</code> avaliar para um n&uacute;mero.
</p>
<p>Veja tamb&eacute;m <code>ev</code> e <code>numer</code>.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>exptisolate</b>
<a name="IDX150"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p><code>exptisolate</code>, quando <code>true</code>, faz com que <code>isolate (expr, var)</code>
examine expoentes de &aacute;tomos (tais como <code>%e</code>) que contenham <code>var</code>.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>exptsubst</b>
<a name="IDX151"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p><code>exptsubst</code>, quando <code>true</code>, permite substitui&ccedil;&otilde;es tais como <code>y</code>
para <code>%e^x</code> em <code>%e^(a x)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>freeof</b><i> (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</i>
<a name="IDX152"></a>
</dt>
<dd><p><code>freeof (<var>x_1</var>, <var>expr</var>)</code>
Retorna <code>true</code>
se nenhuma subexpress&atilde;o de <var>expr</var> for igual a <var>x_1</var>
ou se <var>x_1</var> ocorrer somente uma vari&aacute;vel que n&atilde;o tenha associa&ccedil;&atilde;o fora da express&atilde;o <var>expr</var>,
e retorna <code>false</code> de outra forma.
</p>
<p><code>freeof (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code>
&eacute; equivalente a <code>freeof (<var>x_1</var>, <var>expr</var>) and ... and freeof (<var>x_n</var>, <var>expr</var>)</code>.
</p>
<p>Os argumentos <var>x_1</var>, ..., <var>x_n</var> 
podem ser nomes de fun&ccedil;&otilde;es e vari&aacute;veis, nomes subscritos,
operadores (empacotados em aspas duplas), ou express&otilde;es gerais.
<code>freeof</code> avalia seus argumentos.
</p>
<p><code>freeof</code> opera somente sobre <var>expr</var> como isso representa (ap&oacute;s simplifica&ccedil;&atilde;o e avalia&ccedil;&atilde;o) e
n&atilde;o tenta determinar se alguma express&atilde;o equivalente pode fornecer um resultado diferente.
Em particular, simplifica&ccedil;&atilde;o pode retornar uma express&atilde;o equivalente mas diferente que compreende
alguns diferentes elementos da forma original de <var>expr</var>.
</p>
<p>Uma vari&aacute;vel &eacute; uma vari&aacute;vel dummy em uma express&atilde;o se n&atilde;o tiver associa&ccedil;&atilde;o fora da express&atilde;o.
Vari&aacute;veis dummy recoreconhecidas atrav&eacute;s de <code>freeof</code> s&atilde;o
o &iacute;ndice de um somat&oacute;rio ou produt&oacute;rio, o limite da vari&aacute;vel em <code>limit</code>,
a vari&aacute;vel de integra&ccedil;&atilde;o na forma de integral definida de <code>integrate</code>,
a vari&aacute;vel original em <code>laplace</code>,
vari&aacute;veis formais em expressoes <code>at</code>,
e argumentos em express&otilde;es <code>lambda</code>.
Vari&aacute;veis locais em <code>block</code> n&atilde;o s&atilde;o reconhecidas por <code>freeof</code> como vari&aacute;veis dummy;
isso &eacute; um bug.
</p>
<p>A forma indefinida de <code>integrate</code> <i>not</i> &eacute; livre de suas vari&aacute;veis de integra&ccedil;&atilde;o.
</p>
<ul>
<li>
Argumentos s&atilde;o nomes de fun&ccedil;&otilde;es, vari&aacute;veis, nomes subscritos, operadores, e express&otilde;es.
<code>freeof (a, b, expr)</code> &eacute; equivalente a
<code>freeof (a, expr) and freeof (b, expr)</code>.

<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
(%i2) freeof (z, expr);
(%o2)                         false
(%i3) freeof (cos, expr);
(%o3)                         false
(%i4) freeof (a[1], expr);
(%o4)                         false
(%i5) freeof (cos (a[1]), expr);
(%o5)                         false
(%i6) freeof (b^(c+d), expr);
(%o6)                         false
(%i7) freeof (&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof (w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre>
</li><li>
<code>freeof</code> avalia seus argumentos.

<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof (c, expr);
(%o3)                         false
</pre>
</li><li>
<code>freeof</code> n&atilde;o considera express&otilde;es equivalentes.
Simplifica&ccedil;&atilde;o pode retornar uma express&atilde;o equivalente mas diferente.

<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand (expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof (a+b, %);
(%o3)                         true
(%i4) freeof (a+b, expr);
(%o4)                         false
(%i5) exp (x);
                                 x
(%o5)                          %e
(%i6) freeof (exp, exp (x));
(%o6)                         true
</pre>
</li><li> Um somat&oacute;rio ou uma integral definida est&aacute; livre de uma vari&aacute;vel dummy.
Uma integral indefinida n&atilde;o &eacute; livre de suas vari&aacute;veis de integra&ccedil;&atilde;o.

<pre class="example">(%i1) freeof (i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof (x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof (x, 'integrate (x^2, x));
(%o3)                         false
</pre></li></ul>

</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>genfact</b><i> (<var>x</var>, <var>y</var>, <var>z</var>)</i>
<a name="IDX153"></a>
</dt>
<dd><p>Retorna o fatorial generalizado, definido como
<code>x (x-z) (x - 2 z) ... (x - (y - 1) z)</code>.  Dessa forma, para integral <var>x</var>,
<code>genfact (x, x, 1) = x!</code> e <code>genfact (x, x/2, 2) = x!!</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>imagpart</b><i> (<var>expr</var>)</i>
<a name="IDX154"></a>
</dt>
<dd><p>Retorna a parte imagin&aacute;ria da express&atilde;o <var>expr</var>.
</p>
<p><code>imagpart</code> &eacute; uma fun&ccedil;&atilde;o computacional,
n&atilde;o uma fun&ccedil;&atilde;o de simplifica&ccedil;&atilde;o.
</p>
<p>Veja tamb&eacute;m <code>abs</code>, <code>carg</code>, <code>polarform</code>, <code>rectform</code>,
e <code>realpart</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>infix</b><i> (<var>op</var>)</i>
<a name="IDX155"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>infix</b><i> (<var>op</var>, <var>lbp</var>, <var>rbp</var>)</i>
<a name="IDX156"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>infix</b><i> (<var>op</var>, <var>lbp</var>, <var>rbp</var>, <var>lpos</var>, <var>rpos</var>, <var>pos</var>)</i>
<a name="IDX157"></a>
</dt>
<dd><p>Declara <var>op</var> para ser um operador infixo.
Um operador infixo &eacute; uma fun&ccedil;&atilde;o de dois argumentos,
com o nome da fun&ccedil;&atilde;o escrito entre os argumentos.
Por exemplo, o operador de subtra&ccedil;&atilde;o <code>-</code> &eacute; um operador infixo.
</p>
<p><code>infix (<var>op</var>)</code> declara <var>op</var> para ser um operador infixo
com expoentes associados padr&atilde;o (esquerdo e direito ambos iguais a 180)
e podendo ser qualquer entre prefixado, infixado, posfixado, n&aacute;rio, 
matchfix e nofix (esquerdo e direito ambos iguais a <code>any</code>).
</p>
<p><code>infix (<var>op</var>, <var>lbp</var>, <var>rbp</var>)</code> declara <var>op</var> para ser um operador infixo
com expoentes associados esquerdo e diretio equilibrados
e podendo ser qualquer entre prefixado, infixado, posfixado, n&aacute;rio, 
matchfix e nofix (esquerdo e direito ambos iguais a <code>any</code>).
</p>
<p><code>infix (<var>op</var>, <var>lbp</var>, <var>rbp</var>, <var>lpos</var>, <var>rpos</var>, <var>pos</var>)</code>
declara <var>op</var> para ser um operdor infixo
com expoentes associados padr&atilde;o e podendo ser um entre 
prefixado, infixado, posfixado, n&aacute;rio, matchfix e nofix.
</p>
<p>A preced&ecirc;ncia de <var>op</var> com rela&ccedil;&atilde;o a outros operadores
derivam dos expoentes associados diretiro e esquerdo dos operadores em quest&atilde;o.
Se os expoentes associados esquerdo e direito de <var>op</var> forem ambos maiores
que o expoente associado esquerdo e o direito de algum outro operador,
ent&atilde;o <var>op</var> tem preded&ecirc;ncia sobre o outro operador.
Se os expoentes associados n&atilde;o forem ambos maior ou menor,
alguma rela&ccedil;&atilde;o mais complicada ocorre.
</p>
<p>A associatividade de <var>op</var> depende de seus expoentes associados.
Maior expoente associado esquerdo (<var>eae</var>) implica uma inst&acirc;ncia de
<var>op</var> &eacute; avaliadas antes de outros operadores para sua esquerda em uma express&atilde;o,
enquanto maior expoente associado direito (<var>ead</var>) implica uma inst&acirc;ncia de
<var>op</var> &eacute; avaliada antes de outros operadores para sua direita em uma express&atilde;o.
Dessa forma maior <var>eae</var> torna <var>op</var> associativo &agrave; direita,
enquanto maior <var>ead</var> torna <var>op</var> associativa &agrave; esquerda.
Se <var>eae</var> for igual a <var>ead</var>, <var>op</var> &eacute; associativa &agrave; esquerda.
</p>
<p>Veja tamb&eacute;m <code>Syntax</code>.
</p>
<p>Exemplos:
</p>
<p>Se os expoentes associados esquerdo e direito de <var>op</var> forem ambos maiores
que os expoentes associados &agrave; direita e &agrave; esquerda de algum outro operador,
ent&atilde;o <var>op</var> tem preced&ecirc;ncia sobre o outro operador.
</p>
<pre class="example">(%i1) :lisp (get '$+ 'lbp)
100
(%i1) :lisp (get '$+ 'rbp)
100
(%i1) infix (&quot;##&quot;, 101, 101);
(%o1)                          ##
(%i2) &quot;##&quot;(a, b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;);
(%o2)       (a ## b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;)
(%i3) 1 + a ## b + 2;
(%o3)                       (a,b) + 3
(%i4) infix (&quot;##&quot;, 99, 99);
(%o4)                          ##
(%i5) 1 + a ## b + 2;
(%o5)                       (a+1,b+2)
</pre>
<p>grande <var>eae</var> torna <var>op</var> associativa &agrave; direita,
enquanto grande <var>ead</var> torna <var>op</var> associativa &agrave; esquerda.
</p>
<pre class="example">(%i1) infix (&quot;##&quot;, 100, 99);
(%o1)                          ##
(%i2) &quot;##&quot;(a, b) := sconcat(&quot;(&quot;, a, &quot;,&quot;, b, &quot;)&quot;)$
(%i3) foo ## bar ## baz;
(%o3)                    (foo,(bar,baz))
(%i4) infix (&quot;##&quot;, 100, 101);
(%o4)                          ##
(%i5) foo ## bar ## baz;
(%o5)                    ((foo,bar),baz)
</pre>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>inflag</b>
<a name="IDX158"></a>
</dt>
<dd><p>Velor padr&atilde;o: <code>false</code>
</p>
<p>Quando <code>inflag</code> for <code>true</code>, fun&ccedil;&otilde;es para extra&ccedil;&atilde;o de
partes inspecionam a forma interna de <code>expr</code>.
</p>
<p>Note que o simplificador re-organiza express&otilde;es.
Dessa forma <code>first (x + y)</code> retorna <code>x</code> se <code>inflag</code>
for <code>true</code> e <code>y</code> se <code>inflag</code> for <code>false</code>.
(<code>first (y + x)</code> fornece os mesmos resultados.)
</p>
<p>Tamb&eacute;m, escolhendo <code>inflag</code> para <code>true</code> e chamando <code>part</code> ou <code>substpart</code> &eacute;
o mesmo que chamar <code>inpart</code> ou <code>substinpart</code>.
</p>
<p>As fun&ccedil;&otilde;es afetadas pela posi&ccedil;&atilde;o do sinalizador <code>inflag</code> s&atilde;o:
<code>part</code>, <code>substpart</code>, <code>first</code>, <code>rest</code>, <code>last</code>, <code>length</code>,
a estrutura <code>for</code> ... <code>in</code>,
<code>map</code>, <code>fullmap</code>, <code>maplist</code>, <code>reveal</code> e <code>pickapart</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>inpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX159"></a>
</dt>
<dd><p>&Eacute; similar a <code>part</code> mas trabalha sobre a representa&ccedil;&atilde;o
interna da express&atilde;o em lugar da forma de exibi&ccedil;&atilde;o e
dessa forma pode ser mais r&aacute;pida uma vez que nenhuma formata&ccedil;&atilde;o &eacute; realizada.  Cuidado deve ser tomado
com rela&ccedil;&atilde;o &agrave; ordem de subexpress&otilde;es em adi&ccedil;&otilde;es e produtos
(uma vez que a ordem das vari&aacute;veis na forma interna &eacute; muitas vezes diferente
daquela na forma mostrada) e no manuseio com menos un&aacute;rio,
subtra&ccedil;&atilde;o, e divis&atilde;o (uma vez que esses operadores s&atilde;o removidos da
express&atilde;o). <code>part (x+y, 0)</code> ou <code>inpart (x+y, 0)</code> retorna <code>+</code>, embora com o objetivo de
referirse ao operador isso deva ser abra&ccedil;ado por aspas duplas.  Por exemplo
<code>... if inpart (%o9,0) = &quot;+&quot; then ...</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>isolate</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX160"></a>
</dt>
<dd><p>Retorna <var>expr</var> com subexpress&otilde;es que s&atilde;o adi&ccedil;&otilde;es e
que n&atilde;o possuem <var>x</var> substituido por r&oacute;tulos de express&atilde;o intermedi&aacute;ria
(esses sendo s&iacute;mbolos at&ocirc;micos como <code>%t1</code>, <code>%t2</code>, ...).  Isso &eacute; muitas vezes &uacute;til
para evitar expans&otilde;es desnecess&aacute;rias de subexpress&otilde;es que n&atilde;o possuam
a vari&aacute;vel de interesse.  Uma vez que os r&oacute;tulos intermedi&aacute;rios s&atilde;o associados &agrave;s
subexpress&otilde;es eles podem todos ser substitu&iacute;dos de volta por avalia&ccedil;&atilde;o da
express&atilde;o em que ocorrerem.
</p>
<p><code>exptisolate</code> (valor padr&atilde;o: <code>false</code>) se <code>true</code> far&aacute; com que <code>isolate</code> examine expoentes de
&aacute;tomos (como <code>%e</code>) que contenham <var>x</var>.
</p>
<p><code>isolate_wrt_times</code> se <code>true</code>, ent&atilde;o <code>isolate</code> ir&aacute; tamb&eacute;m isolar com rela&ccedil;&atilde;o a 
produtos. Veja <code>isolate_wrt_times</code>.
</p>
<p>Fa&ccedil;a <code>example (isolate)</code> para exemplos.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>isolate_wrt_times</b>
<a name="IDX161"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p>Quando <code>isolate_wrt_times</code> for <code>true</code>, <code>isolate</code>
ir&aacute; tamb&eacute;m isolar com rela&ccedil;&atilde;o a produtos.  E.g. compare ambas as escolhas do
comutador em
</p>
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>listconstvars</b>
<a name="IDX162"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p>Quando <code>listconstvars</code> for <code>true</code>, isso far&aacute; com que <code>listofvars</code>
inclua <code>%e</code>, <code>%pi</code>, <code>%i</code>, e quaisquer vari&aacute;veis declaradas contantes na lista
seja retornado se aparecer na express&atilde;o que chamar <code>listofvars</code>.
O comportamento padr&atilde;o &eacute; omitir isso.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>listdummyvars</b>
<a name="IDX163"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>true</code>
</p>
<p>Quando <code>listdummyvars</code> for <code>false</code>, &quot;vari&aacute;veis dummy&quot; na
express&atilde;o n&atilde;o ser&atilde;o inclu&iacute;das na lista retornada por <code>listofvars</code>.
(O significado de &quot;vari&aacute;vel dummy&quot; &eacute; o mesmo que em <code>freeof</code>.
&quot;Vari&aacute;veis dummy&quot; s&atilde;o conceitos matem&aacute;ticos como o &iacute;ndice de um somat&oacute;rio ou
produt&oacute;rio, a vari&aacute;vel limite, e a vari&aacute;vel da integral definida.)
Exemplo:
</p>
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>listofvars</b><i> (<var>expr</var>)</i>
<a name="IDX164"></a>
</dt>
<dd><p>Retorna uma lista de vari&aacute;veis em <var>expr</var>.
</p>
<p><code>listconstvars</code> se <code>true</code> faz com que <code>listofvars</code> inclua <code>%e</code>, <code>%pi</code>,
<code>%i</code>, e quaisquer vari&aacute;veis declaradas constantes na lista &eacute; retornada se
aparecer em <var>expr</var>.  O comportamento padr&atilde;o &eacute; omitir isso.
</p>
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>lfreeof</b><i> (<var>lista</var>, <var>expr</var>)</i>
<a name="IDX165"></a>
</dt>
<dd><p>Para cada um dos membros <var>m</var> de lista, chama <code>freeof (<var>m</var>, <var>expr</var>)</code>.
Retorna <code>false</code> se qualquer chamada a <code>freeof</code> for feita e <code>true</code> de outra forma.
</p></dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>lopow</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX166"></a>
</dt>
<dd><p>Retorna o menor expoente de <var>x</var> que explicitamente aparecer em
<var>expr</var>.  Dessa forma
</p>
<pre class="example">(%i1) lopow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       min(a, 2)
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>lpart</b><i> (<var>r&oacute;tulo</var>, <var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX167"></a>
</dt>
<dd><p>&eacute; similar a <code>dpart</code> mas usa uma
caixa rotulada. Uma moldura rotulada &eacute; similar &agrave; que &eacute; produzida por <code>dpart</code>
mas a produzida por <code>lpart</code> tem o nome na linha do topo.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>multthru</b><i> (<var>expr</var>)</i>
<a name="IDX168"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>multthru</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX169"></a>
</dt>
<dd><p>Multiplica um fator (que pode ser uma adi&ccedil;&atilde;o) de <var>expr</var> pelos
outros fatores de <var>expr</var>.  Isto &eacute;, <var>expr</var> &eacute; <code><var>f_1</var> <var>f_2</var> ... <var>f_n</var></code>
onde ao menos
um fator, digamos <var>f_i</var>, &eacute; uma soma de termos.  Cada termo naquela soma &eacute;
multiplicado por outros fatores no produto.  (A saber todos os
fatores exceto <var>f_i</var>).  <code>multthru</code> n&atilde;o expande somas exponenciais.
Essa fun&ccedil;&atilde;o &eacute; o caminho mais r&aacute;pido para distribuir produtos (comutativos
ou n&atilde;o) sobre adi&ccedil;&otilde;es.  Uma vez que quocientes s&atilde;o representados como
produtos <code>multthru</code> podem ser usados para dividir adi&ccedil;&otilde;es por produtos tamb&eacute;m.
</p>
<p><code>multthru (<var>expr_1</var>, <var>expr_2</var>)</code> multiplica cada termo em <var>expr_2</var> (que pode ser uma
adi&ccedil;&atilde;o ou uma equ&ccedil;&atilde;o) por <var>expr_1</var>.  Se <var>expr_1</var> n&atilde;o for por si mesmo uma adi&ccedil;&atilde;o ent&atilde;o essa
forma &eacute; equivalente a <code>multthru (<var>expr_1</var>*<var>expr_2</var>)</code>.
</p>
<pre class="example">(%i1) x/(x-y)^2 - 1/(x-y) - f(x)/(x-y)^3;
                      1        x         f(x)
(%o1)             - ----- + -------- - --------
                    x - y          2          3
                            (x - y)    (x - y)
(%i2) multthru ((x-y)^3, %);
                           2
(%o2)             - (x - y)  + x (x - y) - f(x)
(%i3) ratexpand (%);
                           2
(%o3)                   - y  + x y - f(x)
(%i4) ((a+b)^10*s^2 + 2*a*b*s + (a*b)^2)/(a*b*s^2);
                        10  2              2  2
                 (b + a)   s  + 2 a b s + a  b
(%o4)            ------------------------------
                                  2
                             a b s
(%i5) multthru (%);  /* note que isso n&atilde;o expande (b+a)^10 */
                                        10
                       2   a b   (b + a)
(%o5)                  - + --- + ---------
                       s    2       a b
                           s
(%i6) multthru (a.(b+c.(d+e)+f));
(%o6)            a . f + a . c . (e + d) + a . b
(%i7) expand (a.(b+c.(d+e)+f));
(%o7)         a . f + a . c . e + a . c . d + a . b
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>nounify</b><i> (<var>f</var>)</i>
<a name="IDX170"></a>
</dt>
<dd><p>Retorna a forma substantiva do nome da fun&ccedil;&atilde;o <var>f</var>.  Isso &eacute;
necess&aacute;rio se se quer referir ao nome de uma fun&ccedil;&atilde;o verbo como se esse nome
fosse um substantivo.  Note que algumas fun&ccedil;&otilde;es verbos ir&atilde;o retornar sua forma
substantiva sen&atilde;o puderem ser avaliadas para certos argumentos.  A forma substantiva &eacute; tamb&eacute;m
a forma retornada se uma chamada de fun&ccedil;&atilde;o &eacute; precedida por um ap&oacute;strofo.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>nterms</b><i> (<var>expr</var>)</i>
<a name="IDX171"></a>
</dt>
<dd><p>Retorna o n&uacute;mero de termos que <var>expr</var> pode ter se for
completamente expandida e nenhum cancelamento ou combina&ccedil;&atilde;o de termos
acontecer.
Note express&otilde;es como <code>sin (<var>expr</var>)</code>, <code>sqrt (<var>expr</var>)</code>, <code>exp (<var>expr</var>)</code>, etc.
contam como apenas um termo independentemente de quantos termos <var>expr</var> tenha (se <var>expr</var> for uma
adi&ccedil;&atilde;o).
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>op</b><i> (<var>expr</var>)</i>
<a name="IDX172"></a>
</dt>
<dd><p>Retorna o operador principal da express&atilde;o <var>expr</var>.
<code>op (<var>expr</var>)</code> &eacute; equivalente a <code>part (<var>expr</var>, 0)</code>. 
</p>
<p><code>op</code> retorna uma seq&uuml;&ecirc;ncia de caracteres se o operador principal for uma
operador interno ou definido pelo usu&aacute;rio como
prefixado, bin&aacute;rio ou n-&aacute;rio infixo, posfixado, matchfix ou nofix.
De outra forma, se <var>expr</var> for uma express&atilde;o de fun&ccedil;&atilde;o subscrita,
<code>op</code> retorna uma fun&ccedil;&atilde;o subscrita;
nesse caso o valor de retorno n&atilde;o &eacute; um &aacute;tomo.
De outro modo, <var>expr</var> &eacute; uma fun&ccedil;&atilde;o de array ou uma express&atilde;o de fun&ccedil;&atilde;o comum,
e <code>op</code> retorna um s&iacute;mbolo.
</p>
<p><code>op</code> observa o valor do sinalizador global <code>inflag</code>.
</p>
<p><code>op</code> avalia seus argumentos.
</p>
<p>Veja tamb&eacute;m <code>args</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>operatorp</b><i> (<var>expr</var>, <var>op</var>)</i>
<a name="IDX173"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>operatorp</b><i> (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</i>
<a name="IDX174"></a>
</dt>
<dd><p><code>operatorp (<var>expr</var>, <var>op</var>)</code> retorna <code>true</code>
se <var>op</var> for igual ao operador de <var>expr</var>.
</p>
<p><code>operatorp (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> retorna <code>true</code>
se algum elementos de <var>op_1</var>, ..., <var>op_n</var> for igual ao operador de <var>expr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>optimize</b><i> (<var>expr</var>)</i>
<a name="IDX175"></a>
</dt>
<dd><p>Retorna uma express&atilde;o que produz o mesmo valor e
efeito que <var>expr</var> mas faz de forma mais eficientemente por evitar a
recomputa&ccedil;&atilde;o de subexpress&otilde;es comuns.  <code>optimize</code> tamb&eacute;m tem o mesmo
efeito de &quot;colapsar&quot; seus argumentos de forma que todas as subexpress&otilde;es comuns
s&atilde;o compartilhadas.
Fa&ccedil;a <code>example (optimize)</code> para exemplos.
</p>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>optimprefix</b>
<a name="IDX176"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>%</code>
</p>
<p><code>optimprefix</code> &eacute; o prefixo usado para s&iacute;mbolos gerados pelo
comando <code>optimize</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>ordergreat</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX177"></a>
</dt>
<dd><p>Escolhe aliases para as vari&aacute;veis <var>v_1</var>, ..., <var>v_n</var>
tais que <var>v_1</var> &gt; <var>v_2</var> &gt; ...  &gt; <var>v_n</var>,
e <var>v_n</var> &gt; qualquer outra vari&aacute;vel n&atilde;o mencionada como um
argumento.
</p>
<p>Veja tamb&eacute;m <code>orderless</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>ordergreatp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX178"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr_2</var> precede <var>expr_1</var> na
ordena&ccedil;&atilde;o escolhida com a fun&ccedil;&atilde;o <code>ordergreat</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>orderless</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX179"></a>
</dt>
<dd><p>Escolhe aliases para as vari&aacute;veis <var>v_1</var>, ..., <var>v_n</var>
tais que <var>v_1</var> &lt; <var>v_2</var> &lt; ...  &lt; <var>v_n</var>,
and <var>v_n</var> &lt; qualquer outra vari&aacute;vel n&atilde;o mencionada como um
argumento.
</p>
<p>Dessa forma a escala de ordena&ccedil;&atilde;o completa &eacute;: constantes num&eacute;ricas &lt;
constantes declaradas &lt; escalares declarados &lt; primeiro argumento para <code>orderless</code> &lt;
...  &lt; &uacute;ltimo argumento para <code>orderless</code> &lt; vari&aacute;veis que come&ccedil;am com A &lt; ...
&lt; vari&aacute;veis que come&ccedil;am com Z &lt; &uacute;ltimo argumento para <code>ordergreat</code> &lt;
 ... &lt; primeiro argumento para <code>ordergreat</code> &lt; <code>mainvar</code>s - vari&aacute;veis principais declaradas.
</p>
<p>Veja tamb&eacute;m <code>ordergreat</code> e <code>mainvar</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>orderlessp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX180"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr_1</var> precede <var>expr_2</var> na
ordena&ccedil;&atilde;o escolhida pelo comando <code>orderless</code>.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>part</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX181"></a>
</dt>
<dd><p>Retorna partes da forma exibida de <code>expr</code>. Essa fun&ccedil;&atilde;o
obt&eacute;m a parte de <code>expr</code> como especificado pelos &iacute;ndices <var>n_1</var>, ..., <var>n_k</var>.  A primeira
parte <var>n_1</var> de <code>expr</code> &eacute; obtida, ent&atilde;o a parte <var>n_2</var> daquela  &eacute; obtida, etc.  O resultado &eacute;
parte <var>n_k</var> de ... parte <var>n_2</var> da parte <var>n_1</var> da <code>expr</code>.
</p>
<p><code>part</code> pode ser usada para obter um elemento de uma lista, uma linha de uma matriz, etc.
</p>
<p>Se o &uacute;ltimo argumento para uma fun&ccedil;&atilde;o <code>part</code> for uma lista de &iacute;ndices ent&atilde;o
muitas subexpress&otilde;es ser&atilde;o pin&ccedil;adas, cada uma correspondendo a um
&iacute;ndice da lista.  Dessa forma <code>part (x + y + z, [1, 3])</code> &eacute; <code>z+x</code>.
</p>
<p><code>piece</code> mant&eacute;m a &uacute;ltima express&atilde;o selecionada quando usando as fun&ccedil;&otilde;es
<code>part</code>.  Isso &eacute; escolhido durante a execu&ccedil;&atilde;o da fun&ccedil;&atilde;o e dessa forma
pode referir-se &agrave; fun&ccedil;&atilde;o em si mesma como mostrado abaixo.
</p>
<p>Se <code>partswitch</code> for escolhido para <code>true</code> ent&atilde;o <code>end</code> &eacute; retornado quando uma
parte selecionada de uma express&atilde;o n&atilde;o existir, de outra forma uma mensagem de
erro &eacute; forncecida.
</p>

<p>Exemplo: <code>part (z+2*y, 2, 1)</code> retorna 2.
</p>
<p><code>example (part)</code> mostra exemplos adicionais.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>partition</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX182"></a>
</dt>
<dd><p>Retorna uma lista de duas express&otilde;es.  Elas s&atilde;o (1)
os fatores de <var>expr</var> (se essa express&atilde;o for um produto), os termos de <var>expr</var> (se isso for uma
adi&ccedil;&atilde;o), ou a lista (se isso for uma lsita) que n&atilde;o contiver <code>var</code> e, (2)
os fatores, termos, ou lista que faz.
</p>
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de op&ccedil;&atilde;o:</u> <b>partswitch</b>
<a name="IDX183"></a>
</dt>
<dd><p>Valor padr&atilde;o: <code>false</code>
</p>
<p>Quando <code>partswitch</code> for <code>true</code>, <code>end</code> &eacute; retornado
quando uma parte selecionada de uma express&atilde;o n&atilde;o existir, de outra forma uma
mensagem de erro &eacute; fornecida.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>pickapart</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX184"></a>
</dt>
<dd><p>Atribui r&oacute;tulos de express&atilde;o intermedi&aacute;ria a subexpress&otilde;es de
<var>expr</var> de comprimento <var>n</var>, um inteiro.
A subexpress&otilde;es maiores ou menores n&atilde;o s&atilde;o atribuidos r&oacute;tulos.
<code>pickapart</code> retorna uma express&atilde;o em termos de express&otilde;es intermedi&aacute;rias
equivalentes &agrave; express&atilde;o original <var>expr</var>.
</p>
<p>Veja tamb&eacute;m <code>part</code>, <code>dpart</code>, <code>lpart</code>, <code>inpart</code>, e <code>reveal</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%i2) pickapart (expr, 0);

                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2

(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)

                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre>
</dd></dl>

<dl>
<dt><u>Vari&aacute;vel de sistema:</u> <b>piece</b>
<a name="IDX185"></a>
</dt>
<dd><p>Mant&eacute;m a ultima express&atilde;o selecionada quando usando fun&ccedil;&otilde;es
<code>part</code>.
Isso &eacute; escolhido durante a execu&ccedil;&atilde;o da fun&ccedil;&atilde;o e dessa forma
pode referir-se &agrave; fun&ccedil;&atilde;o em si mesma.
</p>

</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>polarform</b><i> (<var>expr</var>)</i>
<a name="IDX186"></a>
</dt>
<dd><p>Retorna uma express&atilde;o <code>r %e^(%i theta)</code> equivalente a <var>expr</var>,
tal que <code>r</code> e <code>theta</code> sejam puramente reais.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>powers</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX187"></a>
</dt>
<dd><p>Fornece os expoentes de <var>x</var> que ocorrem em express&atilde;o <var>expr</var>.
</p>
<p><code>load (powers)</code> chama essa fun&ccedil;&atilde;o.
</p>

</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>product</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX188"></a>
</dt>
<dd><p>Representa um produto dos velores de <code>expr</code> com
o &iacute;ndice <var>i</var> variando de <var>i_0</var> a <var>i_1</var>.
A forma substantiva <code>'product</code> &eacute; mostrada como um pi mai&iacute;sculo.
</p>
<p><code>product</code> avalia <var>expr</var> e os limites inferior e superior <var>i_0</var> e <var>i_1</var>,
<code>product</code> coloca um ap&oacute;strofo (n&atilde;o avalia) o &iacute;ndice <var>i</var>.
</p>
<p>Se os limites superiores e inferiores diferirem por um inteiro,
<var>expr</var> &eacute; avaliada para cada valor do &iacute;ndice <var>i</var>,
e o resultado  um produto expl&iacute;cito.
</p>
<p>de outra forma, o intervalo do &iacute;ndice &eacute; indefinido.
Algumas regras s&atilde;o aplicads para simplificar o produto.
Quando a vari&aacute;vel global <code>simpproduct</code> for <code>true</code>, regras adicionais s&atilde;o aplicadas.
Em alguns casos, simplifica&ccedil;&atilde;o um resultado que n&atilde;o &eacute; um produto;
de outra forma, o resultado &eacute; uma forma substantiva <code>'product</code>.
</p>
<p>Veja tamb&eacute;m <code>nouns</code> e <code>evflag</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) product (x + i*(i+1)/2, i, 1, 4);
(%o1)           (x + 1) (x + 3) (x + 6) (x + 10)
(%i2) product (i^2, i, 1, 7);
(%o2)                       25401600
(%i3) product (a[i], i, 1, 7);
(%o3)                 a  a  a  a  a  a  a
                       1  2  3  4  5  6  7
(%i4) product (a(i), i, 1, 7);
(%o4)          a(1) a(2) a(3) a(4) a(5) a(6) a(7)
(%i5) product (a(i), i, 1, n);
                             n
                           /===\
                            ! !
(%o5)                       ! !  a(i)
                            ! !
                           i = 1
(%i6) product (k, k, 1, n);
                               n
                             /===\
                              ! !
(%o6)                         ! !  k
                              ! !
                             k = 1
(%i7) product (k, k, 1, n), simpproduct;
(%o7)                          n!
(%i8) product (integrate (x^k, x, 0, 1), k, 1, n);
                             n
                           /===\
                            ! !    1
(%o8)                       ! !  -----
                            ! !  k + 1
                           k = 1
(%i9) product (if k &lt;= 5 then a^k else b^k, k, 1, 10);
                              15  40
(%o9)                        a   b
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>realpart</b><i> (<var>expr</var>)</i>
<a name="IDX189"></a>
</dt>
<dd><p>Retorna a parte real de <var>expr</var>. <code>realpart</code> e <code>imagpart</code> ir&atilde;o
trabalhar sobre express&otilde;es envolvendo fun&ccedil;&otilde;es trigonom&eacute;tricas e hiperb&oacute;licas,
bem como ra&iacute;zes quadradas, logar&iacute;tmos, e exponencia&ccedil;&atilde;o.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>rectform</b><i> (<var>expr</var>)</i>
<a name="IDX190"></a>
</dt>
<dd><p>Retorna uma express&atilde;o <code>a + b %i</code> equivalente a <var>expr</var>,
tal que <var>a</var> e <var>b</var> sejam puramente reais.
</p>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>rembox</b><i> (<var>expr</var>, unlabelled)</i>
<a name="IDX191"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>rembox</b><i> (<var>expr</var>, <var>r&oacute;tulo</var>)</i>
<a name="IDX192"></a>
</dt>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>rembox</b><i> (<var>expr</var>)</i>
<a name="IDX193"></a>
</dt>
<dd><p>Remove caixas de <var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, unlabelled)</code> remove todas as caixas sem r&oacute;tulos de <var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, <var>r&oacute;tulo</var>)</code> remove somente caixas contendo <var>r&oacute;tulo</var>.
</p>
<p><code>rembox (<var>expr</var>)</code> remove todas as caixas, rotuladas e n&atilde; rotuladas.
</p>
<p>Caixas s&atilde;o desenhadas pelas fun&ccedil;&otilde;es <code>box</code>, <code>dpart</code>, e <code>lpart</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h
(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;
(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i4) rembox (expr2, unlabelled);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) rembox (expr2, FOO);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) rembox (expr2, BAR);
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;
(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>sum</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX194"></a>
</dt>
<dd><p>Representa um somat&oacute;rio dos valores de <var>expr</var> com
o &iacute;ndice <var>i</var> variando de <var>i_0</var> a <var>i_1</var>.
A forma substantiva <code>'sum</code> &eacute; mostrada com uma letra sigma mai&uacute;scula.
<code>sum</code> avalia seu somando <var>expr</var> e limites inferior e superior <var>i_0</var> e <var>i_1</var>,
<code>sum</code> coloca ap&oacute;strofo (n&atilde;o avalia) o &iacute;ndice <var>i</var>.
</p>
<p>Se os limites superiores e inferiores diferirem de um n&uacute;mero inteiro,
o somatoriando <var>expr</var> &eacute; avaliado para cada valor do &iacute;ndice do somat&oacute;rio <var>i</var>,
e o resultado &eacute; uma adi&ccedil;&atilde;o expl&iacute;cita.
</p>
<p>De outra forma, o intervalo dos &iacute;ndices &eacute; indefinido.
Algumas regras s&atilde;o aplicadas para simplificar o somat&oacute;rio.
Quando a vari&aacute;vel global <code>simpsum</code> for <code>true</code>, regras adicionais s&atilde;o aplicadas.
Em alguns casos, simplifica&ccedil;&otilde;es retornam um resultado que n&atilde;o &eacute; um somat&oacute;rio;
de outra forma, o resultado &eacute; uma forma substantiva <code>'sum</code>.
</p>
<p>Quando o <code>evflag</code> (sinalizador de avalia&ccedil;&atilde;o) <code>cauchysum</code> for <code>true</code>,
um produto de somat&oacute;rios &eacute; mostrado como um produto de Cauchy,
no qual o &iacute;ndice do somat&oacute;rio mais interno &eacute; uma fun&ccedil;&atilde;o de
&iacute;ndice de um n&iacute;vel acima, em lugar de variar independentemente.
</p>
<p>A vari&aacute;vel global <code>genindex</code> &eacute; o prefixo alfab&eacute;tico usado para gerar o pr&oacute;ximo &iacute;ndice do somat&oacute;rio,
quando um &iacute;ndice automaticamente gerado for necess&aacute;rio.
</p>
<p><code>gensumnum</code> &eacute; o sufixo num&eacute;rico usando para gerar o pr&oacute;ximo &iacute;ndice do somat&oacute;rio,
quando um &iacute;ndice gerado automaticamente for necess&aacute;rio.
Quando <code>gensumnum</code> for <code>false</code>, um &iacute;ndice gerado automaticamente &eacute; somente
<code>genindex</code> sem sufixo num&eacute;rico.
</p>
<p>Veja tamb&eacute;m <code>sumcontract</code>, <code>intosum</code>,
<code>bashindices</code>, <code>niceindices</code>,
<code>nouns</code>, <code>evflag</code>, e <code>zeilberger</code>.
</p>
<p>Exemplos:
</p>

<pre class="example">(%i1) sum (i^2, i, 1, 7);
(%o1)                          140
(%i2) sum (a[i], i, 1, 7);
(%o2)           a  + a  + a  + a  + a  + a  + a
                 7    6    5    4    3    2    1
(%i3) sum (a(i), i, 1, 7);
(%o3)    a(7) + a(6) + a(5) + a(4) + a(3) + a(2) + a(1)
(%i4) sum (a(i), i, 1, n);
                            n
                           ====
                           \
(%o4)                       &gt;    a(i)
                           /
                           ====
                           i = 1
(%i5) sum (2^i + i^2, i, 0, n);
                          n
                         ====
                         \       i    2
(%o5)                     &gt;    (2  + i )
                         /
                         ====
                         i = 0
(%i6) sum (2^i + i^2, i, 0, n), simpsum;
                              3      2
                   n + 1   2 n  + 3 n  + n
(%o6)             2      + --------------- - 1
                                  6
(%i7) sum (1/3^i, i, 1, inf);
                            inf
                            ====
                            \     1
(%o7)                        &gt;    --
                            /      i
                            ====  3
                            i = 1
(%i8) sum (1/3^i, i, 1, inf), simpsum;
                                1
(%o8)                           -
                                2
(%i9) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf);
                              inf
                              ====
                              \     1
(%o9)                      30  &gt;    --
                              /      2
                              ====  i
                              i = 1
(%i10) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf), simpsum;
                                  2
(%o10)                       5 %pi
(%i11) sum (integrate (x^k, x, 0, 1), k, 1, n);
                            n
                           ====
                           \       1
(%o11)                      &gt;    -----
                           /     k + 1
                           ====
                           k = 1
(%i12) sum (if k &lt;= 5 then a^k else b^k, k, 1, 10));
Incorrect syntax: Too many )'s
else b^k, k, 1, 10))
                  ^
(%i12) linenum:11;
(%o11)                         11
(%i12) sum (integrate (x^k, x, 0, 1), k, 1, n);
                            n
                           ====
                           \       1
(%o12)                      &gt;    -----
                           /     k + 1
                           ====
                           k = 1
(%i13) sum (if k &lt;= 5 then a^k else b^k, k, 1, 10);
          10    9    8    7    6    5    4    3    2
(%o13)   b   + b  + b  + b  + b  + a  + a  + a  + a  + a
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>lsum</b><i> (<var>expr</var>, <var>x</var>, <var>L</var>)</i>
<a name="IDX195"></a>
</dt>
<dd><p>Representas a adi&ccedil;&atilde;o de <var>expr</var> a cada elemento <var>x</var> em <var>L</var>.
</p>
<p>Uma forma substantiva <code>'lsum</code> &eacute; retornada
se o argumento <var>L</var> n&atilde;o avaliar para uma lista.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) lsum (x^i, i, [1, 2, 7]);
                            7    2
(%o1)                      x  + x  + x
(%i2) lsum (i^2, i, rootsof (x^3 - 1, x));
                     ====
                     \      2
(%o2)                 &gt;    i
                     /
                     ====
                                   3
                     i in rootsof(x  - 1, x)
</pre>
</dd></dl>

<dl>
<dt><u>Fun&ccedil;&atilde;o:</u> <b>verbify</b><i> (<var>f</var>)</i>
<a name="IDX196"></a>
</dt>
<dd><p>Retorna a forma verbal da fun&ccedil;&atilde;o chamada <var>f</var>.
</p>
<p>Veja tamb&eacute;m <code>verb</code>, <code>noun</code>, e <code>nounify</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre>
</dd></dl>

<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC29" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_77.html#SEC295" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>Outubro, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
