<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on octubre, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima 5.41.0: 7. Evaluación</title>

<meta name="description" content="Manual de Maxima 5.41.0: 7. Evaluación">
<meta name="keywords" content="Manual de Maxima 5.41.0: 7. Evaluación">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Evaluaci_00f3n"></a>
<a name="SEC47"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_6.html#SEC46" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC48" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC50" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 7. Evaluación </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC48">7.1 Introducción a la evaluación</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC49">7.2 Funciones y variables para la evaluación</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>









<hr size="6">
<a name="Introducci_00f3n-a-la-evaluaci_00f3n"></a>
<a name="SEC48"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC47" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC49" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC47" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC47" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC50" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 7.1 Introducción a la evaluación </h2>

<p>Las fases que se suceden desde que el usuario solicita un cálculo hasta que
obtiene el resultado son: la propia solicitud del cálculo, la evaluación,
la simplificación y la respuesta.
</p>
<p>Toda expresión <var>expr</var> que se introduzca en Maxima será evaluada, de manera
que los símbolos que no tengan asociado ningún valor y los números
evalúan a sí mismos; en cambio, aquellos símbolos
que tengan un valor asociado serán sustituídos por tales valores.
</p>
<p>Dos ejemplos. En el primero, los símbolos y los números se evalúan
a sí mismos; en el segundo ejemplo, al asignarle a la variable <code>a</code>
el valor <code>2</code>, allá donde se escriba <code>a</code> será sustituido por dicho valor.
</p>
<pre class="example">(%i1) [a, b, 2, 1/2, 1.0];
                                  1
(%o1)                   [a, b, 2, -, 1.0]
                                  2
(%i2) a:2$

(%i3) [a, sin(a), a^2];
(%o3)                    [2, sin(2), 4]
</pre>
<p>Maxima distingue entre funciones en forma verbal y funciones en forma
nominal. Las funciones en forma verbal son evaluadas tomando en cuenta
los valores dados a sus argumentos; en cambio, las funciones nominales
no son evaluadas, aunque sus argumentos tengan valores asignados. Las
funciones son susceptibles de ser tratadas de ambos modos; ejemplos 
típicos son la función de diferenciación <code>diff</code>
y la de integración <code>integrate</code>.
</p>
<p>En el siguiente ejemplo se le asigna a la variable <code>a</code> cierto
valor, a continuación se invoca la función <code>diff</code> en su
forma verbal con sus argumentos tomando los valores <code>a*x^2</code> y <code>x</code>.
Seguidamente se invoca a la misma función <code>diff</code> en su
forma nominal, lo cual se consigue mediante el operador de comilla simple (<code>'</code>);
en este caso la función no es evaluada y devuelve una expresión simbólica
en la que los argumentos sí han sido evaluados, pues la variable
<code>a</code> es sustituida por el valor <code>1/2</code>.
</p>
<pre class="example">(%i1) a:1/2;
                                1
(%o1)                           -
                                2
(%i2) diff(a*x^2, x);
(%o2)                           x
(%i3) 'diff(a*x^2, x);
                                  2
                             d   x
(%o3)                        -- (--)
                             dx  2
</pre>
<p>Sin embargo, no todas las funciones de Maxima sustituyen sus argumentos por
sus valores. La documentación para cada función informará si sus argumentos
son evaluados o no.
</p>
<p>Por ejemplo, la función <code>properties</code> no evalúa sus argumentos, lo cual
resulta práctico para el usuario, ya que en caso contrario debería
utilizar el operador de comilla simple <code>'</code> a fin de poder mostrar las
propiedades del símbolo <code>a</code>. A continuación se muestra 
como en el primer caso se devuelve una lista vacía, ya que no se
le ha encontrado ninguna propiedad al símbolo <code>a</code>; una vez
se le ha asignado el valor <code>2</code>, la función <code>properties</code> nos dice
que la variable guarda un valor y esto es así porque no ha sustituido
el símbolo <code>a</code> por su valor <code>2</code>. En consecuencia, la
función <code>properties</code> muestra las propiedades de <code>'a</code>.
</p>
<pre class="example">(%i1) properties(a);
(%o1)                          []
(%i2) a:2$

(%i3) properties(a);
(%o3)                        [value]
</pre>
<p>La evaluación de símbolos, funciones y expresiones se puede
controlar con los operadores de comilla simple (<code>'</code>) y de doble comilla
simple (<code>''</code>). La evaluación se suprime con la comilla simple y se
fuerza con la doble comilla simple (que no comilla doble).
</p>
<p>Con la función <code>ev</code> se evalúa una expresión dentro de un contexto
determinado controlado por el valor de ciertas variables <code>evflag</code> y
funciones de evaluación <code>evfun</code>.
</p>









<hr size="6">
<a name="Funciones-y-variables-para-la-evaluaci_00f3n"></a>
<a name="SEC49"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC48" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC50" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC47" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC47" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC50" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 7.2 Funciones y variables para la evaluación </h2>


<dl>
<dt><u>Operador:</u> <b>'</b>
<a name="IDX218"></a>
</dt>
<dd><p>El operador comilla simple <code>'</code> evita la evaluación. 
</p>
<p>Aplicado a un símbolo, 
la comilla simple evita la evaluación del símbolo. 
</p>
<p>Aplicado a la llamada de una función,
la comilla simple evita la evaluación de la función llamada,
aunque los argumentos de la función son evaluados (siempre y cuando 
la evaluación no se evite de otra manera). 
El resultado es una forma de nombre de la función llamada.  
</p>
<p>Aplicado a una expresión con paréntesis, 
la comilla simple evita la evaluación de todos los símbolos y llamadas a funciones que hayan en la expresión. 
E.g., <code>'(f(x))</code> significa que no se evalua la expresión <code>f(x)</code>. 
<code>'f(x)</code> (con la comilla simple aplicada a <code>f</code> en cambio de a <code>f(x)</code>)
significa el retorno de la forma de nombre de <code>f</code> aplicada a <code>[x]</code>. 
</p>
<p>La comilla simple no evita la simplificación. 
</p>
<p>Cuando el interruptor global <code>noundisp</code> es <code>true</code>, 
los nombres se muestran con una comilla simple. 
Este interruptor siempre tiene como valor <code>true</code> cuando 
se muestran definiciones de funciones. 
</p>
<p>Ver también los operadores comilla-comilla <code>''</code> y <code>nouns</code>. 
</p>
<p>Ejemplos:
</p>
<p>Aplicado a un símbolo, 
la comilla simple evita la evaluación del símbolo. 
</p>
<pre class="example">(%i1) aa: 1024;
(%o1)                         1024
(%i2) aa^2;
(%o2)                        1048576
(%i3) 'aa^2;
                                 2
(%o3)                          aa
(%i4) ''%;
(%o4)                        1048576
</pre>
<p>Aplicado a la llamada de una función,
la comilla simple evita la evaluación de la función llamada,
aunque los argumentos de la función son evaluados (siempre y cuando 
la evaluación no se evite de otra manera). 
El resultado es una forma de nombre de la función llamada.  
</p>
<pre class="example">(%i1) x0: 5;
(%o1)                           5
(%i2) x1: 7;
(%o2)                           7
(%i3) integrate (x^2, x, x0, x1);
                               218
(%o3)                          ---
                                3
(%i4) 'integrate (x^2, x, x0, x1);
                             7
                            /
                            [   2
(%o4)                       I  x  dx
                            ]
                            /
                             5
(%i5) %, nouns;
                               218
(%o5)                          ---
                                3
</pre>
<p>Aplicado a una expresión con paréntesis, la comilla simple evita
la evaluación de todos los símbolos y llamadas a 
funciones que haya dentro en la expresión. 
</p>
<pre class="example">(%i1) aa: 1024;
(%o1)                         1024
(%i2) bb: 19;
(%o2)                          19
(%i3) sqrt(aa) + bb;
(%o3)                          51
(%i4) '(sqrt(aa) + bb);
(%o4)                     bb + sqrt(aa)
(%i5) ''%;
(%o5)                          51
</pre>
<p>La comilla simple no evita la simplificación. 
</p>
<pre class="example">(%i1) sin (17 * %pi) + cos (17 * %pi);
(%o1)                          - 1
(%i2) '(sin (17 * %pi) + cos (17 * %pi));
(%o2)                          - 1
</pre>
<p>Internamente, Maxima considera que las operaciones con números
decimales de coma flotante son simples simplificaciones.
</p>
<pre class="example">(%i1) sin(1.0);
(%o1)                          .8414709848078965
(%i2) '(sin(1.0));
(%o2)                          .8414709848078965
</pre>
</dd></dl>





<dl>
<dt><u>Operador:</u> <b>&quot;</b>
<a name="IDX219"></a>
</dt>
<dd><p>El operador comilla-comilla <code>''</code> (dos comillas simples) modifica la evaluación
en las expresiones de entrada.
</p>
<p>Aplicado a cualquier expresión general <var>expr</var>, las dos comillas simples hacen que
el valor de <var>expr</var> sea sustituido por <var>expr</var> en la expresión de entrada.
</p>
<p>Aplicado al operador de una expresión, el operador comilla-comilla hace que el operador
pase de ser un nombre a ser un verbo, a menos que ya sea un verbo.
</p>
<p>El operador comilla-comilla es aplicado por el analizador sintáctico de entrada;
no se almacena como una parte de la expresión de entrada analizada.
Este operador se aplica siempre tan pronto como es detectado y no puede ser comentado con
una comilla simple. De esta manera, el operador comilla-comilla provoca la evaluación de
una expresión cuando ésta no estaba previsto que fuese evaluada, como en la
definición de funciones, expresiones lambda y expresiones comentadas con una comilla simple
<code>'</code>.
</p>
<p>El operador comilla-comilla es reconocido tanto por <code>batch</code> como por <code>load</code>.
</p>
<p>Véanse también el operador comilla simple <code>'</code> y <code>nouns</code>.
</p>
<p>Ejemplos:
</p>
<p>Aplicado a cualquier expresión general <var>expr</var>, las dos comillas simples hacen que
el valor de <var>expr</var> sea sustituido por <var>expr</var> en la expresión de entrada.
</p>
<pre class="example">(%i1) expand ((a + b)^3);
                     3        2      2      3
(%o1)               b  + 3 a b  + 3 a  b + a
(%i2) [_, ''_];
                         3    3        2      2      3
(%o2)     [expand((b + a) ), b  + 3 a b  + 3 a  b + a ]
(%i3) [%i1, ''%i1];
                         3    3        2      2      3
(%o3)     [expand((b + a) ), b  + 3 a b  + 3 a  b + a ]
(%i4) [aa : cc, bb : dd, cc : 17, dd : 29];
(%o4)                   [cc, dd, 17, 29]
(%i5) foo_1 (x) := aa - bb * x;
(%o5)                 foo_1(x) := aa - bb x
(%i6) foo_1 (10);
(%o6)                      cc - 10 dd
(%i7) ''%;
(%o7)                         - 273
(%i8) ''(foo_1 (10));
(%o8)                         - 273
(%i9) foo_2 (x) := ''aa - ''bb * x;
(%o9)                 foo_2(x) := cc - dd x
(%i10) foo_2 (10);
(%o10)                        - 273
(%i11) [x0 : x1, x1 : x2, x2 : x3];
(%o11)                    [x1, x2, x3]
(%i12) x0;
(%o12)                         x1
(%i13) ''x0;
(%o13)                         x2
(%i14) '' ''x0;
(%o14)                         x3
</pre>
<p>Aplicado al operador de una expresión, la
doble comilla simple hace que el operador
pase de ser nominal a verbal, a menos que ya sea un verbo.
</p>
<pre class="example">(%i1) declare (foo, noun);
(%o1)                         done
(%i2) foo (x) := x - 1729;
(%o2)                 ''foo(x) := x - 1729
(%i3) foo (100);
(%o3)                       foo(100)
(%i4) ''foo (100);
(%o4)                        - 1629
</pre>

<p>El operador comilla-comilla es aplicado por el analizador sintáctico de entrada;
no se almacena como una parte de la expresión de entrada analizada.
</p>
<pre class="example">(%i1) [aa : bb, cc : dd, bb : 1234, dd : 5678];
(%o1)                 [bb, dd, 1234, 5678]
(%i2) aa + cc;
(%o2)                        dd + bb
(%i3) display (_, op (_), args (_));
                           _ = cc + aa

                         op(cc + aa) = +

                    args(cc + aa) = [cc, aa]

(%o3)                         done
(%i4) ''(aa + cc);
(%o4)                         6912
(%i5) display (_, op (_), args (_));
                           _ = dd + bb

                         op(dd + bb) = +

                    args(dd + bb) = [dd, bb]

(%o5)                         done
</pre>
<p>El operador comilla-comilla provoca la evaluación de
una expresión cuando ésta no estaba previsto que fuese evaluada, como en la
definición de funciones, expresiones lambda y expresiones comentadas con una comilla simple
<code>'</code>.
</p>
<pre class="example">(%i1) foo_1a (x) := ''(integrate (log (x), x));
(%o1)               foo_1a(x) := x log(x) - x
(%i2) foo_1b (x) := integrate (log (x), x);
(%o2)           foo_1b(x) := integrate(log(x), x)
(%i3) dispfun (foo_1a, foo_1b);
(%t3)               foo_1a(x) := x log(x) - x

(%t4)           foo_1b(x) := integrate(log(x), x)

(%o4)                      [%t3, %t4]
(%i5) integrate (log (x), x);
(%o5)                     x log(x) - x
(%i6) foo_2a (x) := ''%;
(%o6)               foo_2a(x) := x log(x) - x
(%i7) foo_2b (x) := %;
(%o7)                    foo_2b(x) := %
(%i8) dispfun (foo_2a, foo_2b);
(%t8)               foo_2a(x) := x log(x) - x

(%t9)                    foo_2b(x) := %

(%o9)                      [%t7, %t8]
(%i10) F : lambda ([u], diff (sin (u), u));
(%o10)             lambda([u], diff(sin(u), u))
(%i11) G : lambda ([u], ''(diff (sin (u), u)));
(%o11)                  lambda([u], cos(u))
(%i12) '(sum (a[k], k, 1, 3) + sum (b[k], k, 1, 3));
(%o12)         sum(b , k, 1, 3) + sum(a , k, 1, 3)
                    k                  k
(%i13) '(''(sum (a[k], k, 1, 3)) + ''(sum (b[k], k, 1, 3)));
(%o13)             b  + a  + b  + a  + b  + a
                    3    3    2    2    1    1
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>ev</b><i> (<var>expr</var>, <var>arg_1</var>, &hellip;, <var>arg_n</var>)</i>
<a name="IDX220"></a>
</dt>
<dd><p>Evalua la expresión <var>expr</var> en el entorno especificado
por los argumentos <var>arg_1</var>, ..., <var>arg_n</var>.
Los argumentos son interruptores (Variables Booleanas), variables de
asignación, ecuaciones y funciones. 
<code>ev</code> retorna el resultado (otra expresión) de la evaluación. 
</p>
<p>La evaluación se realiza por etapas, como sigue: 
</p>
<ol>
<li>
Primero se configura el entorno de acuerdo a los argumentos los
cuales pueden ser algunos o todos de la siguiente lista:  

<ul>
<li>
<code>simp</code> causa que <var>expr</var> sea simplificada sin importar el valor de la variable interruptor <code>simp</code> la cual inhibe la simplificación cuando su valor es <code>false</code>. 
</li><li>
<code>noeval</code> suprime la fase de evaluación de <code>ev</code> (Vea el paso (4) más adelante). 
Esto es muy útil en conjunción con otras variables interruptor y causan en <var>expr</var> que sea resimplificada sin ser reevaluada. 
</li><li>
<code>nouns</code> causa la evaluación de las formas nominales
(típicamente funciones sin evaluar tales como
<code>'integrate</code> or <code>'diff</code>) en <code>expr</code>. 
</li><li>
<code>expand</code> causa expansión. 
</li><li>
<code>expand (<var>m</var>, <var>n</var>)</code> causa expansión, asignando los valores de <code>maxposex</code> y
<code>maxnegex</code> a <var>m</var> y <var>n</var>, respectivamente.
</li><li>
<code>detout</code> hace que cualesquiera matrices inversas calculadas en <var>expr</var> conserven su determinante fuera de la inversa, en vez de que divida a cada elemento.  
</li><li>
<code>diff</code> realiza todas las diferenciaciones indicadas en <var>expr</var>. 
</li><li>
<code>derivlist (<var>x</var>, <var>y</var>, <var>z</var>, ...)</code> realiza sólo las diferenciaciones con respecto a las variables indicadas. 
</li><li>
<code>risch</code> hace que las integrales presentes en <var>expr</var> se evalúen mediante
el algoritmo de Risch. Véase también <code>risch</code>. Cuando se utiliza el 
símbolo especial <code>nouns</code>, se aplica la rutina estándar de integración.
</li><li>
<code>float</code> provoca la conversión de los números racionales no-enteros a números decimales de coma flotante. 
</li><li>
<code>numer</code> causa que algunas funciones matemáticas (incluyendo potenciación) con argumentos numéricos sean evaluados como punto flotante. Esto causa que las variables en <var>expr</var> las cuales hayan sido declaradas como variables numéricas sean reemplazadas por sus respectivos valores. Esto también configura la variable interruptor <code>float</code> a <code>true</code>. 
</li><li>
<code>pred</code> provoca la evaluación de los predicados (expresiones las cuales se evaluan a <code>true</code> o <code>false</code>). 
</li><li>
<code>eval</code> provoca una post-evaluación extra de <var>expr</var> (véase el paso (5) más adelante), pudiendo aparecer
<code>eval</code> varias veces; por cada aparición de <code>eval</code>, la expresión es reevaluada.
</li><li>
<code>A</code>, donde <code>A</code> es un átomo declarado como una variable de tipo interruptor, (Vea <code>evflag</code>)
causa que <code>A</code> tenga como valor <code>true</code> durante 
la evaluación de <var>expr</var>.  
</li><li>
<code>V: expresion</code> (o alternativamente <code>V=expresion</code>) causa que 
<code>V</code> tenga el valor de <code>expresion</code> durante la evaluación
de <var>expr</var>. Notese que si <code>V</code> es una opción Maxima, entonces
<code>expresion</code> se usa como su valor durante la evaluación de
<var>expr</var>. Si más de un argumento de <code>ev</code> es de este 
tipo entonces el vínculo se hace en paralelo. Si <code>V</code> es una
expresión no atómica entonces se hace una sustitución más que 
un vínculo.
</li><li>
<code>F</code> donde <code>F</code>, un nombre de función, ha sido declarado para 
ser una función de evaluación (Vea <code>evfun</code>) causa que
<code>F</code> sea aplicada a <var>expr</var>. 
</li><li>
Cualquier otro nombre de función (e.g., <code>sum</code>) causa la evaluación de las ocurrencias de esos nombres en <code>expr</code> como si ellos fueran
verbos. 
</li><li>
En adición de que una función ocurra en <var>expr</var> (digamos <code>F(x)</code>) puede ser definida localmente para el propósito de esta evaluación 
de <var>expr</var> pasando <code>F(x) := expresion</code> como un argumento a
<code>ev</code>. 
</li><li>
Si un átomo no mencionado anteriormente o una variable o expresión 
con subíndices fueran pasadas como un argumento, esta es evaluada y
si el resultado es una ecuación o una asignación entonces el 
vínculo o sustitución se llevará a cabo. Si el resultado es una
lista entonces los miembros de la lista tratados como si ellos fueran
argumentos adicionales pasados a <code>ev</code>. Esto permite que una
lista de argumentos sea pasada (e.g., <code>[X=1, Y=A**2]</code>) o una lista
de nombres de ecuaciones (e.g., <code>[%t1, %t2]</code> donde <code>%t1</code> y
<code>%t2</code> son ecuaciones) tal como lo que es retornado por 
<code>solve</code>. 
</li></ul>

<p>Los argumentos de <code>ev</code> pueden ser pasados en cualquier orden con excepción de la sustitución de ecuaciones las cuales son manipuladas en 
secuencia, de izquierda a derecha y las funciones de evaluación las 
cuales son compuestas, e.g., <code>ev (<var>expr</var>, ratsimp, realpart)</code>
es manipulada como <code>realpart (ratsimp (<var>expr</var>))</code>. 
</p>
<p>Los interruptores <code>simp</code>, <code>numer</code> y <code>float</code> 
pueden también ser configurados localmente en una sentencia block, o
globalmente en Maxima para que su efecto permanezca hasta que
sean reconfiguradas.   
</p>
<p>Si <var>expr</var> es una Expresión Racional Canónica (CRE, por sus siglas en inglés), entonces la expresión retornada por <code>ev</code> es también 
de tipo CRE, siempre que los interruptores <code>numer</code> y <code>float</code> no sean <code>true</code>. 
</p>
</li><li>
Durante el paso (1), se fabrica una lista de las variables que no contienen subíndices que aparecen en el lado izquierdo de las ecuaciones en los
argumentos o en el valor de algunos argumentos si el valor es una ecuación. Las variables (variables que contienen subíndices las cuales no tienen asociado un arreglo de funciones como también las variables que no contienen subíndices) en la expresión <var>expr</var> son reemplazadas por sus valores globales, excepto por aquellos que aparezcan en esa lista. 
Usualmente, <var>expr</var> es sólo una etiqueta o un <code>%</code> 
(como en <code>%i2</code> en el ejemplo de más abajo) así que 
este paso simplemente recupera la expresión a la que hace referencia 
la etiqueta y así <code>ev</code> puede trabajarla. 

</li><li>
Si algunas sustituciones son indicadas por los argumentos, ellas
serán llevadas a cabo ahora. 

</li><li>
La expresión resultante es también reevaluada (a menos que uno de 
los argumentos fuese <code>noeval</code>) y simplificada de acuerdo a los 
argumentos. Notese que cualquier llamada a una función en <var>expr</var> 
será llevada a cabo después de que las variables sean evaluadas 
en ella y que <code>ev(F(x))</code> pueda comportarse como <code>F(ev(x))</code>. 

</li><li>
Por cada aparición de <code>eval</code> en los argumentos, se repetirán los pasos (3) y (4).
</li></ol>

<p>Ejemplos:
</p>
<pre class="example">(%i1) sin(x) + cos(y) + (w+1)^2 + 'diff (sin(w), w);
                                     d                    2
(%o1)              cos(y) + sin(x) + -- (sin(w)) + (w + 1)
                                     dw
(%i2) ev (%, numer, expand, diff, x=2, y=1);
                               2
(%o2)                cos(w) + w  + 2 w + 2.449599732693821
</pre>

<p>Una sintaxis alternativa de alto nivel ha sido desarrollada para <code>ev</code>
por medio de la cual se pueden escribir solamente sus argumentos, sin 
el comando <code>ev()</code>; se trata de una forma de escritura simplificada:
</p>
<pre class="example"><var>expr</var>, <var>arg_1</var>, ..., <var>arg_n</var>
</pre>
<p>Esta sintaxis no está permitida dentro de otras expresiones, como
funciones, bloques, etc.
</p>
<p>Nótese el proceso de vínculo en paralelo en el siguiente ejemplo:
</p>
<pre class="example">(%i3) programmode: false;
(%o3)                                false
(%i4) x+y, x: a+y, y: 2;
(%o4)                              y + a + 2
(%i5) 2*x - 3*y = 3$
(%i6) -3*x + 2*y = -4$
(%i7) solve ([%o5, %o6]);
Solución

                                          1
(%t7)                               y = - -
                                          5

                                         6
(%t8)                                x = -
                                         5
(%o8)                            [[%t7, %t8]]
(%i8) %o6, %o8;
(%o8)                              - 4 = - 4
(%i9) x + 1/x &gt; gamma (1/2);
                                   1
(%o9)                          x + - &gt; sqrt(%pi)
                                   x
(%i10) %, numer, x=1/2;
(%o10)                      2.5 &gt; 1.772453850905516
(%i11) %, pred;
(%o11)                               true
</pre>
</dd></dl>



<dl>
<dt><u>Símbolo especial:</u> <b>eval</b>
<a name="IDX221"></a>
</dt>
<dd><p>Como argumento en una llamada a <code>ev (<var>expr</var>)</code>, <code>eval</code> 
fuerza una evaluación extra de <var>expr</var>.
</p>
<p>Véase también <code>ev</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) [a:b,b:c,c:d,d:e];
(%o1)                            [b, c, d, e]
(%i2) a;
(%o2)                                  b
(%i3) ev(a);
(%o3)                                  c
(%i4) ev(a),eval;
(%o4)                                  e
(%i5) a,eval,eval;
(%o5)                                  e
</pre>
</dd></dl>




<dl>
<dt><u>Propiedad:</u> <b>evflag</b>
<a name="IDX222"></a>
</dt>
<dd><p>Cuando un símbolo <var>x</var> goza de la propiedad <code>evflag</code>,
las expresiones <code>ev(<var>expr</var>, <var>x</var>)</code> y <code><var>expr</var>, <var>x</var></code>
(en modo interactivo) equivalen a <code>ev(<var>expr</var>, <var>x</var> = true)</code>.
Esto es, a <var>x</var> se le asigna <code>true</code> al tiempo que se evalúa <var>expr</var>.
</p>
<p>La expresión <code>declare(<var>x</var>, evflag)</code> dota a la variable <var>x</var>
de la propiedad <code>evflag</code>.
</p>
<p>Los interruptores que tienen la propiedad <code>evflag</code> son: 
</p>
<pre class="verbatim">   algebraic           cauchysum       demoivre         
   dotscrules          %emode          %enumer     
   exponentialize      exptisolate     factorflag
   float               halfangles      infeval
   isolate_wrt_times   keepfloat       letrat
   listarith           logabs          logarc
   logexpand           lognegint
   m1pbranch           numer_pbranch   programmode
   radexpand           ratalgdenom     ratfac
   ratmx               ratsimpexpons   simp
   simpproduct         simpsum         sumexpand
   trigexpand
</pre>
<p>Ejemplos:
</p>
<pre class="example">(%i1) sin (1/2);
                                 1
(%o1)                        sin(-)
                                 2
(%i2) sin (1/2), float;
(%o2)                   0.479425538604203
(%i3) sin (1/2), float=true;
(%o3)                   0.479425538604203
(%i4) simp : false;
(%o4)                         false
(%i5) 1 + 1;
(%o5)                         1 + 1
(%i6) 1 + 1, simp;
(%o6)                           2
(%i7) simp : true;
(%o7)                         true
(%i8) sum (1/k^2, k, 1, inf);
                            inf
                            ====
                            \     1
(%o8)                        &gt;    --
                            /      2
                            ====  k
                            k = 1
(%i9) sum (1/k^2, k, 1, inf), simpsum;
                                 2
                              %pi
(%o9)                         ----
                               6
(%i10) declare (aa, evflag);
(%o10)                        done
(%i11) if aa = true then YES else NO;
(%o11)                         NO
(%i12) if aa = true then YES else NO, aa;
(%o12)                         YES
</pre> 
</dd></dl>




<dl>
<dt><u>Propiedad:</u> <b>evfun</b>
<a name="IDX223"></a>
</dt>
<dd><p>Cuando la función <var>F</var> goza de la propiedad <code>evfun</code>,
las expresiones <code>ev(<var>expr</var>, <var>F</var>)</code> y <code><var>expr</var>, <var>F</var></code>
(en modo interactivo) equivalen a <code><var>F</var>(ev(<var>expr</var>))</code>.
</p>
<p>Si se especifican dos o más funciones, <var>F</var>, <var>G</var>, etc., como poseedoras 
de la propiedad <code>evfun</code>, éstas se aplican en el mismo orden en el que han sido 
especificadas como tales.
</p>
<p>La expresión <code>declare(<var>F</var>, evfun)</code> dota a la función  <var>F</var>
de la propiedad <code>evfun</code>.
</p>
<p>Las funciones que tienen la propiedad <code>evfun</code> por defecto son: 
</p>
<pre class="verbatim">   bfloat          factor       fullratsimp
   logcontract     polarform    radcan
   ratexpand       ratsimp      rectform
   rootscontract   trigexpand   trigreduce
</pre>
<p>Ejemplos:
</p>
<pre class="example">(%i1) x^3 - 1;
                              3
(%o1)                        x  - 1
(%i2) x^3 - 1, factor;
                                2
(%o2)                 (x - 1) (x  + x + 1)
(%i3) factor (x^3 - 1);
                                2
(%o3)                 (x - 1) (x  + x + 1)
(%i4) cos(4 * x) / sin(x)^4;
                            cos(4 x)
(%o4)                       --------
                               4
                            sin (x)
(%i5) cos(4 * x) / sin(x)^4, trigexpand;
                 4           2       2         4
              sin (x) - 6 cos (x) sin (x) + cos (x)
(%o5)         -------------------------------------
                                4
                             sin (x)
(%i6) cos(4 * x) / sin(x)^4, trigexpand, ratexpand;
                           2         4
                      6 cos (x)   cos (x)
(%o6)               - --------- + ------- + 1
                          2          4
                       sin (x)    sin (x)
(%i7) ratexpand (trigexpand (cos(4 * x) / sin(x)^4));
                           2         4
                      6 cos (x)   cos (x)
(%o7)               - --------- + ------- + 1
                          2          4
                       sin (x)    sin (x)
(%i8) declare ([F, G], evfun);
(%o8)                         done
(%i9) (aa : bb, bb : cc, cc : dd);
(%o9)                          dd
(%i10) aa;
(%o10)                         bb
(%i11) aa, F;
(%o11)                        F(cc)
(%i12) F (aa);
(%o12)                        F(bb)
(%i13) F (ev (aa));
(%o13)                        F(cc)
(%i14) aa, F, G;
(%o14)                      G(F(cc))
(%i15) G (F (ev (aa)));
(%o15)                      G(F(cc))
</pre> 
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>infeval</b>
<a name="IDX224"></a>
</dt>
<dd><p>Habilita el modo de &quot;evaluación infinita&quot;. <code>ev</code> repetidamente 
evalua una expresión hasta que se pare de hacer cambios. Para prevenir
que una variable, digamos <code>X</code>, sea evaluada sin parar en este modo, 
simplemente incluya <code>X='X</code> como argumento de <code>ev</code>. 
Esta claro que expresiones como <code>ev (X, X=X+1, infeval)</code> generarán un bucle infinito.
</p></dd></dl>



<dl>
<dt><u>Símbolo especial:</u> <b>noeval</b>
<a name="IDX225"></a>
</dt>
<dd><p>El símbolo <code>noeval</code> evita la fase de evaluación de <code>ev</code>.
Es útil conjuntamente con otras variables globales y para poder volver a 
simplificar expresiones sin tener que evaluarlas otra vez.
</p>
</dd></dl>



<dl>
<dt><u>Símbolo especial:</u> <b>nouns</b>
<a name="IDX226"></a>
</dt>
<dd><p>El símbolo <code>nouns</code> es una <code>evflag</code>, lo que significa 
que cuando se utilice como una opción de la instrucción <code>ev</code>, 
todas las formas nominales que aparezcan en una expresión las convierte en 
verbales, esto es, las evalúa.  Véanse también <code>noun</code>, <code>nounify</code>, 
<code>verb</code> y <code>verbify</code>.
</p>
</dd></dl>



<dl>
<dt><u>Símbolo especial:</u> <b>pred</b>
<a name="IDX227"></a>
</dt>
<dd><p>Cuando se utiliza como argumento en una llamada a
<code>ev (<var>expr</var>)</code>, <code>pred</code> provoca que los
predicados (expresiones que se reducen a <code>true</code> o
<code>false</code>) se evalúen.
</p>
<p>Véase <code>ev</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) 1&lt;2;
(%o1)                                1 &lt; 2
(%i2) 1&lt;2,pred;
(%o2)                                true
</pre></dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC47" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC50" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>octubre, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
