<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on octubre, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima 5.41.0: 55. graphs</title>

<meta name="description" content="Manual de Maxima 5.41.0: 55. graphs">
<meta name="keywords" content="Manual de Maxima 5.41.0: 55. graphs">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="graphs"></a>
<a name="SEC279"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_54.html#SEC278" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC280" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_54.html#SEC277" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 55. graphs </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC280">55.1 Introducción a graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC281">55.2 Funciones y variables para graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-graphs"></a>
<a name="SEC280"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC279" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC279" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 55.1 Introducción a graphs </h2>

<p>El paquete <code>graphs</code> permite trabajar con estructuras de grafos y digrafos en
Maxima. Tanto los grafos como los digrafos son de estructura simples (no 
tienen ni aristas mÃºltiples ni bucles), pero los digrafos pueden tener
una arista dirigida desde <var>u</var> hasta <var>v</var> y otra desde <var>v</var>
hasta <var>u</var>.
</p>
<p>Los grafos se representan internamente como listas de adyacencia y se
implementan como estructuras de lisp. Los vértices se identifican 
por sus números de identificacin' (siempre enteros). Las aristas/arcos
se representan por listas de longitud 2. Se pueden asignar etiquetas a los
vértices de los grafos/digrafos y pesos a sus aristas/arcos.
</p>
<p>La función <code>draw_graph</code> dibuja grafos siguiendo un criterio rígido
de posicionamiento de los vértices. También puede hacer uso del programa graphviz
disponible en <a href="http://www.graphviz.org">http://www.graphviz.org</a>. La función <code>draw_graph</code> utiliza el paquete 
<code>draw</code> de Maxima.
</p>
<p>Para hacer uso de este paquete, ejecútese primero <code>load(graphs)</code>.
</p>

<hr size="6">
<a name="Funciones-y-variables-para-graphs"></a>
<a name="SEC281"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC280" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC282" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC279" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 55.2 Funciones y variables para graphs </h2>

<hr size="6">
<a name="SEC282"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC281" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC283" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 55.2.1 Construyendo grafos </h3>

<dl>
<dt><u>Función:</u> <b>create_graph</b><i> (<var>v_list</var>, <var>e_list</var>)</i>
<a name="IDX2259"></a>
</dt>
<dt><u>Función:</u> <b>create_graph</b><i> (<var>n</var>, <var>e_list</var>)</i>
<a name="IDX2260"></a>
</dt>
<dt><u>Función:</u> <b>create_graph</b><i> (<var>v_list</var>, <var>e_list</var>, <var>directed</var>)</i>
<a name="IDX2261"></a>
</dt>
<dd><p>Crea un nuevo grafo sobre el conjunto de vértices <var>v_list</var> con aristas
<var>e_list</var>.
</p>
<p><var>v_list</var> es una lista de vértices (<code>[v1, v2,..., vn]</code>) o una lista de
vértices junto con sus respectivas etiquetas (<code>[[v1,l1], [v2,l2],..., [vn,ln]]</code>).
</p>
<p><var>n</var> es el número de vértices, los cuales se identificarán desde
0 hasta n-1.
</p>
<p><var>e_list</var> es una lista de aristas (<code>[e1, e2,..., em]</code>) o una lista de
aristas con sus respectivas ponderaciones (<code>[[e1, w1], ..., [em, wm]]</code>).
</p>
<p>Si <var>directed</var> is not <code>false</code>, se devolverá un grafo orientado.
</p>
<p>Ejemplos:
</p>
<p>Crea un ciclo de 3 vértices.
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[1,2], [2,3], [1,3]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre>
<p>Crea un ciclo de 3 vértices y aristas ponderadas:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[[1,2], 1.0], [[2,3], 2.0],
                                [[1,3], 3.0]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre>
<p>Crea un grafo orientado:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) d : create_graph(
       [1,2,3,4], 
       [
        [1,3], [1,4],
        [2,3], [2,4]
       ],
       'directed = true)$
(%i3) print_graph(d)$
Digraph on 4 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :
  2 :  4  3
  1 :  4  3
</pre></dd></dl>



<dl>
<dt><u>Función:</u> <b>copy_graph</b><i> (<var>g</var>)</i>
<a name="IDX2262"></a>
</dt>
<dd><p>Devuelve una copia del grafo <var>g</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>circulant_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2263"></a>
</dt>
<dd><p>Devuelve un grafo cirlulante de parámetros <var>n</var> y <var>d</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : circulant_graph(10, [1,3])$
(%i3) print_graph(g)$
Graph on 10 vertices with 20 edges.
Adjacencies:
  9 :  2  6  0  8
  8 :  1  5  9  7
  7 :  0  4  8  6
  6 :  9  3  7  5
  5 :  8  2  6  4
  4 :  7  1  5  3
  3 :  6  0  4  2
  2 :  9  5  3  1
  1 :  8  4  2  0
  0 :  7  3  9  1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>clebsch_graph</b><i> ()</i>
<a name="IDX2264"></a>
</dt>
<dd><p>Devuelve el grafo de Clebsch.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>complement_graph</b><i> (<var>g</var>)</i>
<a name="IDX2265"></a>
</dt>
<dd><p>Devuelve el complemento del grafo <var>g</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>complete_bipartite_graph</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2266"></a>
</dt>
<dd><p>Devuelve el grafo bipartido completo de <var>n+m</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>complete_graph</b><i> (<var>n</var>)</i>
<a name="IDX2267"></a>
</dt>
<dd><p>Devuelve el grafo completo de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>cycle_digraph</b><i> (<var>n</var>)</i>
<a name="IDX2268"></a>
</dt>
<dd><p>Devuelve el ciclo dirigido de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>cycle_graph</b><i> (<var>n</var>)</i>
<a name="IDX2269"></a>
</dt>
<dd><p>Devuelve el ciclo de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>cuboctahedron_graph</b><i> (<var>n</var>)</i>
<a name="IDX2270"></a>
</dt>
<dd><p>Devuelve el grafo cubooctaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>cube_graph</b><i> (<var>n</var>)</i>
<a name="IDX2271"></a>
</dt>
<dd><p>Devuelve el cubo de <var>n</var> dimensiones.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>dodecahedron_graph</b><i> ()</i>
<a name="IDX2272"></a>
</dt>
<dd><p>Devuelve el grafo del dodecaedro.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>empty_graph</b><i> (<var>n</var>)</i>
<a name="IDX2273"></a>
</dt>
<dd><p>Devuelve el grafo vacío de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>flower_snark</b><i> (<var>n</var>)</i>
<a name="IDX2274"></a>
</dt>
<dd><p>Devuelve el grafo de flor de <var>4n</var> vértices.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) f5 : flower_snark(5)$
(%i3) chromatic_index(f5);
(%o3)                                  4
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>from_adjacency_matrix</b><i> (<var>A</var>)</i>
<a name="IDX2275"></a>
</dt>
<dd><p>Devuelve el grafo definido por la matriz de adyacencia <var>A</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>frucht_graph</b><i> ()</i>
<a name="IDX2276"></a>
</dt>
<dd><p>Devuelve el grafo de Frucht.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_product</b><i> (<var>g1</var>, <var>g1</var>)</i>
<a name="IDX2277"></a>
</dt>
<dd><p>Devuelve el producto dirigido de los grafos <var>g1</var> y <var>g2</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) grid : graph_product(path_graph(3), path_graph(4))$
(%i3) draw_graph(grid)$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs01.gif" alt="../figures/graphs01"></div>
</p>
<dl>
<dt><u>Función:</u> <b>graph_union</b><i> (<var>g1</var>, <var>g1</var>)</i>
<a name="IDX2278"></a>
</dt>
<dd><p>Devuelve la unión (suma) de los grafos <var>g1</var> y <var>g2</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>grid_graph</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2279"></a>
</dt>
<dd><p>Devuelve la rejilla <var>n x m</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>great_rhombicosidodecahedron_graph</b><i> ()</i>
<a name="IDX2280"></a>
</dt>
<dd><p>Devuelve el grafo gran rombicosidodecaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>great_rhombicuboctahedron_graph</b><i> ()</i>
<a name="IDX2281"></a>
</dt>
<dd><p>Devuelve el grafo gran rombicocubicooctaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>grotzch_graph</b><i> ()</i>
<a name="IDX2282"></a>
</dt>
<dd><p>Devuelve el grafo de Grotzch.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>heawood_graph</b><i> ()</i>
<a name="IDX2283"></a>
</dt>
<dd><p>Devuelve el grafo de Heawood.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>icosahedron_graph</b><i> ()</i>
<a name="IDX2284"></a>
</dt>
<dd><p>Devuelve el grafo icosaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>icosidodecahedron_graph</b><i> ()</i>
<a name="IDX2285"></a>
</dt>
<dd><p>Devuelve el grafo icosidodecaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>induced_subgraph</b><i> (<var>V</var>, <var>g</var>)</i>
<a name="IDX2286"></a>
</dt>
<dd><p>Devuelve el grafo inducido por el subconjunto <var>V</var> de vértices del grafo <var>g</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) V : [0,1,2,3,4]$
(%i4) g : induced_subgraph(V, p)$
(%i5) print_graph(g)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  3  0
  3 :  2  4
  2 :  1  3
  1 :  0  2
  0 :  1  4
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>line_graph</b><i> (<var>g</var>)</i>
<a name="IDX2287"></a>
</dt>
<dd><p>Devuelve el grafo de línea del grafo <var>g</var>.
</p></dd></dl>


<dl>
<dt><u>Función:</u> <b>make_graph</b><i> (<var>vrt</var>, <var>f</var>)</i>
<a name="IDX2288"></a>
</dt>
<dt><u>Función:</u> <b>make_graph</b><i> (<var>vrt</var>, <var>f</var>, <var>oriented</var>)</i>
<a name="IDX2289"></a>
</dt>
<dd><p>Crea un grafo por medio de la función de predicado <var>f</var>.
</p>
<p><var>vrt</var> es una lista o conjunto de vértices o un simplemente un número entero.
Si <var>vrt</var> es un número entero, entonces los vértices del grafo serán los
enteros desde 1 hasta <var>vrt</var>.
</p>
<p><var>f</var> es una función de predicado. Dos vértices <var>a</var> y <var>b</var> se conectarán
si <code>f(a,b)=true</code>.
</p>
<p>Si <var>directed</var> no es <var>false</var>, entonces en grafo será dirigido.
</p>
<p>Ejemplo 1:
</p><pre class="example">(%i1) load(graphs)$
(%i2) g : make_graph(powerset({1,2,3,4,5}, 2), disjointp)$
(%i3) is_isomorphic(g, petersen_graph());
(%o3)                         true
(%i4) get_vertex_label(1, g);
(%o4)                        {1, 2}
</pre>
<p>Ejemplo 2:
</p><pre class="example">(%i1) load(graphs)$
(%i2) f(i, j) := is (mod(j, i)=0)$
(%i3) g : make_graph(20, f, directed=true)$
(%i4) out_neighbors(4, g);
(%o4)                    [8, 12, 16, 20]
(%i5) in_neighbors(18, g);
(%o5)                    [1, 2, 3, 6, 9]
</pre></dd></dl>


<dl>
<dt><u>Función:</u> <b>mycielski_graph</b><i> (<var>g</var>)</i>
<a name="IDX2290"></a>
</dt>
<dd><p>Devuelve el grafo de Mycielski del grafo <var>g</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>new_graph</b><i> ()</i>
<a name="IDX2291"></a>
</dt>
<dd><p>Devuelve el grafo sin vértices ni aristas.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>path_digraph</b><i> (<var>n</var>)</i>
<a name="IDX2292"></a>
</dt>
<dd><p>Devuelve el camino dirigido de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>path_graph</b><i> (<var>n</var>)</i>
<a name="IDX2293"></a>
</dt>
<dd><p>Devuelve el camino de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>petersen_graph</b><i> ()</i>
<a name="IDX2294"></a>
</dt>
<dt><u>Función:</u> <b>petersen_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2295"></a>
</dt>
<dd><p>Devuelve el grafo de Petersen <var>P_{n,d}</var>. Los valores por
defecto para <var>n</var> y <var>d</var> son <code>n=5</code> y <code>d=2</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_bipartite_graph</b><i> (<var>a</var>, <var>b</var>, <var>p</var>)</i>
<a name="IDX2296"></a>
</dt>
<dd><p>Devuelve un grafo aleatorio bipartido a partir de los vértices <code>a+b</code>. Cada
arista se genera con probabilidad <var>p</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_digraph</b><i> (<var>n</var>, <var>p</var>)</i>
<a name="IDX2297"></a>
</dt>
<dd><p>Devuelve un grafo aleatorio dirigido de <var>n</var> vértices. Cada arco se presenta
con una probabilidad <var>p</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_regular_graph</b><i> (<var>n</var>)</i>
<a name="IDX2298"></a>
</dt>
<dt><u>Función:</u> <b>random_regular_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2299"></a>
</dt>
<dd><p>Devuelve un grafo aleatorio <var>d</var>-regular de <var>n</var> vértices. El valor
por defecto para <var>d</var> es <code>d=3</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_graph</b><i> (<var>n</var>, <var>p</var>)</i>
<a name="IDX2300"></a>
</dt>
<dd><p>Devuelve un grafo aleatorio de <var>n</var> vértices. Cada arco se presenta
con una probabilidad <var>p</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_graph1</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2301"></a>
</dt>
<dd><p>Devuelve un grafo aleatorio de <var>n</var> vértices y <var>m</var> arcos aleatorios.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_network</b><i> (<var>n</var>, <var>p</var>, <var>w</var>)</i>
<a name="IDX2302"></a>
</dt>
<dd><p>Devuelve una red aleatoria de <var>n</var> vértices. Cada arco se presenta 
con probabilidad <var>p</var> y tiene un peso dentro del rango <code>[0,w]</code>.
La función devuelve una lista <code>[network, source, sink]</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) [net, s, t] : random_network(50, 0.2, 10.0);
(%o2)                         [DIGRAPH, 50, 51]
(%i3) max_flow(net, s, t)$
(%i4) first(%);
(%o4)                   27.65981397932507
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_tournament</b><i> (<var>n</var>)</i>
<a name="IDX2303"></a>
</dt>
<dd><p>Devuelve un torneo aleatorio de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>random_tree</b><i> (<var>n</var>)</i>
<a name="IDX2304"></a>
</dt>
<dd><p>Devuelve un árbol aleatorio de <var>n</var> vértices.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>small_rhombicosidodecahedron_graph</b><i> ()</i>
<a name="IDX2305"></a>
</dt>
<dd><p>Devuelve el grafo pequeño rombicosidodecaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>small_rhombicuboctahedron_graph</b><i> ()</i>
<a name="IDX2306"></a>
</dt>
<dd><p>Devuelve el grafo pequeño rombicocubicooctaédrico.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>snub_cube_graph</b><i> ()</i>
<a name="IDX2307"></a>
</dt>
<dd><p>Devuelve el grafo cúbico volteado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>snub_dodecahedron_graph</b><i> ()</i>
<a name="IDX2308"></a>
</dt>
<dd><p>Devuelve el grafo dodecaédrico volteado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>truncated_cube_graph</b><i> ()</i>
<a name="IDX2309"></a>
</dt>
<dd><p>Devuelve el grafo cúbico truncado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>truncated_dodecahedron_graph</b><i> ()</i>
<a name="IDX2310"></a>
</dt>
<dd><p>Devuelve el grafo dodecaédrico truncado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>truncated_icosahedron_graph</b><i> ()</i>
<a name="IDX2311"></a>
</dt>
<dd><p>Devuelve el grafo icosaédrico truncado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>truncated_tetrahedron_graph</b><i> ()</i>
<a name="IDX2312"></a>
</dt>
<dd><p>Devuelve el grafo del tetraedro truncado.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>tutte_graph</b><i> ()</i>
<a name="IDX2313"></a>
</dt>
<dd><p>Devuelve el grafo de Tutte.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>underlying_graph</b><i> (<var>g</var>)</i>
<a name="IDX2314"></a>
</dt>
<dd><p>Devuelve el grafo asociado al grafo orientado <var>g</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>wheel_graph</b><i> (<var>n</var>)</i>
<a name="IDX2315"></a>
</dt>
<dd><p>Devuelve el grafo de rueda de <var>n+1</var> vértices.
</p></dd></dl>

<hr size="6">
<a name="SEC283"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC282" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC284" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 55.2.2 Propiedades de los grafos </h3>

<dl>
<dt><u>Función:</u> <b>adjacency_matrix</b><i> (<var>gr</var>)</i>
<a name="IDX2316"></a>
</dt>
<dd><p>Devuelve la matriz de adyacencia del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(4)$
(%i3) adjacency_matrix(c5);
                                [ 0  1  0  1 ]
                                [            ]
                                [ 1  0  1  0 ]
(%o3)                           [            ]
                                [ 0  1  0  1 ]
                                [            ]
                                [ 1  0  1  0 ]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>average_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2317"></a>
</dt>
<dd><p>Devuelve el grado medio de los vértices del garfo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) average_degree(grotzch_graph());
                                      40
(%o2)                                 --
                                      11
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>biconnected_components</b><i> (<var>gr</var>)</i>
<a name="IDX2318"></a>
</dt>
<dd><p>Devuelve los subconjuntos de vértices biconectados del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(
            [1,2,3,4,5,6,7],
            [
             [1,2],[2,3],[2,4],[3,4],
             [4,5],[5,6],[4,6],[6,7]
            ])$
(%i3) biconnected_components(g);
(%o3)               [[6, 7], [4, 5, 6], [1, 2], [2, 3, 4]]
</pre>
<p><div class="image"><img src="./../figures/graphs13.gif" alt="../figures/graphs13"></div>
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>bipartition</b><i> (<var>gr</var>)</i>
<a name="IDX2319"></a>
</dt>
<dd><p>Devuelve una bipartición de los vértices del grafo <var>gr</var>, o una
lista vacía si <var>gr</var> no es bipartido.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) h : heawood_graph()$
(%i3) [A,B]:bipartition(h);
(%o3)         [[8, 12, 6, 10, 0, 2, 4], [13, 5, 11, 7, 9, 1, 3]]
(%i4) draw_graph(h, show_vertices=A, program=circular)$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs02.gif" alt="../figures/graphs02"></div>
</p>
<dl>
<dt><u>Función:</u> <b>chromatic_index</b><i> (<var>gr</var>)</i>
<a name="IDX2320"></a>
</dt>
<dd><p>Devuelve el índice cromático del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) chromatic_index(p);
(%o3)                                  4
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>chromatic_number</b><i> (<var>gr</var>)</i>
<a name="IDX2321"></a>
</dt>
<dd><p>Devuelve el número cromático del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) chromatic_number(cycle_graph(5));
(%o2)                                  3
(%i3) chromatic_number(cycle_graph(6));
(%o3)                                  2
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>clear_edge_weight</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2322"></a>
</dt>
<dd><p>Elimina el peso del arco <var>e</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(3, [[[0,1], 1.5], [[1,2], 1.3]])$
(%i3) get_edge_weight([0,1], g);
(%o3)                                 1.5
(%i4) clear_edge_weight([0,1], g)$
(%i5) get_edge_weight([0,1], g);
(%o5)                                  1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>clear_vertex_label</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2323"></a>
</dt>
<dd><p>Elimina la etiqueta del vértice <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                               Zero
(%i4) clear_vertex_label(0, g);
(%o4)                               done
(%i5) get_vertex_label(0, g);
(%o5)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>connected_components</b><i> (<var>gr</var>)</i>
<a name="IDX2324"></a>
</dt>
<dd><p>Devuelve las componentes conexas del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g: graph_union(cycle_graph(5), path_graph(4))$
(%i3) connected_components(g);
(%o3)                  [[1, 2, 3, 4, 0], [8, 7, 6, 5]]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>diameter</b><i> (<var>gr</var>)</i>
<a name="IDX2325"></a>
</dt>
<dd><p>Devuelve el diámetro del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) diameter(dodecahedron_graph());
(%o2)                                 5
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>edge_coloring</b><i> (<var>gr</var>)</i>
<a name="IDX2326"></a>
</dt>
<dd><p>Devuelve una coloración óptima de los arcos del grafo <var>gr</var>.
</p>
<p>La función devuelve el índice cromático y una lista
que representa el coloreado de los arcos de <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) [ch_index, col] : edge_coloring(p);
(%o3) [4, [[[0, 5], 3], [[5, 7], 1], [[0, 1], 1], [[1, 6], 2], 
[[6, 8], 1], [[1, 2], 3], [[2, 7], 4], [[7, 9], 2], [[2, 3], 2], 
[[3, 8], 3], [[5, 8], 2], [[3, 4], 1], [[4, 9], 4], [[6, 9], 3], 
[[0, 4], 2]]]
(%i4) assoc([0,1], col);
(%o4)                           1
(%i5) assoc([0,5], col);
(%o5)                           3
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>degree_sequence</b><i> (<var>gr</var>)</i>
<a name="IDX2327"></a>
</dt>
<dd><p>Devuelve una lista con los grados de los vértices del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) degree_sequence(random_graph(10, 0.4));
(%o2)            [2, 2, 2, 2, 2, 2, 3, 3, 3, 3]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>edge_connectivity</b><i> (<var>gr</var>)</i>
<a name="IDX2328"></a>
</dt>
<dd><p>Devuelve la conectividad de las aristas del grafo <var>gr</var>.
</p>
<p>Véase también <code>min_edge_cut</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>edges</b><i> (<var>gr</var>)</i>
<a name="IDX2329"></a>
</dt>
<dd><p>Devuelve la lista de las aristas (arcos) del grafo (dirigido) <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) edges(complete_graph(4));
(%o2)         [[2, 3], [1, 3], [1, 2], [0, 3], [0, 2], [0, 1]]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>get_edge_weight</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2330"></a>
</dt>
<dt><u>Función:</u> <b>get_edge_weight</b><i> (<var>e</var>, <var>gr</var>, <var>ifnot</var>)</i>
<a name="IDX2331"></a>
</dt>
<dd><p>Devuelve el peso de la arista <var>e</var> del grafo <var>gr</var>.
</p>
<p>Si la arista no tiene peso, la función devuelve 1. Si la arista no
pertenece al grafo, la función emite un mensaje de error o devuelve
el argumento opcional <var>ifnot</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) get_edge_weight([1,2], c5);
(%o3)                                 1
(%i4) set_edge_weight([1,2], 2.0, c5);
(%o4)                               done
(%i5) get_edge_weight([1,2], c5);
(%o5)                                2.0
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>get_vertex_label</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2332"></a>
</dt>
<dd><p>Devuelve la etiqueta del vértice <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                               Zero
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_charpoly</b><i> (<var>gr</var>, <var>x</var>)</i>
<a name="IDX2333"></a>
</dt>
<dd><p>Devuelve el polinomio característico (de variable <var>x</var>)
del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_charpoly(p, x), factor;
                                         5        4
(%o3)                     (x - 3) (x - 1)  (x + 2)
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_center</b><i> (<var>gr</var>)</i>
<a name="IDX2334"></a>
</dt>
<dd><p>Devuelve el centro del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_center(g);
(%o3)                               [12]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_eigenvalues</b><i> (<var>gr</var>)</i>
<a name="IDX2335"></a>
</dt>
<dd><p>Devuelve los valores propios del grafo <var>gr</var>. La función
devuelve los valores propios en el mismo formato en el que lo 
hace la función <code>eigenvalue</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_eigenvalues(p);
(%o3)                     [[3, - 2, 1], [1, 4, 5]]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_periphery</b><i> (<var>gr</var>)</i>
<a name="IDX2336"></a>
</dt>
<dd><p>Devuelve la periferia del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_periphery(g);
(%o3)                          [24, 20, 4, 0]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_size</b><i> (<var>gr</var>)</i>
<a name="IDX2337"></a>
</dt>
<dd><p>Devuelve el número de aristas del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_size(p);
(%o3)                                15
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph_order</b><i> (<var>gr</var>)</i>
<a name="IDX2338"></a>
</dt>
<dd><p>Devuelve el número de vértices del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_order(p);
(%o3)                                10
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>girth</b><i> (<var>gr</var>)</i>
<a name="IDX2339"></a>
</dt>
<dd><p>Devuelve la longitud del ciclo más corto del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : heawood_graph()$
(%i3) girth(g);
(%o3)                                 6
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>hamilton_cycle</b><i> (<var>gr</var>)</i>
<a name="IDX2340"></a>
</dt>
<dd><p>Devuelve el ciclo de Hamilton del grafo <var>gr</var> o una lista vacía
si <var>gr</var> no es hamiltoniano.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c : cube_graph(3)$
(%i3) hc : hamilton_cycle(c);
(%o3)              [7, 3, 2, 6, 4, 0, 1, 5, 7]
(%i4) draw_graph(c, show_edges=vertices_to_cycle(hc))$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs03.gif" alt="../figures/graphs03"></div>
</p>
<dl>
<dt><u>Función:</u> <b>hamilton_path</b><i> (<var>gr</var>)</i>
<a name="IDX2341"></a>
</dt>
<dd><p>Devuelve el camino de Hamilton del grafo <var>gr</var> o una lista vacía
si <var>gr</var> no los tiene.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) hp : hamilton_path(p);
(%o3)                  [0, 5, 7, 2, 1, 6, 8, 3, 4, 9]
(%i4) draw_graph(p, show_edges=vertices_to_path(hp))$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs04.gif" alt="../figures/graphs04"></div>
</p>
<dl>
<dt><u>Función:</u> <b>isomorphism</b><i> (<var>gr1</var>, <var>gr2</var>)</i>
<a name="IDX2342"></a>
</dt>
<dd><p>Devuelve un isomorfismo entre los grafos/digrafos <var>gr1</var> y <var>gr2</var>.
Si <var>gr1</var> y <var>gr2</var> no son isomorfos, devuelve una lista vacía.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) isomorphism(clk5, petersen_graph());
(%o3) [9 -&gt; 0, 2 -&gt; 1, 6 -&gt; 2, 5 -&gt; 3, 0 -&gt; 4, 1 -&gt; 5, 3 -&gt; 6, 
                                          4 -&gt; 7, 7 -&gt; 8, 8 -&gt; 9]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>in_neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2343"></a>
</dt>
<dd><p>Devuelve la lista de los nodos hijos del vértice <var>v</var>
del grafo orientado <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                                 [1]
(%i4) out_neighbors(2, p);
(%o4)                                 []
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_biconnected</b><i> (<var>gr</var>)</i>
<a name="IDX2344"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> está biconectado y <code>false</code>
en caso contrario.
</p>
<p>Ejemplo:
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_biconnected(cycle_graph(5));
(%o2)                         true
(%i3) is_biconnected(path_graph(5));
(%o3)                         false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_bipartite</b><i> (<var>gr</var>)</i>
<a name="IDX2345"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es bipartido (2-coloreable) y <code>false</code>
en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_bipartite(petersen_graph());
(%o2)                               false
(%i3) is_bipartite(heawood_graph());
(%o3)                               true
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_connected</b><i> (<var>gr</var>)</i>
<a name="IDX2346"></a>
</dt>
<dd><p>Devuelve <code>true</code> si el grafo <var>gr</var> es conexo y <code>false</code>
en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_connected(graph_union(cycle_graph(4), path_graph(3)));
(%o2)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_digraph</b><i> (<var>gr</var>)</i>
<a name="IDX2347"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es un grafo orientado (digrafo) y
<code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_digraph(path_graph(5));
(%o2)                               false
(%i3) is_digraph(path_digraph(5));
(%o3)                               true
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_edge_in_graph</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2348"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>e</var> es una arista (arco) del
grafo (digrafo) <var>g</var> y <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_edge_in_graph([2,3], c4);
(%o3)                               true
(%i4) is_edge_in_graph([3,2], c4);
(%o4)                               true
(%i5) is_edge_in_graph([2,4], c4);
(%o5)                               false
(%i6) is_edge_in_graph([3,2], cycle_digraph(4));
(%o6)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_graph</b><i> (<var>gr</var>)</i>
<a name="IDX2349"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es un grafo y <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_graph(path_graph(5));
(%o2)                               true
(%i3) is_graph(path_digraph(5));
(%o3)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_graph_or_digraph</b><i> (<var>gr</var>)</i>
<a name="IDX2350"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es una grafo, orientado o no,
y <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_graph_or_digraph(path_graph(5));
(%o2)                               true
(%i3) is_graph_or_digraph(path_digraph(5));
(%o3)                               true
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_isomorphic</b><i> (<var>gr1</var>, <var>gr2</var>)</i>
<a name="IDX2351"></a>
</dt>
<dd><p>Devuelve <code>true</code> si los grafos/digrafos <var>gr1</var> y <var>gr2</var> son
isomorfos y <code>false</code> en caso contrario.
</p>
<p>Véase también <code>isomorphism</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) is_isomorphic(clk5, petersen_graph());
(%o3)                         true
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_planar</b><i> (<var>gr</var>)</i>
<a name="IDX2352"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es un grafo planar y <code>false</code> en caso contrario.
</p>
<p>El algoritmo utilizado es el de Demoucron, que es de tiempo cuadrático.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_planar(dodecahedron_graph());
(%o2)                                true
(%i3) is_planar(petersen_graph());
(%o3)                                false
(%i4) is_planar(petersen_graph(10,2));
(%o4)                                true
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_sconnected</b><i> (<var>gr</var>)</i>
<a name="IDX2353"></a>
</dt>
<dd><p>Devuelve <code>true</code> si el grafo orientado <var>gr</var> es fuertemente conexo,
devolviendo <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_sconnected(cycle_digraph(5));
(%o2)                               true
(%i3) is_sconnected(path_digraph(5));
(%o3)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_vertex_in_graph</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2354"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>v</var> es un vértice del grafo <var>g</var>
y <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_vertex_in_graph(0, c4);
(%o3)                               true
(%i4) is_vertex_in_graph(6, c4);
(%o4)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>is_tree</b><i> (<var>gr</var>)</i>
<a name="IDX2355"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>gr</var> es un árbol y <code>false</code> en caso contrario.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) is_tree(random_tree(4));
(%o2)                               true
(%i3) is_tree(graph_union(random_tree(4), random_tree(5)));
(%o3)                               false
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>laplacian_matrix</b><i> (<var>gr</var>)</i>
<a name="IDX2356"></a>
</dt>
<dd><p>Devuelve el laplaciano de la matriz del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) laplacian_matrix(cycle_graph(5));
                          [  2   - 1   0    0   - 1 ]
                          [                         ]
                          [ - 1   2   - 1   0    0  ]
                          [                         ]
(%o2)                     [  0   - 1   2   - 1   0  ]
                          [                         ]
                          [  0    0   - 1   2   - 1 ]
                          [                         ]
                          [ - 1   0    0   - 1   2  ]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>max_clique</b><i> (<var>gr</var>)</i>
<a name="IDX2357"></a>
</dt>
<dd><p>Devuelve el clique máximo del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.5)$
(%i3) max_clique(g);
(%o3)       [6, 12, 31, 36, 52, 59, 62, 63, 80]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>max_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2358"></a>
</dt>
<dd><p>Devuelve el grado máximo de los vértices del grafo <var>gr</var> y un 
vértice de grado máximo.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.02)$
(%i3) max_degree(g);
(%o3)                        [6, 79]
(%i4) vertex_degree(95, g);
(%o4)                           3
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>max_flow</b><i> (<var>net</var>, <var>s</var>, <var>t</var>)</i>
<a name="IDX2359"></a>
</dt>
<dd><p>Devuelve el flujo maximal de la red <var>net</var> con origen en
<var>s</var> y final en <var>t</var>.
</p>
<p>La función devuelve el valor del flujo maximal y una lista con los
pesos de los arcos del flujo óptimo.
</p>
<p>Ejemplo:
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) net : create_graph(
  [1,2,3,4,5,6],
  [[[1,2], 1.0],
   [[1,3], 0.3],
   [[2,4], 0.2],
   [[2,5], 0.3],
   [[3,4], 0.1],
   [[3,5], 0.1],
   [[4,6], 1.0],
   [[5,6], 1.0]],
  directed=true)$
(%i3) [flow_value, flow] : max_flow(net, 1, 6);
(%o3) [0.7, [[[1, 2], 0.5], [[1, 3], 0.2], [[2, 4], 0.2],
[[2, 5], 0.3], [[3, 4], 0.1], [[3, 5], 0.1], [[4, 6], 0.3],
[[5, 6], 0.4]]]
(%i4) fl : 0$
(%i5) for u in out_neighbors(1, net) 
         do fl : fl + assoc([1, u], flow)$
(%i6) fl;
(%o6)                                 0.7
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>max_independent_set</b><i> (<var>gr</var>)</i>
<a name="IDX2360"></a>
</dt>
<dd><p>Devuelve un conjunto maximal independiente de vértices del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) mi : max_independent_set(d);
(%o3)             [0, 3, 5, 9, 10, 11, 18, 19]
(%i4) draw_graph(d, show_vertices=mi)$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs05.gif" alt="../figures/graphs05"></div>
</p>
<dl>
<dt><u>Función:</u> <b>max_matching</b><i> (<var>gr</var>)</i>
<a name="IDX2361"></a>
</dt>
<dd><p>Devuelve un conjunto maximal independiente de aristas del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) m : max_matching(d);
(%o3) [[5, 7], [8, 9], [6, 10], [14, 19], [13, 18], [12, 17], 
                               [11, 16], [0, 15], [3, 4], [1, 2]]
(%i4) draw_graph(d, show_edges=m)$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs06.gif" alt="../figures/graphs06"></div>
</p>
<dl>
<dt><u>Función:</u> <b>min_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2362"></a>
</dt>
<dd><p>Devuelve el grado mínimo de los vértices del grafo <var>gr</var> y un 
vértice de grado mínimo.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.1)$
(%i3) min_degree(g);
(%o3)                              [3, 49]
(%i4) vertex_degree(21, g);
(%o4)                                 9
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>min_edge_cut</b><i> (<var>gr</var>)</i>
<a name="IDX2363"></a>
</dt>
<dd><p>Devuelve el mínimo <i>edge cut</i> del grafo <var>gr</var>. Un <i>edge cut</i> es
un conjunto de aristas cuya eliminación aumenta el número de componentes del grafo.
</p>
<p>Véase también <code>edge_connectivity</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>min_vertex_cover</b><i> (<var>gr</var>)</i>
<a name="IDX2364"></a>
</dt>
<dd><p>Devuelve el mínimo nodo <i>covering</i> del grafo <var>gr</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>min_vertex_cut</b><i> (<var>gr</var>)</i>
<a name="IDX2365"></a>
</dt>
<dd><p>Devuelve el mínimo <i>vertex cut</i> del grafo <var>gr</var>.
</p>
<p>Véase también <code>vertex_connectivity</code>.
</p></dd></dl>


<dl>
<dt><u>Función:</u> <b>minimum_spanning_tree</b><i> (<var>gr</var>)</i>
<a name="IDX2366"></a>
</dt>
<dd><p>Devuelve el grafo de expansión mínimo del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(path_graph(10), path_graph(10))$
(%i3) t : minimum_spanning_tree(g)$
(%i4) draw_graph(g, show_edges=edges(t))$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs07.gif" alt="../figures/graphs07"></div>
</p>
<dl>
<dt><u>Función:</u> <b>neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2367"></a>
</dt>
<dd><p>Devuelve la lista de los vecinos del vértice <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) neighbors(3, p);
(%o3)                             [4, 8, 2]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>odd_girth</b><i> (<var>gr</var>)</i>
<a name="IDX2368"></a>
</dt>
<dd><p>Devuelve la longitud del ciclo impar más corto del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(cycle_graph(4), cycle_graph(7))$
(%i3) girth(g);
(%o3)                                 4
(%i4) odd_girth(g);
(%o4)                                 7
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>out_neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2369"></a>
</dt>
<dd><p>Devuelve la lista de los nodos padres del vértice <var>v</var> del grafo
orientado <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                                 [1]
(%i4) out_neighbors(2, p);
(%o4)                                 []
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>planar_embedding</b><i> (<var>gr</var>)</i>
<a name="IDX2370"></a>
</dt>
<dd><p>Devuelve la lista de caminos faciales en una proyección planar de <var>gr</var>,
o <code>false</code> si <var>gr</var> no es un grafo planar.
</p>
<p>El grafo <var>gr</var> debe estar biconectado.
</p>
<p>El algoritmo utilizado es el de Demoucron, que es de tiempo cuadrático.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) planar_embedding(grid_graph(3,3));
(%o2) [[3, 6, 7, 8, 5, 2, 1, 0], [4, 3, 0, 1], [3, 4, 7, 6], 
                                      [8, 7, 4, 5], [1, 2, 5, 4]]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>print_graph</b><i> (<var>gr</var>)</i>
<a name="IDX2371"></a>
</dt>
<dd><p>Muestra alguna información sobre el grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) print_graph(c5)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  0  3
  3 :  4  2
  2 :  3  1
  1 :  2  0
  0 :  4  1
(%i4) dc5 : cycle_digraph(5)$
(%i5) print_graph(dc5)$
Digraph on 5 vertices with 5 arcs.
Adjacencies:
  4 :  0
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i6) out_neighbors(0, dc5);
(%o6)                                [1]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>radius</b><i> (<var>gr</var>)</i>
<a name="IDX2372"></a>
</dt>
<dd><p>Devuelve el radio del grafo  <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) radius(dodecahedron_graph());
(%o2)                                 5
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>set_edge_weight</b><i> (<var>e</var>, <var>w</var>, <var>gr</var>)</i>
<a name="IDX2373"></a>
</dt>
<dd><p>Asigna el peso <var>w</var> a la arista <var>e</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1, 2], [[[1,2], 1.2]])$
(%i3) get_edge_weight([1,2], g);
(%o3)                                1.2
(%i4) set_edge_weight([1,2], 2.1, g);
(%o4)                               done
(%i5) get_edge_weight([1,2], g);
(%o5)                                2.1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>set_vertex_label</b><i> (<var>v</var>, <var>l</var>, <var>gr</var>)</i>
<a name="IDX2374"></a>
</dt>
<dd><p>Asigna la etiqueta <var>l</var> al vértice <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[1, &quot;One&quot;], [2, &quot;Two&quot;]], [[1,2]])$
(%i3) get_vertex_label(1, g);
(%o3)                                One
(%i4) set_vertex_label(1, &quot;oNE&quot;, g);
(%o4)                               done
(%i5) get_vertex_label(1, g);
(%o5)                                oNE
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>shortest_path</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2375"></a>
</dt>
<dd><p>Devuelve el camino más corto desde <var>u</var> hasta <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) path : shortest_path(0, 7, d);
(%o3)                          [0, 1, 19, 13, 7]
(%i4) draw_graph(d, show_edges=vertices_to_path(path))$
</pre></dd></dl>

<p><div class="image"><img src="./../figures/graphs08.gif" alt="../figures/graphs08"></div>
</p>

<dl>
<dt><u>Función:</u> <b>shortest_weighted_path</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2376"></a>
</dt>
<dd><p>Devuelve la longitud del camino más corto ponderado y el propio camino
más corto ponderado desde <var>u</var> hasta <var>v</var> en el grafo <var>gr</var>.
</p>
<p>La longitud del camino ponderado es la suma de los pesos de las aristas
del camino. Si una arista no tiene peso asignado, su valor por defecto
es la unidad.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g: petersen_graph(20, 2)$
(%i3) for e in edges(g) do set_edge_weight(e, random(1.0), g)$
(%i4) shortest_weighted_path(0, 10, g);
(%o4) [2.575143920268482, [0, 20, 38, 36, 34, 32, 30, 10]]
</pre>
</dd></dl>


<dl>
<dt><u>Función:</u> <b>strong_components</b><i> (<var>gr</var>)</i>
<a name="IDX2377"></a>
</dt>
<dd><p>Devuelve las componentes fuertes del grafo orientado <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(4)$
(%i3) strong_components(t);
(%o3)                         [[1], [0], [2], [3]]
(%i4) vertex_out_degree(3, t);
(%o4)                                 3
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>topological_sort</b><i> (<var>dag</var>)</i>
<a name="IDX2378"></a>
</dt>
<dd><p>Devuelve el orden topológico de los vértices del grafo orientado <var>dag</var>
o una lista vacía si <var>dag</var> no es un grafo orientado
acíclico.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(
         [1,2,3,4,5],
         [
          [1,2], [2,5], [5,3],
          [5,4], [3,4], [1,3]
         ],
         directed=true)$
(%i3) topological_sort(g);
(%o3)                           [1, 2, 5, 3, 4]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_connectivity</b><i> (<var>g</var>)</i>
<a name="IDX2379"></a>
</dt>
<dd><p>Devuelve la conectividad de los vértices del grafo <var>g</var>.
</p>
<p>Véase también <code>min_vertex_cut</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2380"></a>
</dt>
<dd><p>Devuelve el grado del vértice <var>v</var> del grafo <var>gr</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_distance</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2381"></a>
</dt>
<dd><p>Devuelve la longitud del camino más corto entre <var>u</var> y <var>v</var>
del grafo o digrafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) vertex_distance(0, 7, d);
(%o3)                                 4
(%i4) shortest_path(0, 7, d);
(%o4)                         [0, 1, 19, 13, 7]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_eccentricity</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2382"></a>
</dt>
<dd><p>Devuelve la excentricidad del vértice <var>v</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:cycle_graph(7)$
(%i3) vertex_eccentricity(0, g);
(%o3)                           3
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_in_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2383"></a>
</dt>
<dd><p>Devuelve el grado de entrada del vértice <var>v</var> del grafo 
orientado <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p5 : path_digraph(5)$
(%i3) print_graph(p5)$
Digraph on 5 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i4) vertex_in_degree(4, p5);
(%o4)                                 1
(%i5) in_neighbors(4, p5);
(%o5)                                [3]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_out_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2384"></a>
</dt>
<dd><p>Devuelve el grado de salida del vértice <var>v</var> del grafo
orientado <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(10)$
(%i3) vertex_out_degree(0, t);
(%o3)                           2
(%i4) out_neighbors(0, t);
(%o4)                        [7, 1]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertices</b><i> (<var>gr</var>)</i>
<a name="IDX2385"></a>
</dt>
<dd><p>Devuelve la lista de vértices del grafo <var>gr</var>.
</p>
<p>Example
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) vertices(complete_graph(4));
(%o2)                           [3, 2, 1, 0]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_coloring</b><i> (<var>gr</var>)</i>
<a name="IDX2386"></a>
</dt>
<dd><p>Devuelve un coloreado óptimo de los vértices del grafo <var>gr</var>.
</p>
<p>La función devuelve el número cromático y una lista 
representando el coloreado de los vértices de <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p:petersen_graph()$
(%i3) vertex_coloring(p);
(%o3) [3, [[0, 2], [1, 3], [2, 2], [3, 3], [4, 1], [5, 3], 
                                 [6, 1], [7, 1], [8, 2], [9, 2]]]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>wiener_index</b><i> (<var>gr</var>)</i>
<a name="IDX2387"></a>
</dt>
<dd><p>Devuelve el índice de Wiener del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) wiener_index(dodecahedron_graph());
(%o1)                          500
</pre></dd></dl>











<hr size="6">
<a name="SEC284"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC283" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC285" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 55.2.3 Modificación de grafos </h3>


<dl>
<dt><u>Función:</u> <b>add_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2388"></a>
</dt>
<dd><p>Añade la arista <var>e</var> al grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p : path_graph(4)$
(%i3) neighbors(0, p);
(%o3)                                [1]
(%i4) add_edge([0,3], p);
(%o4)                               done
(%i5) neighbors(0, p);
(%o5)                              [3, 1]
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>add_edges</b><i> (<var>e_list</var>, <var>gr</var>)</i>
<a name="IDX2389"></a>
</dt>
<dd><p>Añade las aristas de la lista  <var>e_list</var> al grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : empty_graph(3)$
(%i3) add_edges([[0,1],[1,2]], g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  1
  1 :  2  0
  0 :  1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>add_vertex</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2390"></a>
</dt>
<dd><p>Añade el vértice <var>v</var> al grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : path_graph(2)$
(%i3) add_vertex(2, g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 1 edges.
Adjacencies:
  2 :
  1 :  0
  0 :  1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>add_vertices</b><i> (<var>v_list</var>, <var>gr</var>)</i>
<a name="IDX2391"></a>
</dt>
<dd><p>Añade los vértices de la lista  <var>v_list</var> al grafo <var>gr</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>connect_vertices</b><i> (<var>v_list</var>, <var>u_list</var>, <var>gr</var>)</i>
<a name="IDX2392"></a>
</dt>
<dd><p>Conecta todos los vértices de la lista <var>v_list</var> con los vértices
de la lista <var>u_list</var> del grafo <var>gr</var>.
</p>
<p><var>v_list</var> y <var>u_list</var> pueden ser vértices aislados o una lista de
vértices.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : empty_graph(4)$
(%i3) connect_vertices(0, [1,2,3], g)$
(%i4) print_graph(g)$
Graph on 4 vertices with 3 edges.
Adjacencies:
  3 :  0
  2 :  0
  1 :  0
  0 :  3  2  1
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>contract_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2393"></a>
</dt>
<dd><p>Contrae la arista <var>e</var> del <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g: create_graph(
       8, [[0,3],[1,3],[2,3],[3,4],[4,5],[4,6],[4,7]])$
(%i3) print_graph(g)$
Graph on 8 vertices with 7 edges.
Adjacencies:
  7 :  4
  6 :  4
  5 :  4
  4 :  7  6  5  3
  3 :  4  2  1  0
  2 :  3
  1 :  3
  0 :  3
(%i4) contract_edge([3,4], g)$
(%i5) print_graph(g)$
Graph on 7 vertices with 6 edges.
Adjacencies:
  7 :  3
  6 :  3
  5 :  3
  3 :  5  6  7  2  1  0
  2 :  3
  1 :  3
  0 :  3
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>remove_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2394"></a>
</dt>
<dd><p>Elimina la arista <var>e</var> del grafo <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) c3 : cycle_graph(3)$
(%i3) remove_edge([0,1], c3)$
(%i4) print_graph(c3)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  0  1
  1 :  2
  0 :  2
</pre></dd></dl>

<dl>
<dt><u>Función:</u> <b>remove_vertex</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2395"></a>
</dt>
<dd><p>Elimina el vértice <var>v</var> del grafo <var>gr</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertex_coloring</b><i> (<var>gr</var>)</i>
<a name="IDX2396"></a>
</dt>
<dd><p>Devuelve un coloreado óptimo de los vértice del grafo <var>gr</var>.
</p>
<p>La función devuelve el número cromático y una lista representando 
el coloreado de los vértices de <var>gr</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) p:petersen_graph()$
(%i3) vertex_coloring(p);
(%o3) [3, [[0, 2], [1, 3], [2, 2], [3, 3], [4, 1], [5, 3], 
                                [6, 1], [7, 1], [8, 2], [9, 2]]]
</pre></dd></dl>


<hr size="6">
<a name="SEC285"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC284" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC286" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 55.2.4 Lectura y escritura de ficheros </h3>

<dl>
<dt><u>Función:</u> <b>dimacs_export</b><i> (<var>gr</var>, <var>fl</var>)</i>
<a name="IDX2397"></a>
</dt>
<dt><u>Función:</u> <b>dimacs_export</b><i> (<var>gr</var>, <var>fl</var>, <var>comment1</var>, ..., <var>commentn</var>)</i>
<a name="IDX2398"></a>
</dt>
<dd><p>Exporta el grafo al fichero <var>fl</var> en formato DIMACS. Los comentarios
adicionales se anãdirán al comienzo del fichero.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>dimacs_import</b><i> (<var>fl</var>)</i>
<a name="IDX2399"></a>
</dt>
<dd><p>Lee el grafo almacenado en el fichero <var>fl</var> en formato DIMACS.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph6_decode</b><i> (<var>str</var>)</i>
<a name="IDX2400"></a>
</dt>
<dd><p>Devuelve el grafo codificado en formato graph6 en la cadena <var>str</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph6_encode</b><i> (<var>gr</var>)</i>
<a name="IDX2401"></a>
</dt>
<dd><p>Devuelve una cadena codificando el grafo <var>gr</var> en formato graph6.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph6_export</b><i> (<var>gr_list</var>, <var>fl</var>)</i>
<a name="IDX2402"></a>
</dt>
<dd><p>Exporta los grafos de la lista <var>gr_list</var> al fichero <var>fl</var> en formato graph6.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>graph6_import</b><i> (<var>fl</var>)</i>
<a name="IDX2403"></a>
</dt>
<dd><p>Lee la lista de grafos almacenados en el fichero <var>fl</var> en formato graph6.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>sparse6_decode</b><i> (<var>str</var>)</i>
<a name="IDX2404"></a>
</dt>
<dd><p>Devuelve el grafo codificado en formato sparse6 en la cadena <var>str</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>sparse6_encode</b><i> (<var>gr</var>)</i>
<a name="IDX2405"></a>
</dt>
<dd><p>Devuelve una cadena codificando el grafo <var>gr</var> en formato sparse6.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>sparse6_export</b><i> (<var>gr_list</var>, <var>fl</var>)</i>
<a name="IDX2406"></a>
</dt>
<dd><p>Exporta los grafos de la lista <var>gr_list</var> al fichero <var>fl</var> en formato sparse6.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>sparse6_import</b><i> (<var>fl</var>)</i>
<a name="IDX2407"></a>
</dt>
<dd><p>Lee la lista de grafos almacenados en el fichero <var>fl</var> en formato sparse6.
</p></dd></dl>

<hr size="6">
<a name="SEC286"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC285" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC281" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 55.2.5 Visualización </h3>

<dl>
<dt><u>Función:</u> <b>draw_graph</b><i> (<var>graph</var>)</i>
<a name="IDX2408"></a>
</dt>
<dt><u>Función:</u> <b>draw_graph</b><i> (<var>graph</var>, <var>option1</var>, ..., <var>optionk</var>)</i>
<a name="IDX2409"></a>
</dt>
<dd><p>Dibuja el grafo utilizando el paquete <code>draw</code>.
</p>
<p>El algoritmo utilizado para posicionar los vértices se especifica con el argumento
opcional <var>program</var>, cuyo valor por defecto es <code>program=spring_embedding</code>.
<var>draw_graph</var> también puede utilizar los programas de graphviz para
posicionar los vértices, para lo cual deberá instalarse separadamente el programa graphviz.
</p>
<p>Ejemplo 1:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:grid_graph(10,10)$
(%i3) m:max_matching(g)$
(%i4) draw_graph(g,
   spring_embedding_depth=100,
   show_edges=m, edge_type=dots,
   vertex_size=0)$
</pre>
<p><div class="image"><img src="./../figures/graphs09.gif" alt="../figures/graphs09"></div>
</p>
<p>Ejemplo 2:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(16,
    [
     [0,1],[1,3],[2,3],[0,2],[3,4],[2,4],
     [5,6],[6,4],[4,7],[6,7],[7,8],[7,10],[7,11],
     [8,10],[11,10],[8,9],[11,12],[9,15],[12,13],
     [10,14],[15,14],[13,14]
    ])$
(%i3) t:minimum_spanning_tree(g)$
(%i4) draw_graph(
    g,
    show_edges=edges(t),
    show_edge_width=4,
    show_edge_color=green,
    vertex_type=filled_square,
    vertex_size=2
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs10.gif" alt="../figures/graphs10"></div>
</p>
<p>Ejemplo 3:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) mi : max_independent_set(g)$
(%i3) draw_graph(
    g,
    show_vertices=mi,
    show_vertex_type=filled_up_triangle,
    show_vertex_size=2,
    edge_color=cyan,
    edge_width=3,
    =true,
    text_color=brown
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs11.gif" alt="../figures/graphs11"></div>
</p>
<p>Ejemplo 4:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) net : create_graph(
    [0,1,2,3,4,5],
    [
     [[0,1], 3], [[0,2], 2],
     [[1,3], 1], [[1,4], 3],
     [[2,3], 2], [[2,4], 2],
     [[4,5], 2], [[3,5], 2]
    ],
    directed=true
    )$
(%i3) draw_graph(
    net,
    show_weight=true,
    vertex_size=0,
    show_vertices=[0,5],
    show_vertex_type=filled_square,
    head_length=0.2,
    head_angle=10,
    edge_color=&quot;dark-green&quot;,
    text_color=blue
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs12.gif" alt="../figures/graphs12"></div>
</p>
<p>Ejemplo 5:
</p>
<pre class="example">(%i1) load(graphs)$
(%i2) g: petersen_graph(20, 2);
(%o2)                         GRAPH
(%i3) draw_graph(g, redraw=true, program=planar_embedding);
(%o3)                         done
</pre>
<p><div class="image"><img src="./../figures/graphs14.gif" alt="../figures/graphs14"></div>
</p>
<p>Ejemplo 6:
</p>
<pre class="example">(%i1) load(graphs)$
(%i2) t: tutte_graph();
(%o2)                         GRAPH
(%i3) draw_graph(t, redraw=true, 
                    fixed_vertices=[1,2,3,4,5,6,7,8,9]);
(%o3)                         done
</pre>
<p><div class="image"><img src="./../figures/graphs15.gif" alt="../figures/graphs15"></div>
</p>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>draw_graph_program</b>
<a name="IDX2410"></a>
</dt>
<dd><p>Valor por defecto: <var>spring_embedding</var>
</p>
<p>Programa a utilizar por defecto para posicionar los vértices en la función <code>draw_graph</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_id</b>
<a name="IDX2411"></a>
</dt>
<dd><p>Valor por defecto: <var>false</var>
</p>
<p>Si <var>show_id</var> vale <var>true</var> entonces se muestran los
números identificadores de los vértices.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_label</b>
<a name="IDX2412"></a>
</dt>
<dd><p>Valor por defecto: <var>false</var>
</p>
<p>Si <var>show_label</var> vale <var>true</var> entonces se muestran las
etiquetas de los vértices.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>label_alignment</b>
<a name="IDX2413"></a>
</dt>
<dd><p>Valor por defecto: <var>center</var>
</p>
<p>Indica cómo se deben alinear las etiquetas o números
identificadores de los vértices. Puede ser: <code>left</code>, <code>center</code> or <code>right</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_weight</b>
<a name="IDX2414"></a>
</dt>
<dd><p>Valor por defecto: <var>false</var>
</p>
<p>si <var>show_weight</var> vale <var>true</var> entonces se mostrarán 
los pesos de las aristas.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>vertex_type</b>
<a name="IDX2415"></a>
</dt>
<dd><p>Valor por defecto: <var>circle</var>
</p>
<p>Establece cómo se mostrarán los vértices. Véase la
opción <var>point_type</var> del paquete <code>draw</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>vertex_size</b>
<a name="IDX2416"></a>
</dt>
<dd><p>Tamanõ de los vértices.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>vertex_color</b>
<a name="IDX2417"></a>
</dt>
<dd><p>Color a utilizar en los vértices.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_vertices</b>
<a name="IDX2418"></a>
</dt>
<dd><p>Valor por defecto: []
</p>
<p>Dibuja los vértices seleccionados en la lista con colores diferentes.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_vertex_type</b>
<a name="IDX2419"></a>
</dt>
<dd><p>Establece cómo se mostrarán los vértices de
<var>show_vertices</var>. Véase la opción <var>point_type</var> del paquete <code>draw</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_vertex_size</b>
<a name="IDX2420"></a>
</dt>
<dd><p>Tamanõs de los vértices de <var>show_vertices</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_vertex_color</b>
<a name="IDX2421"></a>
</dt>
<dd><p>Color a utilizar en los vértices de la lista <var>show_vertices</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>vertex_partition</b>
<a name="IDX2422"></a>
</dt>
<dd><p>Valor por defecto: []
</p>
<p>Una partición <code>[[v1,v2,...],...,[vk,...,vn]]</code> de los vértices del grafo. Los 
vértices de cada lista se dibujarán de diferente color.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>vertex_coloring</b>
<a name="IDX2423"></a>
</dt>
<dd><p>Colores de los vértices. Los colores <var>col</var> deben
especificarse en el mismo formato que el devuelto por <var>vertex_coloring</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>edge_color</b>
<a name="IDX2424"></a>
</dt>
<dd><p>Color a utilizar en las aristas.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>edge_width</b>
<a name="IDX2425"></a>
</dt>
<dd><p>Ancho de las aristas.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>edge_type</b>
<a name="IDX2426"></a>
</dt>
<dd><p>Establece cómo se dibujarán las aristas. Véase la opción
<var>line_type</var> del paquete <code>draw</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_edges</b>
<a name="IDX2427"></a>
</dt>
<dd><p>Dibuja las aristas de la lista <var>e_list</var> con colores diferentes.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_edge_color</b>
<a name="IDX2428"></a>
</dt>
<dd><p>Color a utilizar en las aristas de la lista <var>show_edges</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_edge_width</b>
<a name="IDX2429"></a>
</dt>
<dd><p>Anchos de las aristas de <var>show_edges</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>show_edge_type</b>
<a name="IDX2430"></a>
</dt>
<dd><p>Establece cómo se dibujarán las aristas de <var>show_edges</var>.
Véase la opción <var>line_type</var> del paquete <code>draw</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>edge_partition</b>
<a name="IDX2431"></a>
</dt>
<dd><p>Una partición <code>[[e1,e2,...],...,[ek,...,em]]</code> de las aristas del grafo.
Las aristas de cada lista se dibujarán de diferente color.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>edge_coloring</b>
<a name="IDX2432"></a>
</dt>
<dd><p>Colores de las aristas. Los colores <var>col</var> deben
especificarse en el mismo formato que el devuelto por <var>edge_coloring</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>redraw</b>
<a name="IDX2433"></a>
</dt>
<dd><p>Valor por defecto: <var>false</var>
</p>
<p>Si <var>redraw</var> vale <code>true</code>, las posiciones de los vértices se recalculan
incluso si las posiciones están almacenadas de un dibujo previo del grafo.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>head_angle</b>
<a name="IDX2434"></a>
</dt>
<dd><p>Valor por defecto: 15
</p>
<p>Ángulo de las flechas de los arcos en los grafos orientados.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>head_length</b>
<a name="IDX2435"></a>
</dt>
<dd><p>Valor por defecto: 0.1
</p>
<p>Longitud de las flechas de los arcos en los grafos orientados.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>spring_embedding_depth</b>
<a name="IDX2436"></a>
</dt>
<dd><p>Valor por defecto: 50
</p>
<p>Número de iteraciones del algoritmo de dibujo de grafos.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>terminal</b>
<a name="IDX2437"></a>
</dt>
<dd><p>Terminal utilizado para ver el gráfo. Véase la opción <var>terminal</var>
del paquete <code>draw</code>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>file_name</b>
<a name="IDX2438"></a>
</dt>
<dd><p>Nombre del fichero cuando el terminal especificado no es la pantalla.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>program</b>
<a name="IDX2439"></a>
</dt>
<dd><p>establece el programa para posicionado de vértices del grafo. Puede ser
cualquiera de los programas graphviz (dot, neato, twopi, circ, fdp), <var>circular</var> o
<var>spring_embedding</var> o <var>planar_embedding</var>; <var>planar_embedding</var> sl'o está
disponible para grafos planares 2-conectados. Si <code>program=spring_embedding</code>,
se puede especificar un conjunto de vértices de posición fija con la opción 
<var>fixed_vertices</var>.
</p></dd></dl>

<dl>
<dt><u>Opción de draw_graph:</u> <b>fixed_vertices</b>
<a name="IDX2440"></a>
</dt>
<dd><p>Especifica una lista de vértices con posiciones fijas en
un polígono regular. Se puede utilizar cuando <code>program=spring_embedding</code>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertices_to_path</b><i> (<var>v_list</var>)</i>
<a name="IDX2441"></a>
</dt>
<dd><p>Convierte una lista <var>v_list</var> de vértices en la lista de aristas del camino
definido por la propia <var>v_list</var>.
</p></dd></dl>

<dl>
<dt><u>Función:</u> <b>vertices_to_cycle</b><i> (<var>v_list</var>)</i>
<a name="IDX2442"></a>
</dt>
<dd><p>Convierte una lista <var>v_list</var> de vértices en la lista de aristas del ciclo
definido por la propia <var>v_list</var>.
</p></dd></dl>




<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC279" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_56.html#SEC287" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>octubre, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
