<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on octubre, 3 2017 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima 5.41.0: 18. Diferenciación</title>

<meta name="description" content="Manual de Maxima 5.41.0: 18. Diferenciación">
<meta name="keywords" content="Manual de Maxima 5.41.0: 18. Diferenciación">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%}
-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Diferenciaci_00f3n"></a>
<a name="SEC108"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_17.html#SEC107" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC109" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_17.html#SEC106" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC110" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 18. Diferenciación </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC109">18.1 Funciones y variables para la diferenciación</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Funciones-y-variables-para-la-diferenciaci_00f3n"></a>
<a name="SEC109"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC108" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC110" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC108" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC108" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC110" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 18.1 Funciones y variables para la diferenciación </h2>

<dl>
<dt><u>Función:</u> <b>antid</b><i> (<var>expr</var>, <var>x</var>, <var>u(x)</var>) </i>
<a name="IDX793"></a>
</dt>
<dd><p>Devuelve una lista con dos elementos, de manera que se pueda calcular la antiderivada de <var>expr</var> respecto de  <var>x</var> a partir de la lista. La expresión <var>expr</var> puede contener una función no especificada <var>u</var> y sus derivadas.
</p>
<p>Sea <var>L</var> la lista con dos elementos que devuelve la función <code>antid</code>.
Entonces, <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>
es una antiderivada de <var>expr</var> con respecto a <var>x</var>.
</p>
<p>Si la ejecución de <code>antid</code> resulta exitosa, el segundo elemento de la lista retornada es cero. En caso contrario, el segundo elemento es distinto de cero y el primero puede ser nulo o no. Si <code>antid</code> no es capaz de hacer ningún progreso, el primer elemento es nulo y el segundo no nulo.
</p>
<p>Es necesario ejecutar <code>load (&quot;antid&quot;)</code> para cargar esta función. El paquete <code>antid</code> define también las funciones <code>nonzeroandfreeof</code> y <code>linear</code>.
</p>
<p>La función <code>antid</code> está relacionada con <code>antidiff</code> como se indica a continuación.
Sea <var>L</var> la lista devuelta por la función <code>antid</code>. Entonces, el resultado de <code>antidiff</code> es igual a  <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>, donde <var>x</var> es la variable de integración.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
</dd></dl>


<dl>
<dt><u>Función:</u> <b>antidiff</b><i> (<var>expr</var>, <var>x</var>, <var>u</var>(<var>x</var>))</i>
<a name="IDX794"></a>
</dt>
<dd><p>Devuelve la antiderivada de <var>expr</var> respecto de <var>x</var>.
La expresión <var>expr</var> puede contener una función no especificada <var>u</var> y sus derivadas.
</p>
<p>Cuando <code>antidiff</code> se ejecuta con éxito, la expresión resultante no tiene símbolos integrales (esto es, no tiene referencias a la función <code>integrate</code>). En otro caso, <code>antidiff</code> devuelve una expresión que se encuentra total o parcialmente bajo el signo de integración. Si <code>antidiff</code> no puede ralizar ningún progreso, el valor devuelto se encuentra completamente bajo la integral.
</p>
<p>Es necesario ejecutar <code>load (&quot;antid&quot;)</code> para cargar esta función. El paquete <code>antid</code> define también las funciones <code>nonzeroandfreeof</code> y <code>linear</code>.
</p>
<p>La función <code>antidiff</code> está relacionada con <code>antid</code> como se indica a continuación.
Sea <var>L</var> la lista de dos elementos que devuelve <code>antid</code>. Entonces, el valor retornado por <code>antidiff</code> es igual a <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>, donde <var>x</var> es la variable de integración.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
</dd></dl>




<dl>
<dt><u>Función:</u> <b>at</b><i> (<var>expr</var>, [<var>eqn_1</var>, ..., <var>eqn_n</var>])</i>
<a name="IDX795"></a>
</dt>
<dt><u>Función:</u> <b>at</b><i> (<var>expr</var>, <var>eqn</var>)</i>
<a name="IDX796"></a>
</dt>
<dd><p>Evalúa la expresión <var>expr</var> asignando a las variables los valores especificados para ellas en la lista de ecuaciones <code>[<var>eqn_1</var>, ..., <var>eqn_n</var>]</code> o en la ecuación simple <var>eqn</var>.
</p>
<p>Si una subexpresión depende de cualquiera de las variables para la cual se especifica un valor, pero  no puede ser evaluado, entonces <code>at</code> devuelve una forma nominal.
</p>
<p>La función <code>at</code> realiza múltiples sustituciones en serie, no en paralelo.
</p>
<p>Véase también <code>atvalue</code>.
Para otras funciones que también llevan a cabo sustituciones, consúltense <code>subst</code> y <code>ev</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x, y)^2 - u(x, y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
</dd></dl>



<dl>
<dt><u>Propiedad:</u> <b>atomgrad</b>
<a name="IDX797"></a>
</dt>
<dd><p>La propiedad <code>atomgrad</code> es asignada por <code>gradef</code>.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>atvalue</b><i> (<var>expr</var>, [<var>x_1</var> = <var>a_1</var>, ..., <var>x_m</var> = <var>a_m</var>], <var>c</var>)</i>
<a name="IDX798"></a>
</dt>
<dt><u>Función:</u> <b>atvalue</b><i> (<var>expr</var>, <var>x_1</var> = <var>a_1</var>, <var>c</var>)</i>
<a name="IDX799"></a>
</dt>
<dd><p>Asigna el valor <var>c</var> a <var>expr</var> en el punto <code><var>x</var> = <var>a</var></code>.
</p>
<p>La expresión <var>expr</var> es una función del tipo 
<code><var>f</var>(<var>x_1</var>, ..., <var>x_m</var>)</code>,
o una derivada,
<code>diff (<var>f</var>(<var>x_1</var>, ..., <var>x_m</var>), <var>x_1</var>, <var>n_1</var>, ..., <var>x_n</var>, <var>n_m</var>)</code>
en la que aparecen los argumentos de la función de forma explícita.
Los símbolos <var>n_i</var> se refieren al orden de diferenciación respecto de <var>x_i</var>.
</p>
<p>El punto en el que <code>atvalue</code> establece el valor se especifica mediante la lista de ecuaciones
<code>[<var>x_1</var> = <var>a_1</var>, ..., <var>x_m</var> = <var>a_m</var>]</code>.
Si hay una única variable <var>x_1</var>, la ecuación puede escribirse sin formar parte de una lista.
</p>
<p>La llamada <code>printprops ([<var>f_1</var>, <var>f_2</var>, ...], atvalue)</code> muestra los valores asignados por <code>atvalue</code> a las funciones <code><var>f_1</var>, <var>f_2</var>, ...</code>.
La llamada  <code>printprops (<var>f</var>, atvalue)</code> muestra los valores asignados por <code>atvalue</code> a la función <var>f</var>.
La llamada  <code>printprops (all, atvalue)</code> muestra los valores asignados por <code>atvalue</code> a todas las funciones.
</p>
<p>Los símbolos <code>@1</code>, <code>@2</code>, ... representan las variables <var>x_1</var>, <var>x_2</var>, ... cuando se muestran los valores asignados por <code>atvalue</code>.
</p>
<p>La función <code>atvalue</code> evalúa sus argumentos y devuelve <var>c</var>, el valor asignado.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x,y)^2 - u(x,y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>cartan</b><i>  -</i>
<a name="IDX800"></a>
</dt>
<dd><p>El cálculo exterior de formas diferenciales es una herramienta básica de la geometría diferencial desarrollada por Elie Cartan, teniendo importantes aplicaciones en la teoría de ecuaciones diferenciales en derivadas parciales.
El paquete <code>cartan</code> dispone de las funciones <code>ext_diff</code> y <code>lie_diff</code>, así como de los operadores <code>~</code> (producto exterior) y <code>|</code> (contracción de una forma con un vector). La orden <code>demo (tensor)</code> permite ver una breve descripción de estas instrucciones, junto con ejemplos.
</p>
<p>El paquete <code>cartan</code> fue escrito por F.B. Estabrook y H.D. Wahlquist.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>del</b><i> (<var>x</var>)</i>
<a name="IDX801"></a>
</dt>
<dd><p>La expresión <code>del (<var>x</var>)</code> representa el diferencial de la variable <em>x</em>.
</p>
<p>La función <code>diff</code> devuelve una expresión que contiene a <code>del</code> si no se ha especificado una variable independiente. En este caso, el valor retornado es el llamado &quot;diferencial total&quot;.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) diff (log (x));
                             del(x)
(%o1)                        ------
                               x
(%i2) diff (exp (x*y));
                     x y              x y
(%o2)            x %e    del(y) + y %e    del(x)
(%i3) diff (x*y*z);
(%o3)         x y del(z) + x z del(y) + y z del(x)
</pre>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>delta</b><i> (<var>t</var>)</i>
<a name="IDX802"></a>
</dt>
<dd><p>Es la función delta de Dirac.
</p>
<p>En el estado actual de desarrollo de Maxima, sólo <code>laplace</code> reconoce la función <code>delta</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) laplace (delta (t - a) * sin(b*t), t, s);
Is  a  positive, negative, or zero?

p;
                                   - a s
(%o1)                   sin(a b) %e
</pre>
</dd></dl>

<dl>
<dt><u>Variable del sistema:</u> <b>dependencies</b>
<a name="IDX803"></a>
</dt>
<dd><p>Valor por defecto: <code>[]</code>
</p>
<p>La variable <code>dependencies</code> es la lista de átomos que tienen algún tipo de dependencia funcional, asignada por <code>depends</code> o <code>gradef</code>. La lista <code>dependencies</code> es acumulativa: cada llamada a <code>depends</code> o <code>gradef</code> añade elementos adicionales.
</p>
<p>Véanse <code>depends</code> y <code>gradef</code>.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>depends</b><i> (<var>f_1</var>, <var>x_1</var>, ..., <var>f_n</var>, <var>x_n</var>)</i>
<a name="IDX804"></a>
</dt>
<dd><p>Declara dependencias funcionales entre variables con el propósito de calcular derivadas.
En ausencia de una dependencia declarada, <code>diff (f, x)</code> devuelve cero.
Si se declara <code>depends (f, x)</code>, <code>diff (f, x)</code> devuelve una derivada simbólica (esto es, una expresión con <code>diff</code>).
</p>
<p>Cada argumento  <var>f_1</var>, <var>x_1</var>, etc., puede ser el nombre de una variable, de un arreglo o una lista de nombres.
Cada elemento de <var>f_i</var> (quizás un único elemento) se declara como dependiente de cada elemento de <var>x_i</var> (quizás también un único elemento). Si alguno de los  <var>f_i</var> es el nombre de un arreglo o contiene el nombre de un arreglo, todos los elemento del arregl dependen de <var>x_i</var>.
</p>
<p>La función <code>diff</code> reconoce dependencias indirectas establecidas por <code>depends</code> y aplica la regla de la cadena en tales casos.
</p>
<p>La instrucción <code>remove (<var>f</var>, dependency)</code> borra todas las dependencias declaradas para <var>f</var>.
</p>
<p>La función <code>depends</code> devuelve una lista con las dependencias que han sido establecidas. Las dependencias se añaden a la variable global <code>dependencies</code>. La función <code>depends</code> evalúa sus argumentos.
</p>
<p>La función <code>diff</code> es la única instrucción de Maxima que reconoce las dependencias establecidas por <code>depends</code>. Otras funciones (<code>integrate</code>, <code>laplace</code>, etc.) solamente reconocen dependencias explícitamente representadas por sus argumentos. Por ejemplo, <code>integrate</code> no reconoce la dependencia de <code>f</code> respecto de <code>x</code>
a menos que se represente explícitamente como <code>integrate (f(x), x)</code>.
</p>
<pre class="example">(%i1) depends ([f, g], x);
(%o1)                     [f(x), g(x)]
(%i2) depends ([r, s], [u, v, w]);
(%o2)               [r(u, v, w), s(u, v, w)]
(%i3) depends (u, t);
(%o3)                        [u(t)]
(%i4) dependencies;
(%o4)      [f(x), g(x), r(u, v, w), s(u, v, w), u(t)]
(%i5) diff (r.s, u);
                         dr           ds
(%o5)                    -- . s + r . --
                         du           du
</pre>
<pre class="example">(%i6) diff (r.s, t);
                      dr du           ds du
(%o6)                 -- -- . s + r . -- --
                      du dt           du dt
</pre>
<pre class="example">(%i7) remove (r, dependency);
(%o7)                         done
(%i8) diff (r.s, t);
                                ds du
(%o8)                       r . -- --
                                du dt
</pre>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>derivabbrev</b>
<a name="IDX805"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>derivabbrev</code> vale <code>true</code>, las derivadas simbólicas (esto es, expresiones con <code>diff</code>) se muestran como subíndices. En otro caso, las derivadas se muestran en la notación de Leibniz, <code>dy/dx</code>.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>derivdegree</b><i> (<var>expr</var>, <var>y</var>, <var>x</var>)</i>
<a name="IDX806"></a>
</dt>
<dd><p>Devuelve el mayor grado de la derivada de la variable dependiente <var>y</var> respecto de la variable independiente <var>x</var> que aparece en <var>expr</var>.
</p>
<p>Ejemplo:
</p><pre class="example">(%i1) 'diff (y, x, 2) + 'diff (y, z, 3) + 'diff (y, x) * x^2;
                         3     2
                        d y   d y    2 dy
(%o1)                   --- + --- + x  --
                          3     2      dx
                        dz    dx
(%i2) derivdegree (%, y, x);
(%o2)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>derivlist</b><i> (<var>var_1</var>, ..., <var>var_k</var>)</i>
<a name="IDX807"></a>
</dt>
<dd><p>Hace que las derivadas calculadas por la instrucción <code>ev</code> se calculen respecto de las variables indicadas.
</p>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>derivsubst</b>
<a name="IDX808"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>derivsubst</code> vale <code>true</code>, una sustitución no sintáctica del estilo 
<code>subst (x, 'diff (y, t), 'diff (y, t, 2))</code> devuelve <code>'diff (x, t)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>diff</b><i> (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, ..., <var>x_m</var>, <var>n_m</var>)</i>
<a name="IDX809"></a>
</dt>
<dt><u>Función:</u> <b>diff</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX810"></a>
</dt>
<dt><u>Función:</u> <b>diff</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX811"></a>
</dt>
<dt><u>Función:</u> <b>diff</b><i> (<var>expr</var>)</i>
<a name="IDX812"></a>
</dt>
<dd><p>Devuelve la derivada o diferencial de  <var>expr</var> respecto de alguna o de todas las variables presentes en <var>expr</var>.
</p>
<p>La llamada <code>diff (<var>expr</var>, <var>x</var>, <var>n</var>)</code> devuelve la <var>n</var>-esima derivada de <var>expr</var> respecto de <var>x</var>.
</p>
<p>La llamada <code>diff (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, ..., <var>x_m</var>, <var>n_m</var>)</code>
devuelve la derivada parcial de <var>expr</var> con respecto de <var>x_1</var>, ..., <var>x_m</var>.
Equivale a <code>diff (... (diff (<var>expr</var>, <var>x_m</var>, <var>n_m</var>) ...), <var>x_1</var>, <var>n_1</var>)</code>.
</p>
<p>La llamada <code>diff (<var>expr</var>, <var>x</var>)</code>
devuelve la primera derivada de <var>expr</var> respecto de la variable <var>x</var>.
</p>
<p>La llamada <code>diff (<var>expr</var>)</code> devuelve el diferencial total de <var>expr</var>, esto es, la suma de las derivadas de <var>expr</var> respecto de cada una de sus variables, multiplicadas por el diferencial <code>del</code> de cada una de ellas.
</p>
<p>La forma nominal de <code>diff</code> es necesaria en algunos contextos, como para definir ecuaciones diferenciales.
En tales casos, <code>diff</code> puede ir precedida de un apóstrofo (como <code>'diff</code>) para evitar el cálculo de la derivada.
</p>
<p>Si <code>derivabbrev</code> vale <code>true</code>, las derivadas se muestran como subíndices. En otro caso, se muestran en la notación de Leibniz, <code>dy/dx</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) diff (exp (f(x)), x, 2);
                     2
              f(x)  d               f(x)  d         2
(%o1)       %e     (--- (f(x))) + %e     (-- (f(x)))
                      2                   dx
                    dx
(%i2) derivabbrev: true$
(%i3) 'integrate (f(x, y), y, g(x), h(x));
                         h(x)
                        /
                        [
(%o3)                   I     f(x, y) dy
                        ]
                        /
                         g(x)
(%i4) diff (%, x);
       h(x)
      /
      [
(%o4) I     f(x, y)  dy + f(x, h(x)) h(x)  - f(x, g(x)) g(x)
      ]            x                     x                  x
      /
       g(x)
</pre>
<p>Para el paquete sobre tensores se han introducido las siguientes modificaciones:
</p>
<p>(1) Las derivadas de los objetos indexados en <var>expr</var> tendrán las variables <var>x_i</var> añadidas como argumentos adicionales. Entonces se ordenarán todos los índices de derivadas.
</p>
<p>(2) Las <var>x_i</var> pueden ser enteros entre 1 hasta el valor de la variable <code>dimension</code> [valor por defecto: 4].  Esto hará que la diferenciación sea llevada a cabo con respecto al <var>x_i</var>-ésimo número de la lista <code>coordinates</code>, la cual debería contener una lista con los nombres de las coordenadas, por ejemplo, <code>[x, y, z, t]</code>. Si <code>coordinates</code> es una variableis atómica, entonces esa variable será utilizada como variable de diferenciación. Se permite la utilización de arreglos con los nombres de las coordenadas o nombres con subíndices, como <code>X[1]</code>, <code>X[2]</code>, ... to be used.  Si a <code>coordinates</code> no se le ha asignado ningún valor, entonces las variables serán tratadas como se ha indicado en (1).
</p>
</dd></dl>

<dl>
<dt><u>Símbolo especial:</u> <b>diff</b>
<a name="IDX813"></a>
</dt>
<dd><p>Si el nombre <code>diff</code> está presente en una llamada a la función <code>ev</code> en modo <code>evflag</code>, entonces se calculan todas las derivadas presentes en <code>expr</code>.
</p>
</dd></dl>


<dl>
<dt><u>Función:</u> <b>express</b><i> (<var>expr</var>)</i>
<a name="IDX814"></a>
</dt>
<dd><p>Transforma los nombres de los operadores diferenciales en expresiones que contienen derivadas parciales. Los operadores reconocidos por la función <code>express</code> son: <code>grad</code> (gradiente), <code>div</code> (divergencia), <code>curl</code> (rotacional), <code>laplacian</code> (laplaciano) y <code>~</code> (producto vectorial).
</p>
<p>Las derivadas simbólicas (es decir, las que incluyen la forma nominal <code>diff</code>) que aparecen en la expresión devuelta por <code>express</code>, se pueden calcular pasándole a <code>ev</code> el argumento <code>diff</code>, o escribiéndolo directamente en la línea de comandos. En este contexto, <code>diff</code> actúa como <code>evfun</code>.
</p>
<p>Es necesario ejecutar <code>load (&quot;vect&quot;)</code> para cargar esta función.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (&quot;vect&quot;)$
(%i2) grad (x^2 + y^2 + z^2);
                              2    2    2
(%o2)                  grad (z  + y  + x )
(%i3) express (%);
       d    2    2    2   d    2    2    2   d    2    2    2
(%o3) [-- (z  + y  + x ), -- (z  + y  + x ), -- (z  + y  + x )]
       dx                 dy                 dz
(%i4) ev (%, diff);
(%o4)                    [2 x, 2 y, 2 z]
(%i5) div ([x^2, y^2, z^2]);
                              2   2   2
(%o5)                   div [x , y , z ]
(%i6) express (%);
                   d    2    d    2    d    2
(%o6)              -- (z ) + -- (y ) + -- (x )
                   dz        dy        dx
(%i7) ev (%, diff);
(%o7)                    2 z + 2 y + 2 x
(%i8) curl ([x^2, y^2, z^2]);
                               2   2   2
(%o8)                   curl [x , y , z ]
(%i9) express (%);
       d    2    d    2   d    2    d    2   d    2    d    2
(%o9) [-- (z ) - -- (y ), -- (x ) - -- (z ), -- (y ) - -- (x )]
       dy        dz       dz        dx       dx        dy
(%i10) ev (%, diff);
(%o10)                      [0, 0, 0]
(%i11) laplacian (x^2 * y^2 * z^2);
                                  2  2  2
(%o11)                laplacian (x  y  z )
(%i12) express (%);
         2                2                2
        d     2  2  2    d     2  2  2    d     2  2  2
(%o12)  --- (x  y  z ) + --- (x  y  z ) + --- (x  y  z )
          2                2                2
        dz               dy               dx
(%i13) ev (%, diff);
                      2  2      2  2      2  2
(%o13)             2 y  z  + 2 x  z  + 2 x  y
(%i14) [a, b, c] ~ [x, y, z];
(%o14)                [a, b, c] ~ [x, y, z]
(%i15) express (%);
(%o15)          [b z - c y, c x - a z, a y - b x]
</pre>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>gradef</b><i> (<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>), <var>g_1</var>, ..., <var>g_m</var>)</i>
<a name="IDX815"></a>
</dt>
<dt><u>Función:</u> <b>gradef</b><i> (<var>a</var>, <var>x</var>, <var>expr</var>)</i>
<a name="IDX816"></a>
</dt>
<dd><p>Define las derivadas parciales, o componentes del gradiente, de la función <var>f</var> o variable <var>a</var>.
</p>
<p>La llamada <code>gradef (<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>), <var>g_1</var>, ..., <var>g_m</var>)</code>
define <code>d<var>f</var>/d<var>x_i</var></code> como <var>g_i</var>, 
donde <var>g_i</var> es una expresión; <var>g_i</var> puede ser una llamada a función, pero no el nombre de una función.
El número de derivadas parciales <var>m</var> puede ser menor que el número de argumentos <var>n</var>, en cuyo caso las derivadas se definen solamente con respecto a  <var>x_1</var>, ...., <var>x_m</var>.
</p>
<p>La llamada <code>gradef (<var>a</var>, <var>x</var>, <var>expr</var>)</code> define la derivada de la variable <var>a</var> respecto de <var>x</var> en <var>expr</var>. Con esto se establece la dependencia de <var>a</var> respecto de <var>x</var> a través de <code>depends (<var>a</var>, <var>x</var>)</code>.
</p>
<p>El primer argumento <code><var>f</var>(<var>x_1</var>, ..., <var>x_n</var>)</code> o <var>a</var> no se evalúa, pero sí lo hacen el resto de argumentos <var>g_1</var>, ..., <var>g_m</var>.  La llamada a <code>gradef</code> devuelve la función o variable para la que se define la derivada parcial.
</p>
<p>La instrucción <code>gradef</code> puede redefinir las derivadas de las funciones propias de Maxima.
Por ejemplo, <code>gradef (sin(x), sqrt (1 - sin(x)^2))</code> redefine la derivada de <code>sin</code>.
</p>
<p>La instrucción <code>gradef</code> no puede definir derivadas parciales de funciones subindicadas.
</p>
<p>La llamada <code>printprops ([<var>f_1</var>, ..., <var>f_n</var>], gradef)</code> muestra las derivadas parciales de las funciones <var>f_1</var>, ..., <var>f_n</var>, tal como las definió <code>gradef</code>.
</p>
<p>La llamada <code>printprops ([<var>a_n</var>, ..., <var>a_n</var>], atomgrad)</code> muestra las derivadas parciales de las variables <var>a_n</var>, ..., <var>a_n</var>, tal como las definió <code>gradef</code>.
</p>
<p>La variable <code>gradefs</code> contiene la lista de las funciones para las que se han definido derivadas parciales con la instrucción <code>gradef</code>, pero no incluye las variables para las que se han definido las derivadas parciales.
</p>
<p>Los gradientes son necesarios cuando una función no se conoce explícitamente pero sí sus primeras derivadas y es necesario calcular las derivadas de orden mayor.
</p>
</dd></dl>

<dl>
<dt><u>Variable del sistema:</u> <b>gradefs</b>
<a name="IDX817"></a>
</dt>
<dd><p>Valor por defecto: <code>[]</code>
</p>
<p>La variable <code>gradefs</code> contiene la lista de las funciones para las que se han definido derivadas parciales con la instrucción <code>gradef</code>, pero no incluye las variables para las que se han definido las derivadas parciales.
</p>
</dd></dl>

<dl>
<dt><u>Función:</u> <b>laplace</b><i> (<var>expr</var>, <var>t</var>, <var>s</var>)</i>
<a name="IDX818"></a>
</dt>
<dd><p>Calcula la transformada de Laplace de <var>expr</var> con respecto
de la variable <var>t</var> y parámetro de transformación <var>s</var>.
</p>
<p>La función <code>laplace</code> reconoce en <var>expr</var> las funciones
<code>delta</code>, <code>exp</code>, <code>log</code>, <code>sin</code>, <code>cos</code>,
<code>sinh</code>, <code>cosh</code> y <code>erf</code>, así como 
<code>derivative</code>, <code>integrate</code>, <code>sum</code> y <code>ilt</code>. 
Si <code>laplace</code> no encuentra una transformada, entonces
llama a la función <code>specint</code>, la cual puede encontrar
la transformada de Laplace de expresiones con funciones especiales,
tales como las de Bessel. <code>specint</code> también puede manipular la 
función <code>unit_step</code>. Véase <code>specint</code> para más información.
</p>
<p>Cuando tampoco <code>specint</code> sea capaz de encontrar una solución,
se devolverá una forma nominal.
</p>


<p>La función <code>laplace</code> reconoce integrales de convolución 
de la forma <code>integrate (f(x) * g(t - x), x, 0, t)</code>,
no pudiendo reconocer otros tipos de convoluciones.
</p>
<p>Las relaciones funcionales se deben representar explícitamente en <var>expr</var>; las relaciones implícitas establecidas por <code>depends</code> no son reconocidas. Así, si <var>f</var> depende de <var>x</var> y <var>y</var>, <code>f (x, y)</code> debe aparecer en <var>expr</var>.
</p>
<p>Véase también <code>ilt</code>, la transformada inversa de Laplace.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) laplace (exp (2*t + a) * sin(t) * t, t, s);
                            a
                          %e  (2 s - 4)
(%o1)                    ---------------
                           2           2
                         (s  - 4 s + 5)
(%i2) laplace ('diff (f (x), x), x, s);
(%o2)             s laplace(f(x), x, s) - f(0)
(%i3) diff (diff (delta (t), t), t);
                          2
                         d
(%o3)                    --- (delta(t))
                           2
                         dt
(%i4) laplace (%, t, s);
                            !
               d            !         2
(%o4)        - -- (delta(t))!      + s  - delta(0) s
               dt           !
                            !t = 0
(%i5) assume(a&gt;0)$
(%i6) laplace(gamma_incomplete(a,t),t,s),gamma_expand:true;
                                              - a - 1
                         gamma(a)   gamma(a) s
(%o6)                    -------- - -----------------
                            s            1     a
                                        (- + 1)
                                         s
(%i7) factor(laplace(gamma_incomplete(1/2,t),t,s));
                                              s + 1
                      sqrt(%pi) (sqrt(s) sqrt(-----) - 1)
                                                s
(%o7)                 -----------------------------------
                                3/2      s + 1
                               s    sqrt(-----)
                                           s
(%i8) assume(exp(%pi*s)&gt;1)$
(%i9) laplace(sum((-1)^n*unit_step(t-n*%pi)*sin(t),n,0,inf),t,s),simpsum;
                         %i                         %i
              ------------------------ - ------------------------
                              - %pi s                    - %pi s
              (s + %i) (1 - %e       )   (s - %i) (1 - %e       )
(%o9)         ---------------------------------------------------
                                       2
(%i9) factor(%);
                                      %pi s
                                    %e
(%o9)                   -------------------------------
                                             %pi s
                        (s - %i) (s + %i) (%e      - 1)

</pre>
</dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC108" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC110" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Viktor T. Toth</em> on <em>octubre, 3 2017</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
